//  Подсистема "Модель запроса"
//	Автор: Калякин Андрей Г.
//  https://github.com/KalyakinAG/query-model
//  https://infostart.ru/1c/articles/2639581/

#Область ПрограммныйИнтерфейс

#Область Конструктор

// Новый модель запроса
// 
// Возвращаемое значение:
//  Структура - Новый модель запроса:
// * СхемаЗапроса - СхемаЗапроса
// * Стек - Массив из Структура
// 
// * ЗапросПакета - ЗапросВыбораСхемыЗапроса, ЗапросУничтоженияТаблицыСхемыЗапроса -
// * ВложенныйЗапрос - ЗапросВыбораСхемыЗапроса -
// * ОператорВыбрать - ОператорВыбратьСхемыЗапроса -
// * Источник - ИсточникСхемыЗапроса -
// * Соединение - СоединениеИсточникаЗапросаСхемыЗапроса -
// * ТипСоединения - ТипСоединенияСхемыЗапроса -
// * ИсточникСлева - ИсточникСхемыЗапроса -
// * ИсточникСправа - ИсточникСхемыЗапроса -
// 
// * Поле - ВыражениеСхемыЗапроса -
// * КонтрольнаяТочка - КонтрольнаяТочкаИтоговСхемыЗапроса -
// 
// * МенеджерВременныхТаблиц - МенеджерВременныхТаблиц -
// * Параметры - Структура
// 
// * СтруктураЗапроса - Структура
// * Запрос - Запрос
// * Результат - РезультатЗапроса
// * Выбран - Булево
Функция НовыйМодельЗапроса() Экспорт
	
	МодельЗапроса = Новый Структура;
	МодельЗапроса.Вставить("СхемаЗапроса", Новый СхемаЗапроса);
	МодельЗапроса.Вставить("Стек", Новый Массив);
	// Запрос
	МодельЗапроса.Вставить("ЗапросПакета");
	МодельЗапроса.Вставить("ВложенныйЗапрос");
	МодельЗапроса.Вставить("ОператорВыбрать");
	МодельЗапроса.Вставить("ИндексЗапроса", Новый Структура);

	МодельЗапроса.Вставить("ИндексОператора");
	МодельЗапроса.Вставить("ВыбираемыеПоля");
	МодельЗапроса.Вставить("Колонки");
	// Источник
	МодельЗапроса.Вставить("Источник");
	МодельЗапроса.Вставить("ДоступныеПоля");
	// Соединение
	МодельЗапроса.Вставить("ИсточникСлева");
	МодельЗапроса.Вставить("ИсточникСправа");
	МодельЗапроса.Вставить("Соединение");
	МодельЗапроса.Вставить("ТипСоединения");
	// Поле
	МодельЗапроса.Вставить("Поле");
	МодельЗапроса.Вставить("КонтрольнаяТочка");
	// Параметры и менеджер ВТ
	МодельЗапроса.Вставить("МенеджерВременныхТаблиц");
	МодельЗапроса.Вставить("Параметры", Новый Структура);
	// Результат
	МодельЗапроса.Вставить("Запрос");
	МодельЗапроса.Вставить("Результат");
	МодельЗапроса.Вставить("ИндексРезультата", Новый Структура);
	МодельЗапроса.Вставить("Выбран", Ложь);
	//@skip-check constructor-function-return-section
	Возврат МодельЗапроса;

КонецФункции

Функция МодельЗапроса(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	МодельЗапроса = Обработки.МодельЗапроса.Создать();
	
	// Проверка 1-го параметра. Параметр может быть сложного типа, поэтому явная проверка на значение
	Если Параметр1 = Неопределено ИЛИ ПустаяСтрока(Параметр1) Тогда
		Возврат МодельЗапроса;
	КонецЕсли;
	
	ТипПараметра1 = ТипЗнч(Параметр1);
	
	Если ТипПараметра1 = Тип("СхемаКомпоновкиДанных") Тогда
		МодельЗапроса.УстановитьСхемуКомпоновкиДанных(Параметр1, Параметр2);
		Возврат МодельЗапроса;
	КонецЕсли;
	
	Если ТипПараметра1 = Тип("ТаблицаФормы") Тогда
		МодельЗапроса.УстановитьСхемуТаблицыСписка(Параметр1);
		Возврат МодельЗапроса;
	КонецЕсли;
	
	Если ТипПараметра1 = Тип("ДинамическийСписок") Тогда
		МодельЗапроса.УстановитьСхемуДинамическогоСписка(Параметр1);
		Возврат МодельЗапроса;
	КонецЕсли;
	
	Если ТипПараметра1 = Тип("Запрос") Тогда
		МодельЗапроса.УстановитьЗапрос(Параметр1);
		Возврат МодельЗапроса;
	КонецЕсли;
	
	Если ТипПараметра1 = Тип("СхемаЗапроса") Тогда
		Если ТипЗнч(Параметр2) = Тип("МенеджерВременныхТаблиц") Тогда
			МодельЗапроса.УстановитьМенеджерВременныхТаблиц(Параметр2);
		КонецЕсли;
		МодельЗапроса.УстановитьСхемуЗапроса(Параметр1);
		Возврат МодельЗапроса;
	КонецЕсли;
	
	Если ТипПараметра1 = Тип("МенеджерВременныхТаблиц") Тогда
		МодельЗапроса.УстановитьМенеджерВременныхТаблиц(Параметр1);
		Возврат МодельЗапроса;
	КонецЕсли;
	
	МодельЗапроса.УстановитьТекстЗапроса(Параметр1);
	Возврат МодельЗапроса;
	
КонецФункции

// Установить запрос.
// 
// Параметры:
//  НовыйЗапрос - Запрос
// 
// Возвращаемое значение:
//  ОбработкаОбъект.МодельЗапроса
Процедура УстановитьЗапрос(МодельЗапроса, НовыйЗапрос) Экспорт
	УстановитьМенеджерВременныхТаблиц(МодельЗапроса, НовыйЗапрос.МенеджерВременныхТаблиц);
	УстановитьТекстЗапроса(МодельЗапроса, НовыйЗапрос.Текст);
	Для Каждого ПараметрЗапроса Из НовыйЗапрос.Параметры Цикл
		Параметр(МодельЗапроса, ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
	КонецЦикла;
КонецПроцедуры

Процедура УстановитьСхемуЗапроса(МодельЗапроса, НоваяСхемаЗапроса) Экспорт
	МодельЗапроса.СхемаЗапроса = НоваяСхемаЗапроса;
	УстановитьЗапросПакета(МодельЗапроса);
КонецПроцедуры

Процедура УстановитьМенеджерВременныхТаблиц(МодельЗапроса, НовыйМенеджерВременныхТаблиц) Экспорт
	МодельЗапроса.МенеджерВременныхТаблиц = НовыйМенеджерВременныхТаблиц;
КонецПроцедуры

Процедура УстановитьТекстЗапроса(МодельЗапроса, ТекстЗапроса) Экспорт
	МодельЗапроса.СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	УстановитьЗапросПакета(МодельЗапроса);
КонецПроцедуры

#Область СКД

Процедура УстановитьСхемуКомпоновкиДанных(МодельЗапроса, Схема, Настройки) Экспорт
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(Схема, Настройки);
	ТекстЗапроса = МакетКомпоновкиДанных.НаборыДанных[0].Запрос;
	УстановитьТекстЗапроса(МодельЗапроса, ТекстЗапроса);
	Для Каждого ЗначениеПараметра Из МакетКомпоновкиДанных.ЗначенияПараметров Цикл
		Параметр(МодельЗапроса, ЗначениеПараметра.Имя, ЗначениеПараметра.Значение);
	КонецЦикла;
КонецПроцедуры

Процедура УстановитьСхемуТаблицыСписка(МодельЗапроса, ТаблицаСписка) Экспорт
	Схема = ТаблицаСписка.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = ТаблицаСписка.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	// Добавить в настройку отбор по текущей строке
	ПоляКлюча = ТаблицаСписка.ТекущаяСтрока;
	Если ПоляКлюча <> Неопределено Тогда
		Для Каждого ПолеКлюча Из ПоляКлюча Цикл
			ДобавитьОтборСКД(Настройки.Отбор, ПолеКлюча.Ключ, ПолеКлюча.Значение, ВидСравненияКомпоновкиДанных.Равно, Истина);
		КонецЦикла;
	КонецЕсли;
	// Добавить в настройку доступные поля
	Настройки.Структура[0].Выбор.Элементы.Очистить();
	Для Каждого ДоступноеПоле Из Настройки.Структура[0].Выбор.ДоступныеПоляВыбора.Элементы Цикл
		Если ДоступноеПоле.Таблица ИЛИ ДоступноеПоле.Папка Тогда
			Продолжить;
		КонецЕсли;
		ДобавитьВыбранноеПолеСКД(Настройки.Структура[0].Выбор, ДоступноеПоле.Поле);
	КонецЦикла;
	// Инициировать схему с настройками
	УстановитьСхемуКомпоновкиДанных(МодельЗапроса, Схема, Настройки);
КонецПроцедуры

Процедура УстановитьСхемуДинамическогоСписка(МодельЗапроса, Список) Экспорт
	УстановитьТекстЗапроса(МодельЗапроса, Список.ТекстЗапроса);
	Для Каждого ЭлементПараметра Из Список.Параметры.Элементы Цикл
		Параметр(МодельЗапроса, Строка(ЭлементПараметра.Параметр), ЭлементПараметра.Значение);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Курсор

Процедура УстановитьИсточник(МодельЗапроса, ИндексИлиПсевдоним = Неопределено) Экспорт
	МодельЗапроса.Источник = ПолучитьИсточник(МодельЗапроса, ИндексИлиПсевдоним);
КонецПроцедуры

Процедура УстановитьОператор(МодельЗапроса, Индекс = Неопределено) Экспорт
	ЗапросПакета = МодельЗапроса.ЗапросПакета;
	Если ТипЗнч(ЗапросПакета) = Тип("ЗапросУничтоженияТаблицыСхемыЗапроса") Тогда
		Возврат;
	КонецЕсли;
	Если Индекс = Неопределено Тогда
		ВыбранныйИндекс = ЗапросПакета.Операторы.Количество() - 1;
	Иначе
		ВыбранныйИндекс = Индекс;
	КонецЕсли;
	ОператорВыбрать = ЗапросПакета.Операторы[ВыбранныйИндекс];
	УстановитьИсточник(МодельЗапроса);
КонецПроцедуры

Функция УстановитьЗапросПакета(МодельЗапроса, Индекс = Неопределено) Экспорт
	Перем ВыбранныйИндекс;
	СхемаЗапроса = МодельЗапроса.СхемаЗапроса;
	Если Индекс = Неопределено Тогда
		ВыбранныйИндекс = СхемаЗапроса.ПакетЗапросов.Количество() - 1;
	ИначеЕсли ТипЗнч(Индекс) = Тип("Строка") Тогда
		Для Каждого Элемент Из СхемаЗапроса.ПакетЗапросов Цикл
			Если Элемент.ТаблицаДляПомещения = Индекс Тогда
				ВыбранныйИндекс = СхемаЗапроса.ПакетЗапросов.Индекс(Элемент);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ВыбранныйИндекс = Неопределено Тогда
			ВызватьИсключение "Не найден запрос с именем """ + Индекс + """";
		КонецЕсли;
	Иначе
		ВыбранныйИндекс = Индекс;
	КонецЕсли;
	ЗапросПакета = СхемаЗапроса.ПакетЗапросов[ВыбранныйИндекс];
	УстановитьОператор(МодельЗапроса);
КонецФункции

#КонецОбласти

#Область ЗапросПакета

Процедура Поместить(МодельЗапроса, ИмяВременнойТаблицы) Экспорт
	МодельЗапроса.ЗапросПакета.ТаблицаДляПомещения = ИмяВременнойТаблицы;
КонецПроцедуры


// Описание запроса.
// 
// Параметры:
//  МодельЗапроса - см. НовыйМодельЗапроса
//  ИмяЗапроса - Строка - Имя запроса
Процедура УстановитьИмяЗапроса(МодельЗапроса, ИмяЗапроса) Экспорт

	Индекс = МодельЗапроса.СхемаЗапроса.ПакетЗапросов.Количество()-1;
	МодельЗапроса.ИндексЗапроса.Вставить(ИмяЗапроса, Индекс);
	
КонецПроцедуры

// Добавляет оператор создания нового запроса в пакете
// 
// Параметры:
//  МодельЗапроса - см. НовыйМодельЗапроса
//  ИмяЗапроса - Строка - Имя запроса, которое может быть использовано при именованном обращении к результату запроса
Процедура ЗапросПакета(МодельЗапроса, ИмяЗапроса = "") Экспорт
	
	ЗаполнитьЗначенияСвойств(МодельЗапроса, НовыйСостояние());
	ПакетЗапросов = МодельЗапроса.СхемаЗапроса.ПакетЗапросов;
	
	Если ПакетЗапросов.Количество() = 1 И МодельЗапроса.СхемаЗапроса.ПолучитьТекстЗапроса() = "" Тогда
		
		ЗапросПакета = ПакетЗапросов[0];//  дефолтный запрос
		
	Иначе
		
		ЗапросПакета = ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
		
	КонецЕсли;
	
	МодельЗапроса.ЗапросПакета = ЗапросПакета;

	Если НЕ ПустаяСтрока(ИмяЗапроса) Тогда
		УстановитьИмяЗапроса(МодельЗапроса, ИмяЗапроса);
	КонецЕсли;

	МодельЗапроса.Колонки = ЗапросПакета.Колонки;
		
КонецПроцедуры

Процедура Индекс(МодельЗапроса, Поля, Уникальный = Ложь) Экспорт
	ИндексТаблицыЗапроса = МодельЗапроса.ЗапросПакета.Индексы.Добавить();//ИндексыСхемыЗапроса
	ИндексТаблицыЗапроса.Уникальный = Уникальный;
	ВыраженияИндекса = ИндексТаблицыЗапроса.ВыраженияИндекса;// ВыраженияИндексаСхемыЗапроса
	Для Каждого Поле Из ОбщийКлиентСервер.Массив(Поля) Цикл
		ВыраженияИндекса.Добавить(Поле);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область Источник

Процедура Источник(МодельЗапроса, Таблица, Знач Псевдоним = "", ПараметрыТаблицы = Неопределено) Экспорт
	
	Если МодельЗапроса.ОператорВыбрать = Неопределено Тогда
		Выбрать(МодельЗапроса);
	КонецЕсли;
	
	ТипИсточника = ТипЗнч(Таблица);
	
	Если ТипИсточника = Тип("Строка") Тогда

		Если СтрНачинаетсяС(Таблица, "{") Тогда
			//  Это таблица JSON
			ТаблицаИзJSON = РаботаСКоллекцией.СтруктураВТаблицуЗначений(Таблица);
			Источник(МодельЗапроса, ТаблицаИзJSON, Псевдоним);
			Возврат;
			
		КонецЕсли;
		
		Если СтрНачинаетсяС(Таблица, "&") Тогда
			//  Это параметр
			ДобавитьОписаниеВременнойТаблицы(МодельЗапроса, Таблица, Псевдоним);
			
			Если ПараметрыТаблицы <> Неопределено Тогда
				ИмяПараметра = Прав(Таблица, СтрДлина(Таблица) - 1);
				Параметр(МодельЗапроса, ИмяПараметра, ПараметрыТаблицы);
			КонецЕсли;
			
			Возврат;
			
		КонецЕсли;

		МенеджерВременныхТаблиц = МодельЗапроса.МенеджерВременныхТаблиц;
		ВременнаяТаблица = ?(МенеджерВременныхТаблиц <> Неопределено, МенеджерВременныхТаблиц.Таблицы.Найти(Таблица), Неопределено);
		
		Если ВременнаяТаблица <> Неопределено Тогда
			//  Это имя временной таблицы из менеджера временных таблиц
			ДобавитьОписаниеВременнойТаблицы(МодельЗапроса, Таблица, Псевдоним);
			
			Для Каждого Колонка Из ВременнаяТаблица.Колонки Цикл
				// При добавлении доступного поля необходимо указать Тип, хотя фактическое значение будет иметь тип ТипЗначения.
				// Ограничения:
				// 1. Доступ к полям через точку (например, Поле.ПодПоле) поддерживается только для объектов одного типа.
				// 2. Запрещено использовать оператор ССЫЛКА.
				// Обходное решение:
				// 1. Для работы с данными разных типов используйте явные соединения таблиц вместо вложенных полей.
				// 2. Для определения типа значения используйте функцию ТипЗначения() вместо ССЫЛКА.
				ДоступноеПоле(МодельЗапроса, Колонка.Имя, Колонка.ТипЗначения.Типы()[0]);
			КонецЦикла;
			
			Возврат;
			
		КонецЕсли;
		
		//  Это имя доступной таблицы в текущей схеме запроса
		ДобавитьИсточник(МодельЗапроса, Таблица, ?(ПустаяСтрока(Псевдоним), ОбщийКлиентСервер.ОкончаниеСтрокиПослеРазделителя(Таблица), Псевдоним));
		
		Если ПараметрыТаблицы <> Неопределено Тогда
			УстановитьПараметрыВиртуальнойТаблицы(МодельЗапроса.Источник, ПараметрыТаблицы);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	//  Это Таблица значений, ТабличнаяЧасть, ДанныеФормыКоллекцияЗначений
	ИмяПараметра = ОбщийКлиентСервер.ИмяПоУникальномуИдентификатору();
	ДобавитьОписаниеВременнойТаблицы(МодельЗапроса, "&" + ИмяПараметра, Псевдоним);
	
	Если ТипИсточника = Тип("ТаблицаЗначений") Тогда
		Для Каждого Колонка Из Таблица.Колонки Цикл
			ДоступноеПоле(МодельЗапроса, Колонка.Имя, Колонка.ТипЗначения.Типы()[0]);
		КонецЦикла;
		Параметр(МодельЗапроса, ИмяПараметра, Таблица);
	ИначеЕсли ТипИсточника = Тип("ДанныеФормыКоллекция") Тогда
		Результат = Таблица.Выгрузить();
		Для Каждого Колонка Из Результат.Колонки Цикл
			Если Колонка.Имя = "ИсходныйНомерСтроки" Тогда
				Продолжить;
			КонецЕсли;
			ДоступноеПоле(МодельЗапроса, Колонка.Имя, Колонка.ТипЗначения.Типы()[0]);
		КонецЦикла;
		Параметр(МодельЗапроса, ИмяПараметра, Результат);
	ИначеЕсли СтрНайти(Таблица, "ТабличнаяЧасть.") > 0 Тогда
		Результат = Таблица.Выгрузить();
		Для Каждого Колонка Из Результат.Колонки Цикл
			ДоступноеПоле(МодельЗапроса, Колонка.Имя, Колонка.ТипЗначения.Типы()[0]);
		КонецЦикла;
		Параметр(МодельЗапроса, ИмяПараметра, Результат);
	ИначеЕсли ТипИсточника = Тип("Структура") Тогда
		ТаблицаИзJSON = РаботаСКоллекцией.СтруктураВТаблицуЗначений(Таблица);
		Для Каждого Колонка Из ТаблицаИзJSON.Колонки Цикл
			ДоступноеПоле(МодельЗапроса, Колонка.Имя, Колонка.ТипЗначения.Типы()[0]);
		КонецЦикла;
		Параметр(МодельЗапроса, ИмяПараметра, ТаблицаИзJSON);
	ИначеЕсли ТипИсточника = Тип("ТабличныйДокумент") Тогда
		ОбластьЯчеек = Таблица.Область(1, 1, Таблица.ВысотаТаблицы, Таблица.ШиринаТаблицы);
		Построитель = Новый ПостроительЗапроса;
		Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);
		Построитель.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;
		Построитель.ЗаполнитьНастройки();
		Построитель.Выполнить();
		Результат = Построитель.Результат.Выгрузить();
		Для Каждого Колонка Из Результат.Колонки Цикл
			ДоступноеПоле(МодельЗапроса, Колонка.Имя, Колонка.ТипЗначения.Типы()[0]);
		КонецЦикла;
		Параметр(МодельЗапроса, ИмяПараметра, Результат);
	Иначе
		ВызватьИсключение СтрШаблон("Неизвестный тип источника %1", ТипИсточника);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЛевоеСоединение(МодельЗапроса, ПсевдонимСлева, ПсевдонимСправа, Условие = Неопределено) Экспорт
	Соединение(МодельЗапроса, ПсевдонимСлева, ПсевдонимСправа, Условие, ТипСоединенияСхемыЗапроса.ЛевоеВнешнее);
КонецПроцедуры

Процедура ПравоеСоединение(МодельЗапроса, ПсевдонимСлева, ПсевдонимСправа, Условие = Неопределено) Экспорт
	Соединение(МодельЗапроса, ПсевдонимСлева, ПсевдонимСправа, Условие, ТипСоединенияСхемыЗапроса.ПравоеВнешнее);
КонецПроцедуры

Процедура ПолноеСоединение(МодельЗапроса, ПсевдонимСлева, ПсевдонимСправа, Условие = Неопределено) Экспорт
	Соединение(МодельЗапроса, ПсевдонимСлева, ПсевдонимСправа, Условие, ТипСоединенияСхемыЗапроса.ПолноеВнешнее);
КонецПроцедуры

Процедура ВнутреннееСоединение(МодельЗапроса, ПсевдонимСлева, ПсевдонимСправа, Условие = Неопределено) Экспорт
	Соединение(МодельЗапроса, ПсевдонимСлева, ПсевдонимСправа, Условие, ТипСоединенияСхемыЗапроса.Внутреннее);
КонецПроцедуры

// Добавить условие соединения
// 
// Параметры:
//  СоответствиеПолей - Строка - условие соединения описывается через перечисление соответствия полей: ПолеСлева = ПолеСправа[,..]
//                               Допускается указать справа параметр: ПолеСлева = &Параметр. Если поля имеют одинаковое имя слева и справа, то
//                               достаточно указать просто имя поля: Поле, ПолеСлева = ПолеСправа[,..]
// 
Процедура Связь(МодельЗапроса, СоответствиеПолей, Действует = Истина) Экспорт
	Перем ДоступныеПоля;
	
	Если СоответствиеПолей = "*" Тогда
		ОбщиеПоля = Новый Массив;
		ДоступныеПоля = МодельЗапроса.ИсточникСправа.Источник.ДоступныеПоля;
		Для Каждого ПолеСлева Из МодельЗапроса.ИсточникСлева.Источник.ДоступныеПоля Цикл
			Если ДоступныеПоля.Найти(ПолеСлева.Имя) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ОбщиеПоля.Добавить(ПолеСлева.Имя);
		КонецЦикла;
		Выражение = УсловиеСоединения(ОбщиеПоля);
	Иначе
		Выражение = УсловиеСоединения(СоответствиеПолей);
	КонецЕсли;
	
	УсловиеСвязи(МодельЗапроса, Выражение, Действует);
	
КонецПроцедуры

// Добавить условие соединения
// 
// Параметры:
//  Выражение - Строка - Выражение условия соединения
Процедура УсловиеСвязи(МодельЗапроса, Знач Выражение, Действует = Истина) Экспорт

	Если НЕ Действует Тогда
		Возврат;
	КонецЕсли;
	
	ИсточникСлева = МодельЗапроса.ИсточникСлева;
	ПсевдонимСлева = ИсточникСлева.Источник.Псевдоним;
	ИсточникСправа = МодельЗапроса.ИсточникСправа;
	ПсевдонимСправа = ИсточникСправа.Источник.Псевдоним;
	Выражение = СтрЗаменить(Выражение, "%1", ПсевдонимСлева); 
	Выражение = СтрЗаменить(Выражение, "%2", ПсевдонимСправа);

	Если МодельЗапроса.Соединение = Неопределено Тогда
		
		ИсточникСлева.Соединения.Добавить(ПсевдонимСправа, Выражение);
		Соединение = ИсточникСлева.Соединения[МодельЗапроса.ИсточникСлева.Соединения.Количество()-1];
		Соединение.ТипСоединения = МодельЗапроса.ТипСоединения;
		МодельЗапроса.Соединение = Соединение;
		Возврат; 

	КонецЕсли;
	
	ДобавитьУсловиеСоединения(МодельЗапроса.Соединение, Выражение);		

КонецПроцедуры

Процедура ИсточникНачать(МодельЗапроса, Псевдоним) Экспорт
	ДобавитьВложенныйЗапрос(МодельЗапроса, Псевдоним);
	ВложенныйЗапрос = МодельЗапроса.Источник.Источник.Запрос;
	СохранитьСостояние(МодельЗапроса);
	МодельЗапроса.ЗапросПакета = ВложенныйЗапрос; 
	МодельЗапроса.Колонки = ВложенныйЗапрос.Колонки;
КонецПроцедуры

Процедура ИсточникЗавершить(МодельЗапроса) Экспорт
	ВосстановитьСостояние(МодельЗапроса);
КонецПроцедуры

Процедура ЗаменитьИсточник(МодельЗапроса, ПсевдонимИсточника, Таблица, НовыйПсевдоним = "") Экспорт
	
	Если ПустаяСтрока(НовыйПсевдоним) Тогда
		Псевдоним = ПсевдонимИсточника;
	КонецЕсли;
	
	ЗапросПакета = МодельЗапроса.ЗапросПакета;
	ОператорВыбрать = МодельЗапроса.ОператорВыбрать;
	ИндексОператора = ЗапросПакета.Операторы.Индекс(ОператорВыбрать);
	Источник = ОператорВыбрать.Источники.НайтиПоПсевдониму(ПсевдонимИсточника);
	ИндексИсточника = ОператорВыбрать.Источники.Индекс(Источник);
	
	// Сохранить все поля запроса
	ВыбираемыеПоля  = Новый Массив;
	Для Каждого Колонка Из ЗапросПакета.Колонки Цикл
		Выражение =  Строка(Колонка.Поля[ИндексОператора]);
		Если ПустаяСтрока(Выражение) Тогда // при нескольких объединениях часть полей может отсутствовать (NULL поля)
			Продолжить;
		КонецЕсли;
		ВыбираемыеПоля.Добавить(Новый Структура("Выражение, Псевдоним", Строка(Колонка.Поля[ИндексОператора]), Колонка.Псевдоним));
	КонецЦикла;
	
	// Сохранить все отборы
	Отборы = Новый Массив;
	Для Каждого Отбор Из ОператорВыбрать.Отбор Цикл
		Отборы.Добавить(Строка(Отбор));
	КонецЦикла;
	
	// Сохранить все соединения с источником
	Соединения = Новый Массив;
	Для Каждого ЭлементИсточника Из ОператорВыбрать.Источники Цикл
		Для Каждого ЭлементСоединения Из ЭлементИсточника.Соединения Цикл
			Если СтрНайти(ЭлементСоединения.Условие, ПсевдонимИсточника) > 0 Тогда
				Соединения.Добавить(Новый Структура("ИсточникСлева, ИсточникСправа, ТипСоединения, Условие", ЭлементИсточника.Источник.Псевдоним, ЭлементСоединения.Источник.Источник.Псевдоним, ЭлементСоединения.ТипСоединения, Строка(ЭлементСоединения.Условие)));
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ОператорВыбрать.Источники.Удалить(ИндексИсточника);
	ОператорВыбрать.Отбор.Очистить();	
	Источник(МодельЗапроса, Таблица, Псевдоним);
	
	// Восстановить сохраненные поля, отборы и соединения
	Если Псевдоним <> ПсевдонимИсточника Тогда
		
		Для Каждого ЭлементСоединения Из Соединения Цикл
			Соединение(МодельЗапроса, 
				СтрЗаменить(ЭлементСоединения.ИсточникСлева, ПсевдонимИсточника, Псевдоним), 
				СтрЗаменить(ЭлементСоединения.ИсточникСправа, ПсевдонимИсточника, Псевдоним), 
				СтрЗаменить(ЭлементСоединения.Условие, ПсевдонимИсточника, Псевдоним), 
				ЭлементСоединения.ТипСоединения
			);
		КонецЦикла;
		
		Для Каждого Поле Из ВыбираемыеПоля Цикл
			Попытка
				Поле(МодельЗапроса, СтрЗаменить(Поле.Выражение, ПсевдонимИсточника, Псевдоним), Поле.Псевдоним);
			Исключение
				// не все колонки могут быть в полях оператора
			КонецПопытки;
		КонецЦикла;
		
		Для каждого Отбор Из Отборы Цикл
			ОператорВыбрать.Отбор.Добавить(СтрЗаменить(Отбор, ПсевдонимИсточника, Псевдоним));
		КонецЦикла;
		
	Иначе
		
		Для каждого ЭлементСоединения Из Соединения Цикл
			Соединение(МодельЗапроса, 
				ЭлементСоединения.ИсточникСлева, 
				ЭлементСоединения.ИсточникСправа, 
				ЭлементСоединения.Условие, 
				ЭлементСоединения.ТипСоединения
			);
		КонецЦикла;
		
		Для каждого Поле Из ВыбираемыеПоля Цикл
			Попытка
				Поле(МодельЗапроса, Поле.Выражение, Поле.Псевдоним);
			Исключение
				// не все колонки могут быть в полях оператора
			КонецПопытки;
		КонецЦикла;
		
		Для каждого Отбор Из Отборы Цикл
			ОператорВыбрать.Отбор.Добавить(Отбор);
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура ДоступноеПоле(МодельЗапроса, Имя, Тип = Неопределено) Экспорт
	// Поскольку тип Строка нельзя ограничить (нет квалификатора строки как у типа значения),
	// то используется тип Неопределено.
	// Это нужно для того, чтобы не возникало фантомной ошибки
	// в условиях отбора и соединения: нельзя использовать поля неограниченной длины
	МодельЗапроса.ДоступныеПоля.Добавить(Имя, ?(Тип = Тип("Строка"), Неопределено, Тип));
КонецПроцедуры

#КонецОбласти

#Область АгрегатныеФункции

Процедура Сумма(МодельЗапроса, Выражение, Псевдоним = "", ВыражениеЕстьNull = "") Экспорт
	Поле(МодельЗапроса, СтрШаблон("СУММА(%1)", Выражение), Псевдоним(Выражение, Псевдоним), ВыражениеЕстьNull);
КонецПроцедуры

Процедура Среднее(МодельЗапроса, Выражение, Псевдоним = "") Экспорт
	Поле(МодельЗапроса, СтрШаблон("СРЕДНЕЕ(%1)", Выражение), Псевдоним(Выражение, Псевдоним));
КонецПроцедуры

Процедура Количество(МодельЗапроса, Выражение, Псевдоним = "") Экспорт
	Поле(МодельЗапроса, СтрШаблон("КОЛИЧЕСТВО(%1)", Выражение), Псевдоним(Выражение, Псевдоним));
КонецПроцедуры

Процедура КоличествоРазличных(МодельЗапроса, Выражение, Псевдоним = "") Экспорт
	Поле(МодельЗапроса, СтрШаблон("КОЛИЧЕСТВО(РАЗЛИЧНЫЕ %1)", Выражение), Псевдоним(Выражение, Псевдоним));
КонецПроцедуры

Процедура Максимум(МодельЗапроса, Выражение, Псевдоним = "") Экспорт
	Поле(МодельЗапроса, СтрШаблон("МАКСИМУМ(%1)", Выражение), Псевдоним(Выражение, Псевдоним));
КонецПроцедуры

Процедура Минимум(МодельЗапроса, Выражение, Псевдоним = "") Экспорт
	Поле(МодельЗапроса, СтрШаблон("МИНИМУМ(%1)", Выражение), Псевдоним(Выражение, Псевдоним));
КонецПроцедуры

// ГруппировкаПо - добавляет группировку по выражениям полей запроса.
// ГруппировкаПо используется неявно, если в выборке присутствуют агрегатные функции. В этом случае
// группировка неявно определяется по всем полям, которые не участвуют в агрегатных Процедурах.
// В случае необходимости определить группировку явно, следует использовать ГруппировкаПо.
// Многократное использование оператора ГруппировкаПо приводит к добавлению группировок в наборы группировок.
// 
// Параметры:
//  ПоляГруппировки - Строка - Поля группировки или выражения. Псевдонимы полей допускаются к использованию
//                             с ограничением - если исходное поле источника определяется однозначно
// 
// Возвращаемое значение:
//  ОбработкаОбъект.МодельЗапроса - Группировка по
Процедура ГруппировкаПо(МодельЗапроса, ПоляГруппировки) Экспорт
	ОператорВыбрать = МодельЗапроса.ОператорВыбрать;
	Если ЗначениеЗаполнено(ОператорВыбрать.Группировки[0]) Тогда
		ОператорВыбрать.Группировки.Добавить();
		Выражения = ОператорВыбрать.Группировки[ОператорВыбрать.Группировки.Количество() - 1];
		Для Каждого Выражение Из РаботаСМассивом.Массив(ПоляГруппировки) Цикл
			Выражения.Добавить(Новый ВыражениеСхемыЗапроса(Выражение));
		КонецЦикла;
		Возврат;
	КонецЕсли;
	Выражения = ОператорВыбрать.Группировка;
	Выражения.Очистить();
	Для Каждого Выражение Из РаботаСМассивом.Массив(ПоляГруппировки) Цикл
		Выражения.Добавить(Новый ВыражениеСхемыЗапроса(Выражение));
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область Итоги

Процедура Итог(МодельЗапроса, Выражение, Псевдоним) Экспорт
	МодельЗапроса.ЗапросПакета.ВыраженияИтогов.Добавить(Выражение, Псевдоним);
КонецПроцедуры

Процедура ИтогСумма(МодельЗапроса, Выражение, Псевдоним = "") Экспорт
	Итог(МодельЗапроса, СтрШаблон("СУММА(%1)", Выражение), ?(ПустаяСтрока(Псевдоним), Выражение, Псевдоним));
КонецПроцедуры

Процедура ИтогСреднее(МодельЗапроса, Выражение, Псевдоним = "") Экспорт
	Итог(МодельЗапроса, СтрШаблон("СРЕДНЕЕ(%1)", Выражение), ?(ПустаяСтрока(Псевдоним), Выражение, Псевдоним));
КонецПроцедуры

Процедура ИтогКоличество(МодельЗапроса, Выражение, Псевдоним = "") Экспорт
	Итог(МодельЗапроса, СтрШаблон("КОЛИЧЕСТВО(%1)", Выражение), ?(ПустаяСтрока(Псевдоним), Выражение, Псевдоним));
КонецПроцедуры

Процедура ИтогКоличествоРазличных(МодельЗапроса, Выражение, Псевдоним = "") Экспорт
	Итог(МодельЗапроса, СтрШаблон("КОЛИЧЕСТВО(РАЗЛИЧНЫЕ %1)", Выражение), ?(ПустаяСтрока(Псевдоним), Выражение, Псевдоним));
КонецПроцедуры

Процедура ИтогМаксимум(МодельЗапроса, Выражение, Псевдоним = "") Экспорт
	Итог(МодельЗапроса, СтрШаблон("МАКСИМУМ(%1)", Выражение), ?(ПустаяСтрока(Псевдоним), Выражение, Псевдоним));
КонецПроцедуры

Процедура ИтогМинимум(МодельЗапроса, Выражение, Псевдоним = "") Экспорт
	Итог(МодельЗапроса, СтрШаблон("МИНИМИУМ(%1)", Выражение), ?(ПустаяСтрока(Псевдоним), Выражение, Псевдоним));
КонецПроцедуры

// Группировка для итогов
// 
// Параметры:
//  Выражение - Строка - Выражение
//  ИмяКолонки - Строка - Имя колонки
//  ТипКонтрольнойТочки - ТипКонтрольнойТочкиСхемыЗапроса, Неопределено - Тип контрольной точки
//                        Иерархия, ТолькоИерархия, Элементы
Процедура Группировка(МодельЗапроса, Выражение, ИмяКолонки = "", ТипКонтрольнойТочки = Неопределено, ТипДополненияПериодами = Неопределено, НачалоПериода = "", КонецПериода = "") Экспорт
	КонтрольнаяТочка = МодельЗапроса.ЗапросПакета.КонтрольныеТочкиИтогов.Добавить(Выражение);
	КонтрольнаяТочка.ИмяКолонки					= ИмяКолонки;
	КонтрольнаяТочка.ТипКонтрольнойТочки 		= ?(ТипКонтрольнойТочки 	= Неопределено, ТипКонтрольнойТочкиСхемыЗапроса.Элементы, ТипКонтрольнойТочки);
	КонтрольнаяТочка.ТипДополненияПериодами 	= ?(ТипДополненияПериодами 	= Неопределено, ТипДополненияПериодамиСхемыЗапроса.БезДополнения, ТипДополненияПериодами);
	КонтрольнаяТочка.НачалоПериодаДополнения 	= ?(ТипЗнч(НачалоПериода) 	= Тип("Строка"), НачалоПериода, ФорматДатаВремя(НачалоПериода));
	КонтрольнаяТочка.КонецПериодаДополнения 	= ?(ТипЗнч(КонецПериода) 	= Тип("Строка"), КонецПериода, ФорматДатаВремя(КонецПериода));
	МодельЗапроса.КонтрольнаяТочка = КонтрольнаяТочка;
КонецПроцедуры

// Группировки для итогов
// 
// Параметры:
//  Выражения - Массив из Строка - Выражения группировок итогов в формате "Выражение КАК Псевдоним", "Выражение"
// 
// Возвращаемое значение:
//  ОбработкаОбъект.МодельЗапроса
Процедура Группировки(МодельЗапроса,Выражения) Экспорт
	МассивВыражений = ?(ТипЗнч(Выражения) = Тип("Массив"), Выражения, СтрРазделить(Выражения, ","));
	Для Каждого ВыражениеПоля Из МассивВыражений Цикл
		ПозицияТокена = СтрНайти(ВРег(ВыражениеПоля), " КАК ");
		Если ПозицияТокена = 0 Тогда
			Псевдоним = "";
			Выражение = ВыражениеПоля;
		Иначе
			Выражение = Лев(ВыражениеПоля, ПозицияТокена - 1);
			Псевдоним = Прав(ВыражениеПоля, СтрДлина(ВыражениеПоля) - ПозицияТокена - 4);
		КонецЕсли;			
		Группировка(МодельЗапроса, Выражение, Псевдоним);
	КонецЦикла;
КонецПроцедуры

Процедура Итоги(МодельЗапроса, Выражения) Экспорт
	МассивВыражений = ?(ТипЗнч(Выражения) = Тип("Массив"), Выражения, СтрРазделить(Выражения, ","));
	Для Каждого ВыражениеПоля Из МассивВыражений Цикл
		ПозицияТокена = СтрНайти(ВРег(ВыражениеПоля), " КАК ");
		Если ПозицияТокена = 0 Тогда
			Псевдоним = "";
			Выражение = ВыражениеПоля;
		Иначе
			Выражение = Лев(ВыражениеПоля, ПозицияТокена - 1);
			Псевдоним = Прав(ВыражениеПоля, СтрДлина(ВыражениеПоля) - ПозицияТокена - 4);
		КонецЕсли;			
		Итог(МодельЗапроса, Выражение, Псевдоним);
	КонецЦикла;
КонецПроцедуры

// Дополнение результата запроса датами в установленном периоде
// https://its.1c.ru/db/metod8dev/content/2660/hdoc
Процедура ПоПериодам(МодельЗапроса, ТипДополненияПериодами, НачалоПериода = "", КонецПериода = "") Экспорт
	КонтрольнаяТочка = МодельЗапроса.КонтрольнаяТочка;
	КонтрольнаяТочка.ТипДополненияПериодами = ?(ТипДополненияПериодами = Неопределено, ТипДополненияПериодамиСхемыЗапроса.БезДополнения, ТипДополненияПериодами);
	КонтрольнаяТочка.НачалоПериодаДополнения = ?(ТипЗнч(НачалоПериода) = Тип("Строка"), НачалоПериода, ФорматДатаВремя(НачалоПериода));
	КонтрольнаяТочка.КонецПериодаДополнения = ?(ТипЗнч(КонецПериода) = Тип("Строка"), КонецПериода, ФорматДатаВремя(КонецПериода));
КонецПроцедуры

Процедура ОбщиеИтоги(МодельЗапроса) Экспорт
	МодельЗапроса.ЗапросПакета.ОбщиеИтоги = Истина;
КонецПроцедуры

#КонецОбласти

#Область Оператор

// Оператор
// 
// Параметры:
//  МодельЗапроса - См. НовыйМодельЗапросаПараметры
//  Количество - Число, Неопределено - количество записей
//  Различные - Булево, Неопределено - уникальные записи
//  ТипОбъединения - ТипОбъединенияСхемыЗапроса, Неопределено - Тип объединения
//  ИндексКопии - Неопределено - Индекс копии оператора. Если указан, то будет добавлена копия оператора по индексу. 
//               Допускается указывать отностельный индекс со знаком "-", например -1 - предыдущий оператор
Процедура Выбрать(МодельЗапроса, Количество = Неопределено, Различные = Неопределено, ТипОбъединения = Неопределено, ИндексКопии = Неопределено) Экспорт
	
	ЗапросПакета = МодельЗапроса.ЗапросПакета;
	
	Если ИндексКопии <> Неопределено Тогда
		Если ТипЗнч(ИндексКопии) = Тип("Число") Тогда
			Если ИндексКопии < 0 Тогда
				ОператорИсточник = ЗапросПакета.Операторы[ЗапросПакета.Операторы.Количество() + ИндексКопии];
			Иначе
				ОператорИсточник = ЗапросПакета.Операторы[ИндексКопии];
			КонецЕсли;
		ИначеЕсли ТипЗнч(ИндексКопии) = Тип("ОператорВыбратьСхемыЗапроса") Тогда
			ОператорИсточник = ИндексКопии;
		Иначе
			ВызватьИсключение "Неизвестный тип оператора-источника: " + ТипЗнч(ИндексКопии);
		КонецЕсли;
		ОператорВыбрать = ЗапросПакета.Операторы.Добавить(ОператорИсточник);
	Иначе
		Если ЗапросПакета.Операторы.Количество() = 1 Тогда
			ОператорВыбрать = ЗапросПакета.Операторы[0];
			Если НЕ ОператорВыбрать.Источники.Количество() = 0 ИЛИ НЕ ОператорВыбрать.ВыбираемыеПоля.Количество() = 0 Тогда
				ОператорВыбрать = ЗапросПакета.Операторы.Добавить();
			КонецЕсли;
		Иначе
			ОператорВыбрать = ЗапросПакета.Операторы.Добавить();
		КонецЕсли; 
	КонецЕсли;
	
	Если Количество <> Неопределено Тогда
		ОператорВыбрать.КоличествоПолучаемыхЗаписей = Количество;
	КонецЕсли;
	
	Если Различные <> Неопределено Тогда
		ОператорВыбрать.ВыбиратьРазличные = Различные;
	КонецЕсли;
	
	ОператорВыбрать.ТипОбъединения = ?(ТипОбъединения = Неопределено, ТипОбъединенияСхемыЗапроса.ОбъединитьВсе, ТипОбъединения);
	МодельЗапроса.ИндексОператора = ЗапросПакета.Операторы.Индекс(ОператорВыбрать);
	МодельЗапроса.ВыбираемыеПоля = ОператорВыбрать.ВыбираемыеПоля;
	МодельЗапроса.ОператорВыбрать = ОператорВыбрать;
	
КонецПроцедуры

// Создание оператора выборки. См. Выбрать
// 
Процедура Объединить(МодельЗапроса, Количество = Неопределено, Различные = Неопределено, ТипОбъединения = Неопределено, ИндексКопии = Неопределено) Экспорт
	Выбрать(МодельЗапроса, Количество, Различные, ?(ТипОбъединения = Неопределено, ТипОбъединенияСхемыЗапроса.Объединить, ТипОбъединения), ИндексКопии);
КонецПроцедуры

// Создание оператора выборки. См. Выбрать
// 
Процедура ОбъединитьВсе(МодельЗапроса, Количество = Неопределено, Различные = Неопределено, ИндексКопии = Неопределено) Экспорт
	Выбрать(МодельЗапроса, Количество, Различные, ТипОбъединенияСхемыЗапроса.ОбъединитьВсе, ИндексКопии);
КонецПроцедуры

// Добавить поле в операторе выбора
// 
// Параметры:
//  Выражение - Строка - Выражение
//  Псевдоним - Строка - Псевдоним
//  ВыражениеЕстьNull - Строка - Выражение есть null
Процедура Поле(МодельЗапроса, Знач Выражение, Знач Псевдоним = "", ВыражениеЕстьNull = "") Экспорт
	Перем Поле;
	
	Если ТипЗнч(Выражение) <> Тип("Строка") Тогда
		ИмяПараметра = ОбщийКлиентСервер.ИмяПоУникальномуИдентификатору();
		Параметр(МодельЗапроса, ИмяПараметра, Выражение);
		Поле(МодельЗапроса, "&" + ИмяПараметра, Псевдоним, ВыражениеЕстьNull);
		Возврат;
	КонецЕсли;
	
	ЗапросПакета = МодельЗапроса.ЗапросПакета;
	ОператорВыбрать = МодельЗапроса.ОператорВыбрать;
	ИндексОператора = МодельЗапроса.ИндексОператора;
	ВыбираемыеПоля	= МодельЗапроса.ВыбираемыеПоля;
	Колонки = ЗапросПакета.Колонки;

	Если СтрЗаканчиваетсяНа(Выражение, "*") Тогда
		ПозицияТочки = СтрНайти(Выражение, ".");
		Если ПозицияТочки = 0 Тогда // поля по всем источникам, доступным из оператора
			Для каждого Источник Из ОператорВыбрать.Источники Цикл
				ПсевдонимИсточника = Источник.Источник.Псевдоним;
				Для каждого ДоступноеПоле Из Источник.Источник.ДоступныеПоля Цикл
					мПутьКПолю = ПсевдонимИсточника + "." + ДоступноеПоле.Имя;
					Колонка = Колонки.Найти(ДоступноеПоле.Имя);
					Если ВыбираемыеПоля.Найти(мПутьКПолю) <> Неопределено ИЛИ Колонка <> Неопределено И Колонка.Поля[ИндексОператора] <> Неопределено Тогда
						Продолжить;
					КонецЕсли;
					Если ТипЗнч(ДоступноеПоле) = Тип("ДоступноеПолеСхемыЗапроса") Тогда
						Если Колонка <> Неопределено Тогда
							Поле = ВыбираемыеПоля.Добавить(мПутьКПолю, Колонки.Индекс(Колонка));
						Иначе
							Поле = ВыбираемыеПоля.Добавить(мПутьКПолю);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		Иначе// поля из указанного до точки источником
			ПсевдонимИсточника = Лев(Выражение, ПозицияТочки-1);
			Для каждого ДоступноеПоле Из ОператорВыбрать.Источники.НайтиПоПсевдониму(ПсевдонимИсточника).Источник.ДоступныеПоля Цикл
				мПутьКПолю = ПсевдонимИсточника + "." + ДоступноеПоле.Имя;
				Колонка = Колонки.Найти(ДоступноеПоле.Имя);
				Если ВыбираемыеПоля.Найти(мПутьКПолю) <> Неопределено ИЛИ Колонка <> Неопределено И Колонка.Поля[ИндексОператора] <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				Если ТипЗнч(ДоступноеПоле) = Тип("ДоступноеПолеСхемыЗапроса") Тогда
					Если Колонка <> Неопределено Тогда
						Поле = ВыбираемыеПоля.Добавить(мПутьКПолю, Колонки.Индекс(Колонка));
					Иначе
						Поле = ВыбираемыеПоля.Добавить(мПутьКПолю);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(ВыражениеЕстьNull) Тогда
			// Замена дефолтного псевдонима
			Если НЕ ЗначениеЗаполнено(Псевдоним) Тогда
				Псевдоним = Псевдоним(Выражение, Псевдоним);
			КонецЕсли;
			Выражение = СтрШаблон("ЕСТЬNULL(%1, %2)", Выражение, ВыражениеЕстьNull);
		КонецЕсли;
		ИндексКолонки = Неопределено;
		Если НЕ ПустаяСтрока(Псевдоним) Тогда // найти индекс колонки по псевдониму
			Колонка = Колонки.Найти(Псевдоним);
			Если Колонка <> Неопределено Тогда
				ИндексКолонки = Колонки.Индекс(Колонка);
			КонецЕсли;
		КонецЕсли;
		Если ИндексКолонки = Неопределено Тогда
			Если ИндексОператора > 0 И НЕ ПустаяСтрока(Псевдоним) Тогда
				//  Добавление колонки Null, чтобы добавить поле в существующий индекс добавленной колонки
				ЗапросПакета.Операторы[0].ВыбираемыеПоля.Добавить("Null");
				ИндексКолонки = Колонки.Количество() - 1;
				Колонки[ИндексКолонки].Псевдоним = Псевдоним;
				Поле = ВыбираемыеПоля.Добавить(Выражение, ИндексКолонки);
			Иначе
				Поле = ВыбираемыеПоля.Добавить(Выражение);
				Если НЕ ПустаяСтрока(Псевдоним) Тогда
					ИндексКолонки = Колонки.Количество() - 1;
					Колонки[ИндексКолонки].Псевдоним = Псевдоним;
				КонецЕсли; 
			КонецЕсли;
		Иначе
			Поле = ВыбираемыеПоля.Добавить(Выражение, ИндексКолонки);
			Если НЕ ПустаяСтрока(Псевдоним) Тогда
				Колонки[ИндексКолонки].Псевдоним = Псевдоним;// восстановление псевдонима, который сбрасывается при добавлении поля по дефолту
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
	
	МодельЗапроса.Поле = Поле;

КонецПроцедуры

Процедура Автопорядок(МодельЗапроса, Значение = Истина) Экспорт
	МодельЗапроса.ЗапросПакета.Автопорядок = Значение;
КонецПроцедуры

Процедура Порядок(МодельЗапроса, Выражение, Знач Направление = Неопределено) Экспорт
	
	Если ТипЗнч(Направление) = Тип("Строка") Тогда
		Если Направление = "-" Тогда
			Направление = НаправлениеПорядкаСхемыЗапроса.ПоУбыванию;
		ИначеЕсли Направление = "+" Тогда
			Направление = НаправлениеПорядкаСхемыЗапроса.ПоВозрастанию;
		Иначе
			ВызватьИсключение СтрШаблон("Некорректное значение параметра Направление: %1", Направление);
		КонецЕсли;
	КонецЕсли;
					
	ВыражениеПорядка = МодельЗапроса.ЗапросПакета.Порядок.Добавить(Выражение);
	ВыражениеПорядка.Направление = ?(Направление = Неопределено, НаправлениеПорядкаСхемыЗапроса.ПоВозрастанию, Направление);
	
КонецПроцедуры

// Добавить условие отбора в оператор выбора
// 
// Параметры:
//  Выражение - Строка, ВыраженияСхемыЗапроса - выражение отбора, соответствует выражению ГДЕ
// 
// Возвращаемое значение:
//  ОбработкаОбъект.МодельЗапроса
Процедура Отбор(МодельЗапроса, Выражение, Действует = Истина) Экспорт
	Если НЕ Действует Тогда
		Возврат;
	КонецЕсли;
	МодельЗапроса.ОператорВыбрать.Отбор.Добавить(Выражение);
КонецПроцедуры

#КонецОбласти

#Область ВиртуальнаяТаблица

Функция ПараметрыВиртуальнойТаблицы(ИмяТаблицы, Параметры = Неопределено) Экспорт
	МассивСлов						= СтрРазделить(ИмяТаблицы, ".");
	ОбобщенноеИмяВиртуальнойТаблицы	= ВРег(МассивСлов[0]+"."+МассивСлов[МассивСлов.ВГраница()]);
	Если 		ОбобщенноеИмяВиртуальнойТаблицы = "РЕГИСТРНАКОПЛЕНИЯ.ОБОРОТЫ" Тогда
		ОписаниеПараметров = "НачалоПериода,КонецПериода,Периодичность,Условие";
	ИначеЕсли 	ОбобщенноеИмяВиртуальнойТаблицы = "РЕГИСТРСВЕДЕНИЙ.СРЕЗПЕРВЫХ"
		ИЛИ 	ОбобщенноеИмяВиртуальнойТаблицы = "РЕГИСТРСВЕДЕНИЙ.СРЕЗПОСЛЕДНИХ" 
		ИЛИ 	ОбобщенноеИмяВиртуальнойТаблицы = "РЕГИСТРНАКОПЛЕНИЯ.ОСТАТКИ" Тогда
		ОписаниеПараметров = "Период,Условие";
	ИначеЕсли 	ОбобщенноеИмяВиртуальнойТаблицы = "РЕГИСТРНАКОПЛЕНИЯ.ОСТАТКИИОБОРОТЫ" Тогда
		ОписаниеПараметров = "НачалоПериода,КонецПериода,Периодичность,МетодДополненияПериодов,Условие";
	ИначеЕсли 	ОбобщенноеИмяВиртуальнойТаблицы = "РЕГИСТРБУХГАЛТЕРИИ.ОСТАТКИ" Тогда
		ОписаниеПараметров = "Период,УсловиеСчета,Субконто,Условие";
	ИначеЕсли 	ОбобщенноеИмяВиртуальнойТаблицы = "РЕГИСТРБУХГАЛТЕРИИ.ДВИЖЕНИЯССУБКОНТО" Тогда
		ОписаниеПараметров = "НачалоПериода,КонецПериода,Условие,Порядок,Первые";
	ИначеЕсли 	ОбобщенноеИмяВиртуальнойТаблицы = "РЕГИСТРБУХГАЛТЕРИИ.ОБОРОТЫ" Тогда
		ОписаниеПараметров = "НачалоПериода,КонецПериода,Периодичность,УсловиеСчета,Субконто,Условие,УсловиеКорСчета,КорСубконто";
	ИначеЕсли 	ОбобщенноеИмяВиртуальнойТаблицы = "РЕГИСТРБУХГАЛТЕРИИ.ОБОРОТЫДТКТ" Тогда
		ОписаниеПараметров = "НачалоПериода,КонецПериода,Периодичность,УсловиеСчетаДт,СубконтоДт,УсловиеСчетаКт,СубконтоКт,Условие";
	ИначеЕсли 	ОбобщенноеИмяВиртуальнойТаблицы = "РЕГИСТРБУХГАЛТЕРИИ.ОСТАТКИИОБОРОТЫ" Тогда
		ОписаниеПараметров = "НачалоПериода,КонецПериода,Периодичность,МетодДополненияПериодов,УсловиеСчета,Субконто,Условие";
	ИначеЕсли 	ОбобщенноеИмяВиртуальнойТаблицы = "РЕГИСТРРАСЧЕТА.ФАКТИЧЕСКИЙПЕРИОДДЕЙСТВИЯ"
		Или 	ОбобщенноеИмяВиртуальнойТаблицы = "РЕГИСТРРАСЧЕТА.ДАННЫЕГРАФИКА"	Тогда
		ОписаниеПараметров = "Условие";
	ИначеЕсли 	СтрНачинаетсяС(ОбобщенноеИмяВиртуальнойТаблицы, "РЕГИСТРРАСЧЕТА.БАЗА") Тогда
		ОписаниеПараметров = "ИзмеренияОсновногоРегистра,ИзмеренияБазовогоРегистра,Разрезы,Условие";
	ИначеЕсли 	ОбобщенноеИмяВиртуальнойТаблицы = "ЗАДАЧА.ЗАДАЧИПОИСПОЛНИТЕЛЮ" Тогда
		ОписаниеПараметров = "Условие,Исполнитель";
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	МассивПараметров	= СтрРазделить(ОписаниеПараметров, ",");
	СтруктураПараметров	= Новый Структура;
	Если Параметры = Неопределено Тогда
		Для Индекс = 0 По МассивПараметров.ВГраница() Цикл
			СтруктураПараметров.Вставить(МассивПараметров[Индекс], Индекс);
		КонецЦикла;
	Иначе
		Для Индекс = 0 По МассивПараметров.ВГраница() Цикл
			Выражение = Строка(Параметры[Индекс].Выражение);
			Если ПустаяСтрока(Выражение) Тогда
				Продолжить;
			КонецЕсли;
			СтруктураПараметров.Вставить(МассивПараметров[Индекс], ОбщийКлиентСервер.ЭкранироватьТекст(Выражение));
		КонецЦикла;
	КонецЕсли;
	Возврат ?(СтруктураПараметров.Количество() = 0, Неопределено, СтруктураПараметров);
КонецФункции

// Добавить условие в параметрах виртуальной таблицы
// 
// Параметры:
//  Выражение - Строка - Выражение условия виртуальной таблицы
// 
// Возвращаемое значение:
//  ОбработкаОбъект.МодельЗапроса
Процедура Условие(МодельЗапроса, Выражение, Действует = Истина) Экспорт
	Если НЕ Действует Тогда
		Возврат;
	КонецЕсли;
	ДополнитьВыражениеПараметра(МодельЗапроса.Источник, "Условие", Выражение);
КонецПроцедуры

Процедура УсловиеСчета(МодельЗапроса, Выражение, Действует = Истина) Экспорт
	Если НЕ Действует Тогда
		Возврат;
	КонецЕсли;
	ДополнитьВыражениеПараметра(МодельЗапроса.Источник, "УсловиеСчета", Выражение);
КонецПроцедуры

Процедура УсловиеКорСчета(МодельЗапроса, Выражение, Действует = Истина) Экспорт
	Если НЕ Действует Тогда
		Возврат;
	КонецЕсли;
	ДополнитьВыражениеПараметра(МодельЗапроса.Источник, "УсловиеКорСчета", Выражение);
КонецПроцедуры

Процедура УсловиеСчетаДт(МодельЗапроса, Выражение, Действует = Истина) Экспорт
	Если НЕ Действует Тогда
		Возврат;
	КонецЕсли;
	ДополнитьВыражениеПараметра(МодельЗапроса.Источник, "УсловиеСчетаДт", Выражение);
КонецПроцедуры

Процедура УсловиеСчетаКт(МодельЗапроса, Выражение, Действует = Истина) Экспорт
	Если НЕ Действует Тогда
		Возврат;
	КонецЕсли;
	ДополнитьВыражениеПараметра(МодельЗапроса.Источник, "УсловиеСчетаКт", Выражение);
КонецПроцедуры

Процедура Субконто(МодельЗапроса, Значение) Экспорт
	ДополнитьСубконто(МодельЗапроса.Источник, МодельЗапроса.Параметры, "Субконто", Значение);
КонецПроцедуры

Процедура КорСубконто(МодельЗапроса, Значение) Экспорт
	ДополнитьСубконто(МодельЗапроса.Источник, МодельЗапроса.Параметры, "КорСубконто", Значение);
КонецПроцедуры

Процедура СубконтоДт(МодельЗапроса, Значение) Экспорт
	ДополнитьСубконто(МодельЗапроса.Источник, МодельЗапроса.Параметры, "СубконтоДт", Значение);
КонецПроцедуры

Процедура СубконтоКт(МодельЗапроса, Значение) Экспорт
	ДополнитьСубконто(МодельЗапроса.Источник, МодельЗапроса.Параметры, "СубконтоКт", Значение);
КонецПроцедуры

Функция Движения(МодельЗапроса) Экспорт
	ПараметрТаблицы(МодельЗапроса, "МетодДополненияПериодов", "Движения");
КонецФункции

Функция ДвиженияИГраницыПериода(МодельЗапроса) Экспорт
	ПараметрТаблицы(МодельЗапроса, "МетодДополненияПериодов", "ДвиженияИГраницыПериода");
КонецФункции

Процедура ПараметрТаблицы(МодельЗапроса, ИмяПараметра, Значение) Экспорт
	УстановитьПараметрыВиртуальнойТаблицы(МодельЗапроса.Источник, Новый Структура(ИмяПараметра, Значение));
КонецПроцедуры

// Добавить параметр виртуальной таблицы Начало периода.
// 
// Параметры:
//  Значение - Строка - Значение даты, для параметра использовать &
// 
// Возвращаемое значение:
//  ОбработкаОбъект.МодельЗапроса
Процедура НачалоПериода(МодельЗапроса, Значение) Экспорт
	ПараметрТаблицы(МодельЗапроса, "НачалоПериода", ФорматДатаВремя(Значение));
КонецПроцедуры

// Добавить параметр виртуальной таблицы Конец периода.
Процедура КонецПериода(МодельЗапроса, Значение) Экспорт
	ПараметрТаблицы(МодельЗапроса, "КонецПериода", ФорматДатаВремя(Значение));
КонецПроцедуры

// Добавить параметр виртуальной таблицы.
Процедура Период(МодельЗапроса, Значение) Экспорт
	ПараметрТаблицы(МодельЗапроса, "Период", ФорматДатаВремя(Значение));
КонецПроцедуры

// Добавить параметр виртуальной таблицы.
Процедура Периодичность(МодельЗапроса, Значение) Экспорт
	ПараметрТаблицы(МодельЗапроса, "Периодичность", Значение);
КонецПроцедуры

// Добавить параметр виртуальной таблицы.
Процедура ПериодичностьЗапись(МодельЗапроса) Экспорт
	Периодичность(МодельЗапроса, "Запись");
КонецПроцедуры

// Добавить параметр виртуальной таблицы.
Процедура ПериодичностьРегистратор(МодельЗапроса) Экспорт
	Периодичность(МодельЗапроса, "Регистратор");
КонецПроцедуры

// Добавить параметр виртуальной таблицы.
Процедура ПериодичностьПериод(МодельЗапроса) Экспорт
	Периодичность(МодельЗапроса, "Период");
КонецПроцедуры

// Добавить параметр виртуальной таблицы.
Процедура ПериодичностьСекунда(МодельЗапроса) Экспорт
	Периодичность(МодельЗапроса, "Секунда");
КонецПроцедуры

// Добавить параметр виртуальной таблицы.
Процедура ПериодичностьМинута(МодельЗапроса) Экспорт
	Периодичность(МодельЗапроса, "Минута");
КонецПроцедуры

// Добавить параметр виртуальной таблицы.
Процедура ПериодичностьЧас(МодельЗапроса) Экспорт
	Периодичность(МодельЗапроса, "Час");
КонецПроцедуры

// Добавить параметр виртуальной таблицы.
Процедура ПериодичностьДень(МодельЗапроса) Экспорт
	Периодичность(МодельЗапроса, "День");
КонецПроцедуры

// Добавить параметр виртуальной таблицы.
Процедура ПериодичностьНеделя(МодельЗапроса) Экспорт
	Периодичность(МодельЗапроса, "Неделя");
КонецПроцедуры

// Добавить параметр виртуальной таблицы.
Процедура ПериодичностьДекада(МодельЗапроса) Экспорт
	Периодичность(МодельЗапроса, "Декада");
КонецПроцедуры

// Добавить параметр виртуальной таблицы.
Процедура ПериодичностьМесяц(МодельЗапроса) Экспорт
	Периодичность(МодельЗапроса, "Месяц");
КонецПроцедуры

// Добавить параметр виртуальной таблицы.
Процедура ПериодичностьКвартал(МодельЗапроса) Экспорт
	Периодичность(МодельЗапроса, "Квартал");
КонецПроцедуры

// Добавить параметр виртуальной таблицы.
Процедура ПериодичностьПолугодие(МодельЗапроса) Экспорт
	Периодичность(МодельЗапроса, "Полугодие");
КонецПроцедуры

Процедура ПериодичностьГод(МодельЗапроса) Экспорт
	Периодичность(МодельЗапроса, "Год");
КонецПроцедуры

// Добавить параметр виртуальной таблицы.
Процедура ПериодичностьАвто(МодельЗапроса) Экспорт
	Периодичность(МодельЗапроса, "Авто");
КонецПроцедуры

#КонецОбласти

#Область Результат

Функция Результат(МодельЗапроса, Индекс = Неопределено) Экспорт
	Если Индекс = Неопределено Тогда
		Возврат МодельЗапроса.Результат[МодельЗапроса.Результат.ВГраница()];
	КонецЕсли;
	Если ТипЗнч(Индекс) = Тип("Число") Тогда
		Возврат МодельЗапроса.Результат[Индекс];
	КонецЕсли;
	Возврат МодельЗапроса.Результат[МодельЗапроса.ИндексРезультата[Индекс]];
КонецФункции

Функция ВыбратьРезультат(МодельЗапроса, Индекс = Неопределено, ТипОбхода = Неопределено, Группировки = Неопределено, ГруппировкиДляЗначенийГруппировок = Неопределено) Экспорт
	Результат = Результат(МодельЗапроса, Индекс);
	Если ТипОбхода = Неопределено Тогда
		Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой, Группировки, ГруппировкиДляЗначенийГруппировок);
	Иначе
		Выборка = Результат.Выбрать(ТипОбхода, Группировки, ГруппировкиДляЗначенийГруппировок);
	КонецЕсли;
	Возврат Выборка;
КонецФункции

Функция ВыгрузитьРезультат(МодельЗапроса, Индекс = Неопределено) Экспорт
	Возврат Результат(МодельЗапроса, Индекс).Выгрузить();
КонецФункции

Функция ВыбратьПервый(МодельЗапроса, Индекс = Неопределено, ТипОбхода = Неопределено, Группировки = Неопределено, ГруппировкиДляЗначенийГруппировок = Неопределено) Экспорт
	Выборка = ВыбратьРезультат(МодельЗапроса, Индекс, ТипОбхода, Группировки, ГруппировкиДляЗначенийГруппировок);
	МодельЗапроса.Выбран = Выборка.Следующий();
	Возврат Выборка;
КонецФункции

Функция Выбран(МодельЗапроса) Экспорт
	Возврат МодельЗапроса.Выбран;
КонецФункции

Функция ТекстЗапроса(МодельЗапроса, ИмяЗапроса = Неопределено) Экспорт
	Перем Индекс;
	
	СхемаЗапроса = МодельЗапроса.СхемаЗапроса;
	
	Если НЕ ЗначениеЗаполнено(ИмяЗапроса) Тогда
		Возврат СхемаЗапроса.ПолучитьТекстЗапроса();
	КонецЕсли;
	
	МодельЗапроса.ИндексЗапроса.Свойство(ИмяЗапроса, Индекс);
	
	Если Индекс = Неопределено Тогда
		ВызватьИсключение "Не найден текст запроса по имени " + ИмяЗапроса;
	КонецЕсли;
	
	Возврат СхемаЗапроса.ПакетЗапросов[Индекс].ПолучитьТекстЗапроса();
	
КонецФункции

Функция Запрос(МодельЗапроса) Экспорт
	
	МенеджерВременныхТаблиц = МодельЗапроса.МенеджерВременныхТаблиц;
	
	Если МенеджерВременныхТаблиц = Неопределено Тогда
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
		МодельЗапроса.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = МодельЗапроса.СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Для Каждого ЭлементПараметра Из МодельЗапроса.Параметры Цикл
		Запрос.Параметры.Вставить(ЭлементПараметра.Ключ, ЭлементПараметра.Значение);
	КонецЦикла;

	МодельЗапроса.Запрос = Запрос;
	Возврат Запрос;
	
КонецФункции

Функция ВыполнитьЗапрос(МодельЗапроса) Экспорт

	Запрос = Запрос(МодельЗапроса);	
	МодельЗапроса.Результат = Запрос.ВыполнитьПакет();
	МодельЗапроса.ИндексРезультата = МодельЗапроса.ИндексЗапроса;
	ЗаполнитьЗначенияСвойств(МодельЗапроса, НовыйМодельЗапроса(), , "Запрос, Параметры, Результат, ИндексРезультата, МенеджерВременныхТаблиц");
	Возврат МодельЗапроса.Результат;

КонецФункции

Процедура Параметр(МодельЗапроса, Имя, Значение) Экспорт
	МодельЗапроса.Параметры.Вставить(Имя, Значение);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Псевдоним(Выражение, Псевдоним = "")
	Если НЕ ПустаяСтрока(Псевдоним) Тогда
		Возврат Псевдоним;
	КонецЕсли;
	Если Лев(Выражение, 1) = "&" Тогда
		Возврат Прав(Выражение, СтрДлина(Выражение) - 1);
	КонецЕсли;
	Позиция = СтрНайти(Выражение, ".", НаправлениеПоиска.СНачала);
	Если Позиция > 0 Тогда
		ПсевдонимПоля = Прав(Выражение, СтрДлина(Выражение) - Позиция);
	Иначе
		ПсевдонимПоля = Выражение;
	КонецЕсли;
	Возврат СтрЗаменить(ПсевдонимПоля, ".", "");
КонецФункции

Функция ПолучитьИсточник(МодельЗапроса, ИндексИлиПседоним = Неопределено)
	Перем Источник;
	ОператорВыбрать = МодельЗапроса.ОператорВыбрать;
	Если ТипЗнч(ИндексИлиПседоним) = Тип("Строка") Тогда
		Источник = ОператорВыбрать.Источники.НайтиПоПсевдониму(ИндексИлиПседоним);
		Если Источник = Неопределено Тогда
			Источник = ОператорВыбрать.Источники.НайтиПоИмени(ИндексИлиПседоним);
		КонецЕсли;
		Возврат Источник;
	КонецЕсли;
	Если ИндексИлиПседоним = Неопределено Тогда
		ВыбранныйИндекс = ОператорВыбрать.Источники.Количество() - 1;
	Иначе
		ВыбранныйИндекс = ИндексИлиПседоним;
	КонецЕсли;
	Если ВыбранныйИндекс = -1 Тогда
		Источник = Неопределено;
		Возврат Источник;
	КонецЕсли;
	Источник = ОператорВыбрать.Источники[ВыбранныйИндекс];
	Возврат Источник;
КонецФункции

Процедура ДополнитьВыражениеПараметра(Источник, ИмяПараметра, Выражение)
	Перем ТекущееВыражение;
	ПараметрыТаблицы = ПараметрыВиртуальнойТаблицы(Источник.Источник.ИмяТаблицы, Источник.Источник.Параметры);
	Если ПараметрыТаблицы <> Неопределено И ПараметрыТаблицы.Свойство(ИмяПараметра, ТекущееВыражение) Тогда
		УстановитьПараметрыВиртуальнойТаблицы(Источник, Новый Структура(ИмяПараметра, СтрШаблон("(%1) И (%2)", ТекущееВыражение, Выражение)));
	Иначе
		УстановитьПараметрыВиртуальнойТаблицы(Источник, Новый Структура(ИмяПараметра, Выражение));
	КонецЕсли;
КонецПроцедуры

Функция ВыражениеВВидСубконто(Выражение)
	Если ТипЗнч(Выражение) <> Тип("Строка") Тогда
		Возврат Выражение;
	КонецЕсли;
	Состав = СтрРазделить(СтрЗаменить(Выражение, ")", ""), ".");
	Состав[0] = "ПланыВидовХарактеристик";
	Состав[2] = СтрЗаменить(Состав[2], ")", "");
	//@skip-check server-execution-safe-mode
	ЗначениеВыражения = Вычислить(СтрСоединить(Состав, "."));
	Возврат ЗначениеВыражения;
КонецФункции

Функция ВидСубконтоВВыражение(Выражение)
	Если ТипЗнч(Выражение) = Тип("Строка") Тогда
		Возврат Выражение;
	КонецЕсли;
	ЗначениеВыражения = СтрШаблон("ЗНАЧЕНИЕ(ПланВидовХарактеристик.%1.%2)", Выражение.Метаданные().Имя, Выражение.ИмяПредопределенныхДанных);
	Возврат ЗначениеВыражения;
КонецФункции

Процедура ДополнитьСубконто(Источник, Параметры, ПараметрТаблицы, Значение)
	Перем Выражение;
	ПараметрыТаблицы = ПараметрыВиртуальнойТаблицы(Источник.Источник.ИмяТаблицы, Источник.Источник.Параметры);
	Если ПараметрыТаблицы <> Неопределено И ПараметрыТаблицы.Свойство(ПараметрТаблицы, Выражение) И ЗначениеЗаполнено(Выражение) Тогда
		Если СтрНачинаетсяС(Выражение, "&") Тогда
			ИмяПараметра = Прав(Выражение, СтрДлина(Выражение) - 1);
			ЗначениеПараметра = Параметры[ИмяПараметра];
			Если ТипЗнч(ЗначениеПараметра) = Тип("Массив") Тогда
				ВидыСубконто = ЗначениеПараметра;
			Иначе
				ВидыСубконто = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЗначениеПараметра);
			КонецЕсли;
			Если ТипЗнч(Значение) = Тип("Массив") Тогда
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВидыСубконто, Значение);
			Иначе
				ВидыСубконто.Добавить(Значение);
			КонецЕсли;
			Параметры[ИмяПараметра] = ВидыСубконто;
			Возврат;
		КонецЕсли;
		ВидыСубконто = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыражениеВВидСубконто(Выражение));
		ВидыСубконто.Добавить(ВыражениеВВидСубконто(Значение));
		ИмяПараметра = ОбщийКлиентСервер.ИмяПоУникальномуИдентификатору();
		УстановитьПараметрыВиртуальнойТаблицы(Источник, Новый Структура(ПараметрТаблицы, "&" + ИмяПараметра));
		Параметры.Вставить(ИмяПараметра, ВидыСубконто);
	Иначе
		УстановитьПараметрыВиртуальнойТаблицы(Источник, Новый Структура(ПараметрТаблицы, ВидСубконтоВВыражение(Значение)));
	КонецЕсли;
КонецПроцедуры

Процедура ОчиститьСоединенияИсточника(МодельЗапроса, Источник)
	
	ОператорВыбрать = МодельЗапроса.ОператорВыбрать;
	Псевдоним = Источник.Источник.Псевдоним;
	Источник.Соединения.Очистить();
	
	Для Каждого ИсточникСоединения Из ОператорВыбрать.Источники Цикл
		Соединения = ИсточникСоединения.Соединения;
		СоединениеСИсточником = Соединения.НайтиПоПсевдониму(Псевдоним);
		Пока СоединениеСИсточником <> Неопределено Цикл
			Соединения.Удалить(Соединения.Индекс(СоединениеСИсточником));
			СоединениеСИсточником = Соединения.НайтиПоПсевдониму(Псевдоним);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьИсточник(МодельЗапроса, Таблица, Псевдоним = "")

	ОператорВыбрать = МодельЗапроса.ОператорВыбрать;		
	ОператорВыбрать.Источники.Добавить(Таблица, Псевдоним);
	Источник = ОператорВыбрать.Источники[ОператорВыбрать.Источники.Количество()-1];
	МодельЗапроса.Источник = Источник;
	МодельЗапроса.ИсточникСлева = Источник;
	МодельЗапроса.ДоступныеПоля = Источник.Источник.ДоступныеПоля;
	ОчиститьСоединенияИсточника(МодельЗапроса, Источник);
	
КонецПроцедуры

Процедура ДобавитьВложенныйЗапрос(МодельЗапроса, Псевдоним = "ВложенныйЗапрос")

	ОператорВыбрать = МодельЗапроса.ОператорВыбрать;		
	ОператорВыбрать.Источники.Добавить(Тип("ВложенныйЗапросСхемыЗапроса"), Псевдоним);
	Источник = ОператорВыбрать.Источники[ОператорВыбрать.Источники.Количество()-1];
	МодельЗапроса.Источник = Источник;
	МодельЗапроса.ИсточникСлева = Источник;
	МодельЗапроса.ДоступныеПоля = Источник.Источник.ДоступныеПоля;
	ОчиститьСоединенияИсточника(МодельЗапроса, Источник);

КонецПроцедуры

Процедура ДобавитьОписаниеВременнойТаблицы(МодельЗапроса, Таблица, Псевдоним = "")

	ОператорВыбрать = МодельЗапроса.ОператорВыбрать;		
	ОператорВыбрать.Источники.Добавить(Тип("ОписаниеВременнойТаблицыСхемыЗапроса"), Таблица, Псевдоним);
	Источник = ОператорВыбрать.Источники[ОператорВыбрать.Источники.Количество()-1];
	МодельЗапроса.Источник = Источник;
	МодельЗапроса.ИсточникСлева = Источник;
	МодельЗапроса.ДоступныеПоля = Источник.Источник.ДоступныеПоля;
	ОчиститьСоединенияИсточника(МодельЗапроса, Источник);

КонецПроцедуры


Функция НовыйСостояние(МодельЗапроса = Неопределено)
	
	Состояние = Новый Структура;
	Состояние.Вставить("ЗапросПакета");
	Состояние.Вставить("ОператорВыбрать");
	Состояние.Вставить("Источник");
	Состояние.Вставить("ИсточникСлева");
	Состояние.Вставить("ИсточникСправа");
	Состояние.Вставить("Поле");
	Состояние.Вставить("Соединение");
	Состояние.Вставить("ТипСоединения");
	Состояние.Вставить("КонтрольнаяТочка");
	
	Состояние.Вставить("ИндексОператора");
	Состояние.Вставить("ВыбираемыеПоля");
	Состояние.Вставить("Колонки");

	Если МодельЗапроса = Неопределено Тогда
		Возврат Состояние;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Состояние, МодельЗапроса);
	Возврат Состояние;
	
КонецФункции

Процедура СохранитьСостояние(МодельЗапроса)
	МодельЗапроса.Стек.Добавить(НовыйСостояние(МодельЗапроса));
	ЗаполнитьЗначенияСвойств(МодельЗапроса, НовыйСостояние());	
КонецПроцедуры

Процедура ВосстановитьСостояние(МодельЗапроса)
	Стек = МодельЗапроса.Стек;
	Состояние = Стек[Стек.ВГраница()];
	Стек.Удалить(Стек.ВГраница());
	ЗаполнитьЗначенияСвойств(МодельЗапроса, Состояние);
КонецПроцедуры

// Установить параметры виртуальной таблицы.
// 
// Параметры:
//  Источник - ИсточникСхемыЗапроса - Источник
//	ПараметрыВиртуальнойТаблицы - Массив из Строка - параметры определяются индексом элемента массива. В качестве значения параметров выступает текстовое описание (см. встроенная справка - работа с запросом - таблицы - параметры).
//								- Структура - ключи структуры соответствуют названиям параметров виртуальной таблицы из справки в конфигураторе без пробелов. 
Процедура УстановитьПараметрыВиртуальнойТаблицы(Источник, ПараметрыВиртуальнойТаблицы)
	ПараметрыИсточника	= Источник.Источник.Параметры;
	ТипЗначения = ТипЗнч(ПараметрыВиртуальнойТаблицы);
	Если ТипЗначения = Тип("Структура") Тогда 
		СтруктураПараметров = ПараметрыВиртуальнойТаблицы(ИмяВиртуальнойТаблицы(Источник.Источник.ИмяТаблицы));
		Для каждого ЭлементПараметров Из ПараметрыВиртуальнойТаблицы Цикл
			Если ЭлементПараметров.Значение = "*" Тогда
				ПараметрыИсточника[СтруктураПараметров[ЭлементПараметров.Ключ]].Выражение = Новый ВыражениеСхемыЗапроса("&"+ЭлементПараметров.Ключ);
			Иначе
				ПараметрыИсточника[СтруктураПараметров[ЭлементПараметров.Ключ]].Выражение = Новый ВыражениеСхемыЗапроса(ЭлементПараметров.Значение);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗначения = Тип("ПараметрыТаблицыСхемыЗапроса") Тогда
		Индекс = -1;
		Для каждого Параметр Из ПараметрыВиртуальнойТаблицы Цикл
			Индекс = Индекс + 1;
			ПараметрыИсточника[Индекс].Выражение = Параметр.Выражение;
		КонецЦикла;
	Иначе //  массив
		Для Индекс = 0 По ПараметрыВиртуальнойТаблицы.ВГраница() Цикл
			ПараметрыИсточника[Индекс].Выражение = Новый ВыражениеСхемыЗапроса(ПараметрыВиртуальнойТаблицы[Индекс]);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция ИмяВиртуальнойТаблицы(ИмяТаблицы)
	МассивСлов = СтрРазделить(ИмяТаблицы, ".");
	Возврат МассивСлов[0]+"."+МассивСлов[2];
КонецФункции


Функция ИсточникПоПсевдониму(ОператорВыбрать, Псевдоним)
	
	Источник = ОператорВыбрать.Источники.НайтиПоПсевдониму(Псевдоним);
	
	Если Источник = Неопределено Тогда
		Источник = ОператорВыбрать.Источники.НайтиПоИмени(Псевдоним);
	КонецЕсли;
	
	Если Источник = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Не удалось определить источник по псевдониму ""%1""", Псевдоним);
	КонецЕсли;
	
	Возврат Источник;
	
КонецФункции

Процедура Соединение(МодельЗапроса, ПсевдонимСлева, ПсевдонимСправа, Условие = Неопределено, Тип = Неопределено)

	ОператорВыбрать = МодельЗапроса.ОператорВыбрать;
	МодельЗапроса.ТипСоединения = ?(Тип = Неопределено, ТипСоединенияСхемыЗапроса.ЛевоеВнешнее, Тип);
	МодельЗапроса.ИсточникСлева = ИсточникПоПсевдониму(ОператорВыбрать, ПсевдонимСлева);
	МодельЗапроса.ИсточникСправа = ИсточникПоПсевдониму(ОператорВыбрать, ПсевдонимСправа);
	МодельЗапроса.Соединение = Неопределено;// само соединение будет добавлено в момент появления условия связи
	
	Если ЗначениеЗаполнено(Условие) Тогда
		УсловиеСвязи(МодельЗапроса, Условие);
	КонецЕсли;
	
КонецПроцедуры

// Добавляет условие к существующим условиям соединения источников.
//
// Параметры:
//  Соединение - СоединениеИсточникаЗапросаСхемыЗапроса
//  Условие - Строка - псевдоним источника
Процедура ДобавитьУсловиеСоединения(Соединение, Условие)
	
	ТекущееУсловие = Строка(Соединение.Условие);
	
	Если ПустаяСтрока(ТекущееУсловие) Тогда
		Соединение.Условие = Новый ВыражениеСхемыЗапроса(Условие);
		Возврат;
	КонецЕсли;
	
	Соединение.Условие = Новый ВыражениеСхемыЗапроса(СтрШаблон("(%1) И (%2)", ТекущееУсловие, Условие));
	
КонецПроцедуры

Функция УсловиеСоединения(Поля)
	МассивУсловий = Новый Массив;
	Если ТипЗнч(Поля) = Тип("Строка") ИЛИ ТипЗнч(Поля) = Тип("Массив") Тогда
		Для каждого Поле Из ОбщийКлиентСервер.Массив(Поля) Цикл
			СоставПолей = СтрРазделить(Поле, "= ", Ложь);
			Если СоставПолей.ВГраница() = 0 Тогда
				ПолеСлева = СоставПолей[0];
				ПолеСправа = СоставПолей[0];
			Иначе
				ПолеСлева = СоставПолей[0];
				ПолеСправа = СоставПолей[1];
			КонецЕсли;
			МассивУсловий.Добавить(СтрШаблон("%%1.%1 = %%2.%2", ПолеСлева, ПолеСправа));
		КонецЦикла; 
	Иначе
		Для каждого Поле Из Поля Цикл
			МассивУсловий.Добавить(СтрШаблон("%%1.%1 = %%2.%1", Поле.Имя));
		КонецЦикла; 
	КонецЕсли; 
	Возврат СтрСоединить(МассивУсловий, " И ");	
КонецФункции

Функция ФорматДатаВремя(Значение)
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		Возврат Значение;
	КонецЕсли;
	Возврат СтрШаблон("ДАТАВРЕМЯ(%1)", Формат(Значение, "ДФ='yyyy, M, d, H, m, s';"));
КонецФункции

// Добавляет выбранное поле компоновки данных
//
// Параметры:
//	Куда		(КомпоновщикНастроекКомпоновкиДанных, НастройкиКомпоновкиДанных, ВыбранныеПоляКомпоновкиДанных)
//	ИмяИлиПолеКД(Строка, ПолеКомпоновкиДанных)
//	Заголовок	(Строка) Необязательный
//
// Возвращаемое значение:
//	ВыбранноеПолеКД (ВыбранноеПолеКомпоновкиДанных)
//
Функция ДобавитьВыбранноеПолеСКД(Куда, ИмяИлиПолеКД, Заголовок = "")
	
	Если ТипЗнч(Куда) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		ВыбранныеПоляКД = Куда.Настройки.Выбор;
	ИначеЕсли ТипЗнч(Куда) = Тип("НастройкиКомпоновкиДанных") Тогда
		ВыбранныеПоляКД = Куда.Выбор;
	Иначе
		ВыбранныеПоляКД = Куда;
	КонецЕсли;
	
	Если ТипЗнч(ИмяИлиПолеКД) = Тип("Строка") Тогда
		ПолеКД = Новый ПолеКомпоновкиДанных(ИмяИлиПолеКД);
	Иначе
		ПолеКД = ИмяИлиПолеКД;
	КонецЕсли;
	
	ВыбранноеПолеКД = ВыбранныеПоляКД.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКД.Поле = ПолеКД;
	Если Заголовок <> "" Тогда
		ВыбранноеПолеКД.Заголовок = Заголовок;
	КонецЕсли;
	
	Возврат ВыбранноеПолеКД;
	
КонецФункции

// Добавляет отбор в коллекцию отборов компоновщика или группы отборов
//
// Параметры:
//	ЭлементСтруктуры- элемент структуры КД
//	Поле			- имя поля, по которому добавляется отбор
//	Значение		- значение отбора КД
//	ВидСравнения	- вид сравнений КД (по умолчанию: неопределено)
//	Использование	- признак использования отбора (по умолчанию: истина)
//	ВПользовательскиеНастройки - признак добавления в пользовательсие настройки КД (по умолчанию: ложь)
//
// Возвращаемое значение:
//	ЭлементОтбора (ЭлементОтбораКомпоновкиДанных)
//
Функция ДобавитьОтборСКД(ЭлементСтруктуры, Знач Поле, Значение, ВидСравнения = Неопределено, Использование = Истина, ВПользовательскиеНастройки = Ложь)
	
	Если ТипЗнч(Поле) = Тип("Строка") Тогда
		Поле = Новый ПолеКомпоновкиДанных(Поле);
	КонецЕсли;
	
	Если ТипЗнч(ЭлементСтруктуры) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		Отбор = ЭлементСтруктуры.Настройки.Отбор;
		
		Если ВПользовательскиеНастройки Тогда
			Для Каждого ЭлементНастройки Из ЭлементСтруктуры.ПользовательскиеНастройки.Элементы Цикл
				Если ЭлементНастройки.ИдентификаторПользовательскойНастройки = ЭлементСтруктуры.Настройки.Отбор.ИдентификаторПользовательскойНастройки Тогда
					Отбор = ЭлементНастройки;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("НастройкиКомпоновкиДанных") Тогда
		Отбор = ЭлементСтруктуры.Отбор;
	Иначе
		Отбор = ЭлементСтруктуры;
	КонецЕсли;
	
	Если ВидСравнения = Неопределено Тогда
		ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
	ЭлементОтбора = Неопределено;
	Для каждого Элемент Из Отбор.Элементы Цикл
		
		Если ТипЗнч(Элемент) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		Если Элемент.ЛевоеЗначение = Поле Тогда
			ЭлементОтбора = Элемент;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	КонецЕсли;
	
	ЭлементОтбора.Использование		= Использование;
	ЭлементОтбора.ЛевоеЗначение		= Поле;
	ЭлементОтбора.ВидСравнения		= ВидСравнения;
	ЭлементОтбора.ПравоеЗначение	= Значение;
	
	Возврат ЭлементОтбора;
	
КонецФункции

#КонецОбласти