//  Подсистема "Модель запроса"
//	Автор: Калякин Андрей Г.
//  https://github.com/KalyakinAG/query-model
//  https://infostart.ru/1c/articles/2639581/
//@skip-check object-module-export-variable

#Область ОписаниеПеременных

Перем СхемаЗапроса Экспорт;
Перем Стек Экспорт;
// Запрос
Перем ЗапросПакета Экспорт;
Перем ВложенныйЗапрос Экспорт;
Перем ОператорВыбрать Экспорт;
Перем ИндексЗапроса Экспорт;
Перем ИндексОператора Экспорт;
Перем ВыбираемыеПоля Экспорт;
Перем Колонки Экспорт;
// Источник
Перем Источник Экспорт;
Перем ДоступныеПоля Экспорт;
// Соединение
Перем ИсточникСлева Экспорт;
Перем ИсточникСправа Экспорт;
Перем Соединение Экспорт;
Перем ТипСоединения Экспорт;
// Поле
Перем Поле Экспорт;
Перем КонтрольнаяТочка Экспорт;
// Параметры и менеджер ВТ
Перем МенеджерВременныхТаблиц Экспорт;
Перем Параметры Экспорт;
// Результат
Перем Запрос Экспорт;
Перем Результат Экспорт;
Перем ИндексРезультата Экспорт;
Перем Выбран Экспорт;
	
#КонецОбласти

#Область ПрограммныйИнтерфейс

#Область Конструктор

// Новый модель запроса
// 
// Возвращаемое значение:
//  Структура - Новый модель запроса:
// * СхемаЗапроса - СхемаЗапроса
// * Стек - Массив из Структура
// 
// * ЗапросПакета - ЗапросВыбораСхемыЗапроса, ЗапросУничтоженияТаблицыСхемыЗапроса -
// * ВложенныйЗапрос - ЗапросВыбораСхемыЗапроса -
// * ОператорВыбрать - ОператорВыбратьСхемыЗапроса -
// * Источник - ИсточникСхемыЗапроса -
// * Соединение - СоединениеИсточникаЗапросаСхемыЗапроса -
// * ТипСоединения - ТипСоединенияСхемыЗапроса -
// * ИсточникСлева - ИсточникСхемыЗапроса -
// * ИсточникСправа - ИсточникСхемыЗапроса -
// 
// * Поле - ВыражениеСхемыЗапроса -
// * КонтрольнаяТочка - КонтрольнаяТочкаИтоговСхемыЗапроса -
// 
// * МенеджерВременныхТаблиц - МенеджерВременныхТаблиц -
// * Параметры - Структура
// 
// * СтруктураЗапроса - Структура
// * Запрос - Запрос
// * РезультатПакета - РезультатЗапроса
// * Выбран - Булево
Функция НовыйМодельЗапроса() Экспорт
	
	МодельЗапроса = Новый Структура;
	МодельЗапроса.Вставить("СхемаЗапроса", Новый СхемаЗапроса);
	МодельЗапроса.Вставить("Стек", Новый Массив);
	// Запрос
	МодельЗапроса.Вставить("ЗапросПакета");
	МодельЗапроса.Вставить("ВложенныйЗапрос");
	МодельЗапроса.Вставить("ОператорВыбрать");
	МодельЗапроса.Вставить("ИндексЗапроса", Новый Структура);
	
	МодельЗапроса.Вставить("ИндексОператора");
	МодельЗапроса.Вставить("ВыбираемыеПоля");
	МодельЗапроса.Вставить("Колонки");
	// Источник
	МодельЗапроса.Вставить("Источник");
	МодельЗапроса.Вставить("ДоступныеПоля");
	// Соединение
	МодельЗапроса.Вставить("ИсточникСлева");
	МодельЗапроса.Вставить("ИсточникСправа");
	МодельЗапроса.Вставить("Соединение");
	МодельЗапроса.Вставить("ТипСоединения");
	// Поле
	МодельЗапроса.Вставить("Поле");
	МодельЗапроса.Вставить("КонтрольнаяТочка");
	// Параметры и менеджер ВТ
	МодельЗапроса.Вставить("МенеджерВременныхТаблиц");
	МодельЗапроса.Вставить("Параметры", Новый Структура);
	// Результат
	МодельЗапроса.Вставить("Запрос");
	МодельЗапроса.Вставить("Результат");
	МодельЗапроса.Вставить("ИндексРезультата", Новый Структура);
	МодельЗапроса.Вставить("Выбран", Ложь);
	//@skip-check constructor-function-return-section
	Возврат МодельЗапроса;

КонецФункции

// Установить запрос.
// 
// Параметры:
//  НовыйЗапрос - Запрос
// 
// Возвращаемое значение:
//  ОбработкаОбъект.МодельЗапроса
Функция УстановитьЗапрос(НовыйЗапрос) Экспорт
	УстановитьМенеджерВременныхТаблиц(НовыйЗапрос.МенеджерВременныхТаблиц);
	УстановитьТекстЗапроса(НовыйЗапрос.Текст);
	Для Каждого ПараметрЗапроса Из НовыйЗапрос.Параметры Цикл
		Параметр(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
	КонецЦикла;
	Возврат ЭтотОбъект;
КонецФункции

Функция УстановитьСхемуЗапроса(НоваяСхемаЗапроса) Экспорт
	СхемаЗапроса = НоваяСхемаЗапроса;
	УстановитьЗапросПакета();
	Возврат ЭтотОбъект;
КонецФункции

Функция УстановитьМенеджерВременныхТаблиц(НовыйМенеджерВременныхТаблиц) Экспорт
	МенеджерВременныхТаблиц = НовыйМенеджерВременныхТаблиц;
	Возврат ЭтотОбъект;
КонецФункции

Функция УстановитьТекстЗапроса(ТекстЗапроса) Экспорт
	Перем ЗапросПакета;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	УстановитьЗапросПакета();
	ПакетЗапросов = СхемаЗапроса.ПакетЗапросов;
	Для Каждого ЗапросПакета Из ПакетЗапросов Цикл
		ИмяТаблицы = ЗапросПакета.ТаблицаДляПомещения;
		Если НЕ ЗначениеЗаполнено(ИмяТаблицы) Тогда
			Продолжить;
		КонецЕсли;
		Если ИндексЗапроса.Свойство(ИмяТаблицы) Тогда
			Продолжить;
		КонецЕсли;
		ИндексЗапроса.Вставить(ИмяТаблицы, ПакетЗапросов.Индекс(ЗапросПакета));
	КонецЦикла;
	Возврат ЭтотОбъект;
КонецФункции

#Область СКД

Функция УстановитьСхемуКомпоновкиДанных(Схема, Настройки) Экспорт
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(Схема, Настройки);
	ТекстЗапроса = МакетКомпоновкиДанных.НаборыДанных[0].Запрос;
	УстановитьТекстЗапроса(ТекстЗапроса);
	Для Каждого ЗначениеПараметра Из МакетКомпоновкиДанных.ЗначенияПараметров Цикл
		Параметр(ЗначениеПараметра.Имя, ЗначениеПараметра.Значение);
	КонецЦикла;
	Возврат ЭтотОбъект;
КонецФункции

Функция УстановитьСхемуТаблицыСписка(ТаблицаСписка) Экспорт
	Схема = ТаблицаСписка.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = ТаблицаСписка.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	// Добавить в настройку отбор по текущей строке
	ПоляКлюча = ТаблицаСписка.ТекущаяСтрока;
	Если ПоляКлюча <> Неопределено Тогда
		Для Каждого ПолеКлюча Из ПоляКлюча Цикл
			ДобавитьОтборСКД(Настройки.Отбор, ПолеКлюча.Ключ, ПолеКлюча.Значение, ВидСравненияКомпоновкиДанных.Равно, Истина);
		КонецЦикла;
	КонецЕсли;
	// Добавить в настройку доступные поля
	Настройки.Структура[0].Выбор.Элементы.Очистить();
	Для Каждого ДоступноеПоле Из Настройки.Структура[0].Выбор.ДоступныеПоляВыбора.Элементы Цикл
		Если ДоступноеПоле.Таблица ИЛИ ДоступноеПоле.Папка Тогда
			Продолжить;
		КонецЕсли;
		ДобавитьВыбранноеПолеСКД(Настройки.Структура[0].Выбор, ДоступноеПоле.Поле);
	КонецЦикла;
	// Инициировать схему с настройками
	УстановитьСхемуКомпоновкиДанных(Схема, Настройки);
	Возврат ЭтотОбъект;
КонецФункции

Функция УстановитьСхемуДинамическогоСписка(Список) Экспорт
	УстановитьТекстЗапроса(Список.ТекстЗапроса);
	Для Каждого ЭлементПараметра Из Список.Параметры.Элементы Цикл
		Параметр(Строка(ЭлементПараметра.Параметр), ЭлементПараметра.Значение);
	КонецЦикла;
	Возврат ЭтотОбъект;
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Курсор

Функция УстановитьИсточник(ИндексИлиПсевдоним = Неопределено) Экспорт
	Источник = ПолучитьИсточник(ИндексИлиПсевдоним);
	Возврат ЭтотОбъект;
КонецФункции

Функция УстановитьОператор(Индекс = Неопределено) Экспорт
	Если ТипЗнч(ЗапросПакета) = Тип("ЗапросУничтоженияТаблицыСхемыЗапроса") Тогда
		Возврат ЭтотОбъект;
	КонецЕсли;
	Если Индекс = Неопределено Тогда
		ВыбранныйИндекс = ЗапросПакета.Операторы.Количество() - 1;
	Иначе
		ВыбранныйИндекс = Индекс;
	КонецЕсли;
	ОператорВыбрать = ЗапросПакета.Операторы[ВыбранныйИндекс];
	Возврат УстановитьИсточник();
КонецФункции

Функция УстановитьЗапросПакета(Индекс = Неопределено) Экспорт
	Перем ВыбранныйИндекс;
	Если Индекс = Неопределено Тогда
		ВыбранныйИндекс = СхемаЗапроса.ПакетЗапросов.Количество() - 1;
	ИначеЕсли ТипЗнч(Индекс) = Тип("Строка") Тогда
		Для Каждого Элемент Из СхемаЗапроса.ПакетЗапросов Цикл
			Если Элемент.ТаблицаДляПомещения = Индекс Тогда
				ВыбранныйИндекс = СхемаЗапроса.ПакетЗапросов.Индекс(Элемент);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ВыбранныйИндекс = Неопределено Тогда
			ВызватьИсключение "Не найден запрос с именем """ + Индекс + """";
		КонецЕсли;
	Иначе
		ВыбранныйИндекс = Индекс;
	КонецЕсли;
	ЗапросПакета = СхемаЗапроса.ПакетЗапросов[ВыбранныйИндекс];
	Возврат УстановитьОператор();
КонецФункции

#КонецОбласти

#Область Модификаторы

Функция УдалитьИсточник(Псевдоним) Экспорт
	Перем ИндексИсточника;
	Если ТипЗнч(Псевдоним) = Тип("Строка") Тогда
		Источник = ОператорВыбрать.Источники.НайтиПоПсевдониму(Псевдоним);
		Если Источник <> Неопределено Тогда
			ИндексИсточника = ОператорВыбрать.Источники.Индекс(Источник);
		КонецЕсли;
	ИначеЕсли ТипЗнч(Псевдоним) = Тип("Число") Тогда
		ИндексИсточника = Псевдоним;
	Иначе
		ИндексИсточника = ОператорВыбрать.Источники.Индекс(Псевдоним);
	КонецЕсли;
	Если ИндексИсточника = Неопределено Тогда
		Возврат ЭтотОбъект;
	КонецЕсли;
	ОператорВыбрать.Источники.Удалить(ИндексИсточника);
	Возврат ЭтотОбъект;
КонецФункции

Функция ЗаменитьИсточник(ПсевдонимИсточника, Таблица, НовыйПсевдоним = "") Экспорт
	
	Если ПустаяСтрока(НовыйПсевдоним) Тогда
		Псевдоним = ПсевдонимИсточника;
	КонецЕсли;
	
	ИндексОператора = ЗапросПакета.Операторы.Индекс(ОператорВыбрать);
	Источник = ОператорВыбрать.Источники.НайтиПоПсевдониму(ПсевдонимИсточника);
	ИндексИсточника = ОператорВыбрать.Источники.Индекс(Источник);
	
	// Сохранить все поля запроса
	ВыбираемыеПоля  = Новый Массив;
	Для Каждого Колонка Из ЗапросПакета.Колонки Цикл
		Выражение =  Строка(Колонка.Поля[ИндексОператора]);
		Если ПустаяСтрока(Выражение) Тогда // при нескольких объединениях часть полей может отсутствовать (NULL поля)
			Продолжить;
		КонецЕсли;
		ВыбираемыеПоля.Добавить(Новый Структура("Выражение, Псевдоним", Строка(Колонка.Поля[ИндексОператора]), Колонка.Псевдоним));
	КонецЦикла;
	
	// Сохранить все отборы
	Отборы = Новый Массив;
	Для Каждого Отбор Из ОператорВыбрать.Отбор Цикл
		Отборы.Добавить(Строка(Отбор));
	КонецЦикла;
	
	// Сохранить все соединения с источником
	Соединения = Новый Массив;
	Для Каждого ЭлементИсточника Из ОператорВыбрать.Источники Цикл
		Для Каждого ЭлементСоединения Из ЭлементИсточника.Соединения Цикл
			Если СтрНайти(ЭлементСоединения.Условие, ПсевдонимИсточника) > 0 Тогда
				Соединения.Добавить(Новый Структура("ИсточникСлева, ИсточникСправа, ТипСоединения, Условие", ЭлементИсточника.Источник.Псевдоним, ЭлементСоединения.Источник.Источник.Псевдоним, ЭлементСоединения.ТипСоединения, Строка(ЭлементСоединения.Условие)));
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ОператорВыбрать.Источники.Удалить(ИндексИсточника);
	ОператорВыбрать.Отбор.Очистить();	
	Источник(Таблица, Псевдоним);
	
	// Восстановить сохраненные поля, отборы и соединения
	Если Псевдоним <> ПсевдонимИсточника Тогда
		
		Для Каждого ЭлементСоединения Из Соединения Цикл
			Соединение(
				СтрЗаменить(ЭлементСоединения.ИсточникСлева, ПсевдонимИсточника, Псевдоним), 
				СтрЗаменить(ЭлементСоединения.ИсточникСправа, ПсевдонимИсточника, Псевдоним), 
				СтрЗаменить(ЭлементСоединения.Условие, ПсевдонимИсточника, Псевдоним), 
				ЭлементСоединения.ТипСоединения
			);
		КонецЦикла;
		
		Для Каждого Поле Из ВыбираемыеПоля Цикл
			//@skip-check empty-except-statement
			Попытка
				Поле(СтрЗаменить(Поле.Выражение, ПсевдонимИсточника, Псевдоним), Поле.Псевдоним);
			Исключение
				// не все колонки могут быть в полях оператора
			КонецПопытки;
		КонецЦикла;
		
		Для Каждого Отбор Из Отборы Цикл
			ОператорВыбрать.Отбор.Добавить(СтрЗаменить(Отбор, ПсевдонимИсточника, Псевдоним));
		КонецЦикла;
		
	Иначе
		
		Для Каждого ЭлементСоединения Из Соединения Цикл
			Соединение( 
				ЭлементСоединения.ИсточникСлева, 
				ЭлементСоединения.ИсточникСправа, 
				ЭлементСоединения.Условие, 
				ЭлементСоединения.ТипСоединения
			);
		КонецЦикла;
		
		Для Каждого Поле Из ВыбираемыеПоля Цикл
			Попытка
				Поле(Поле.Выражение, Поле.Псевдоним);
			Исключение
				// не все колонки могут быть в полях оператора
			КонецПопытки;
		КонецЦикла;
		
		Для Каждого Отбор Из Отборы Цикл
			ОператорВыбрать.Отбор.Добавить(Отбор);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция УдалитьКолонку(Псевдоним) Экспорт
	Колонки = ЗапросПакета.Колонки;
	Колонка = Колонки.Найти(Псевдоним);
	Если Колонка = Неопределено Тогда
		Возврат ЭтотОбъект;
	КонецЕсли;
	Колонки.Удалить(Колонки.Индекс(Колонка));
	Возврат ЭтотОбъект;
КонецФункции

Функция УдалитьПоле(Выражение) Экспорт
	ВыбираемыеПоля = ОператорВыбрать.ВыбираемыеПоля;
	Поле = ВыбираемыеПоля.Найти(Выражение);
	Если Поле = Неопределено Тогда
		Возврат ЭтотОбъект;
	КонецЕсли;
	ВыбираемыеПоля.Удалить(ВыбираемыеПоля.Индекс(Поле));
	Возврат ЭтотОбъект;
КонецФункции

Функция ОчиститьОтбор() Экспорт
	ОператорВыбрать.Отбор.Очистить();
	Возврат ЭтотОбъект;
КонецФункции

Функция ОчиститьГруппировки() Экспорт
	ОператорВыбрать.Группировки.Очистить();
	ОператорВыбрать.Группировка.Очистить();
	Возврат ЭтотОбъект;
КонецФункции

Функция ОчиститьИтоги() Экспорт
	ЗапросПакета.ОбщиеИтоги = Ложь;
	ЗапросПакета.ВыраженияИтогов.Очистить();
	ЗапросПакета.КонтрольныеТочкиИтогов.Очистить();
	Возврат ЭтотОбъект;
КонецФункции

Функция ОчиститьСоединения() Экспорт
	Для Каждого Источник Из ОператорВыбрать.Источники Цикл
		Источник.Соединения.Очистить();
	КонецЦикла;
	Возврат ЭтотОбъект;
КонецФункции

#КонецОбласти

#Область ЗапросПакета

// Сброс и очистка результата и временных таблиц
// 
// Возвращаемое значение:
//  ОбработкаОбъект.МодельЗапроса
Функция Очистить() Экспорт
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НовыйМодельЗапроса(), , "Запрос, Параметры, Результат, ИндексРезультата, МенеджерВременныхТаблиц");
	Возврат ЭтотОбъект;
КонецФункции

Функция Разрешенные(ВыбиратьРазрешенные = Истина) Экспорт
	ЗапросПакета.ВыбиратьРазрешенные = ВыбиратьРазрешенные;
	Возврат ЭтотОбъект;
КонецФункции

Функция ВременныеТаблицы() Экспорт
	ГруппаВременныеТаблицы = СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество() - 1].ДоступныеТаблицы.Найти("Временные таблицы");
	Если ГруппаВременныеТаблицы = Неопределено Тогда
		Возврат Новый Массив;
	КонецЕсли;
	Возврат ГруппаВременныеТаблицы.Состав;
КонецФункции

Функция Поместить(ИмяВременнойТаблицы) Экспорт
	ЗапросПакета.ТаблицаДляПомещения = ИмяВременнойТаблицы;
	Возврат ЭтотОбъект;
КонецФункции

Функция Добавить(ИмяВременнойТаблицы) Экспорт
	ЗапросПакета.ТаблицаДляДобавления = ИмяВременнойТаблицы;
	Возврат ЭтотОбъект;
КонецФункции

Функция Уничтожить(ИмяВременнойТаблицы) Экспорт
	ПакетЗапросов = СхемаЗапроса.ПакетЗапросов;
	Если ПакетЗапросов.Количество() = 1 И СхемаЗапроса.ПолучитьТекстЗапроса() = "" Тогда
		ПакетЗапросов.Очистить();
	КонецЕсли;
	ЗапросПакета = СхемаЗапроса.ПакетЗапросов.Добавить(Тип("ЗапросУничтоженияТаблицыСхемыЗапроса"));
	ЗапросПакета.ИмяТаблицы = ИмяВременнойТаблицы;
	Возврат ЭтотОбъект;
КонецФункции

// Описание запроса.
// 
// Параметры:
//   - см. НовыйМодельЗапроса
//  ИмяЗапроса - Строка - Имя запроса
Функция УстановитьИмяЗапроса(ИмяЗапроса) Экспорт

	Индекс = СхемаЗапроса.ПакетЗапросов.Индекс(ЗапросПакета);
	ИндексЗапроса.Вставить(ИмяЗапроса, Индекс);
	
	Возврат ЭтотОбъект;
КонецФункции

// Добавляет оператор создания нового запроса в пакете
// 
// Параметры:
//   - см. НовыйМодельЗапроса
//  ИмяЗапроса - Строка - Имя запроса, которое может быть использовано при именованном обращении к результату запроса
Функция ЗапросПакета(ИмяЗапроса = "", ИндексВставки = Неопределено, ИндексКопииИлиТекстЗапроса = Неопределено) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НовыйСостояние());
	ПакетЗапросов = СхемаЗапроса.ПакетЗапросов;
	
	Если ИндексКопииИлиТекстЗапроса <> Неопределено Тогда
		Если ТипЗнч(ИндексКопииИлиТекстЗапроса) = Тип("Строка") Тогда
			Индекс = Неопределено;
			//@skip-check empty-except-statement
			Попытка
				ИндексЗапроса.Свойство(ИндексКопииИлиТекстЗапроса, Индекс);
			Исключение
			КонецПопытки;
			Если Индекс <> Неопределено Тогда
				ЗапросПакета = ПакетЗапросов.ДобавитьКопию(Индекс);
			Иначе
				ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
				Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
					ТекстЗапроса = ТекстЗапроса + 
						ОбщегоНазначения.РазделительПакетаЗапросов() +
						ИндексКопииИлиТекстЗапроса
					;
					УстановитьТекстЗапроса(ТекстЗапроса);
				Иначе
					УстановитьТекстЗапроса(ИндексКопииИлиТекстЗапроса);
				КонецЕсли;
			КонецЕсли;
		Иначе
			ЗапросПакета = ПакетЗапросов.ДобавитьКопию(ИндексКопииИлиТекстЗапроса);
		КонецЕсли;
		ПакетЗапросов.Переместить(ЗапросПакета, ПакетЗапросов.Количество() - 1);
	Иначе
		Если ПакетЗапросов.Количество() = 1 И СхемаЗапроса.ПолучитьТекстЗапроса() = "" И ИндексВставки = Неопределено Тогда
			ЗапросПакета = ПакетЗапросов[0];//  дефолтный запрос
		Иначе
			ЗапросПакета = ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
		КонецЕсли;
	КонецЕсли;
	
	Если ИндексВставки <> Неопределено Тогда
		ПакетЗапросов.Переместить(ЗапросПакета, ИндексВставки);
		Для Каждого Элемент Из ИндексЗапроса Цикл
			Если Элемент.Значение < ИндексВставки Тогда
				Продолжить;
			КонецЕсли;
			Элемент.Значение = Элемент.Значение + 1;
		КонецЦикла;
	КонецЕсли;	
	
	Если НЕ ПустаяСтрока(ИмяЗапроса) Тогда
		УстановитьИмяЗапроса(ИмяЗапроса);
	КонецЕсли;

	Колонки = ЗапросПакета.Колонки;
	Возврат ЭтотОбъект;
КонецФункции

Функция Индекс(Поля, Уникальный = Ложь) Экспорт
	ИндексТаблицыЗапроса = ЗапросПакета.Индексы.Добавить();//ИндексыСхемыЗапроса
	ИндексТаблицыЗапроса.Уникальный = Уникальный;
	ВыраженияИндекса = ИндексТаблицыЗапроса.ВыраженияИндекса;// ВыраженияИндексаСхемыЗапроса
	Для Каждого Поле Из ОбщийКлиентСервер.Массив(Поля) Цикл
		ВыраженияИндекса.Добавить(Поле);
	КонецЦикла;
	Возврат ЭтотОбъект;
КонецФункции

#КонецОбласти

#Область Источник

Функция Источник(Таблица, Знач Псевдоним = "", ЗначениеПараметра = Неопределено) Экспорт
	
	Если ОператорВыбрать = Неопределено Тогда
		Выбрать();
	КонецЕсли;

	ТипИсточника = ТипЗнч(Таблица);
	
	Если ТипИсточника = Тип("Строка") Тогда

		Если СтрНачинаетсяС(Таблица, "{") Тогда
			//  Это таблица JSON
			ТаблицаИзJSON = РаботаСКоллекцией.СтруктураВТаблицуЗначений(Таблица);
			Источник(ТаблицаИзJSON, Псевдоним);
			Возврат ЭтотОбъект;
			
		КонецЕсли;
		
		Если СтрНачинаетсяС(Таблица, "&") Тогда
			//  Это параметр
			ПсевдонимВременнойТаблицы = Псевдоним;
			
			Если НЕ ЗначениеЗаполнено(ПсевдонимВременнойТаблицы) Тогда
				Если ЗначениеЗаполнено(ЗапросПакета.ТаблицаДляПомещения) Тогда
					ПсевдонимВременнойТаблицы = ЗапросПакета.ТаблицаДляПомещения;
				ИначеЕсли ЗначениеЗаполнено(ЗапросПакета.ТаблицаДляДобавления) Тогда
					ПсевдонимВременнойТаблицы = ЗапросПакета.ТаблицаДляДобавления;
				КонецЕсли;
			КонецЕсли;
			
			ДобавитьОписаниеВременнойТаблицы(Таблица, ПсевдонимВременнойТаблицы);
			
			Если ЗначениеПараметра <> Неопределено Тогда
				ИмяПараметра = Прав(Таблица, СтрДлина(Таблица) - 1);
				Параметр(ИмяПараметра, ЗначениеПараметра);
			КонецЕсли;
			
			Возврат ЭтотОбъект;
			
		КонецЕсли;

		ВременнаяТаблица = ?(МенеджерВременныхТаблиц <> Неопределено, МенеджерВременныхТаблиц.Таблицы.Найти(Таблица), Неопределено);
		
		Если ВременнаяТаблица <> Неопределено Тогда
			//  Это имя временной таблицы из менеджера временных таблиц
			ДобавитьОписаниеВременнойТаблицы(Таблица, Псевдоним);
			
			Для Каждого Колонка Из ВременнаяТаблица.Колонки Цикл
				// При добавлении доступного поля необходимо указать Тип, хотя фактическое значение будет иметь тип ТипЗначения.
				// Ограничения:
				// 1. Доступ к полям через точку (например, Поле.ПодПоле) поддерживается только для объектов одного типа.
				// 2. Запрещено использовать оператор ССЫЛКА.
				// Обходное решение:
				// 1. Для работы с данными разных типов используйте явные соединения таблиц вместо вложенных полей.
				// 2. Для определения типа значения используйте функцию ТипЗначения() вместо ССЫЛКА.
				ДоступноеПоле(Колонка.Имя, Колонка.ТипЗначения.Типы()[0]);
			КонецЦикла;
			
			Возврат ЭтотОбъект;
			
		КонецЕсли;
		
		//  Это имя доступной таблицы в текущей схеме запроса
		ДобавитьИсточник(Таблица, ?(ПустаяСтрока(Псевдоним), ОбщийКлиентСервер.ОкончаниеСтрокиПослеРазделителя(Таблица), Псевдоним));
		Возврат ЭтотОбъект;
		
	КонецЕсли;
	
	//  Это Таблица значений, ТабличнаяЧасть, ДанныеФормыКоллекцияЗначений
	ИмяПараметра = ОбщийКлиентСервер.ИмяПоУникальномуИдентификатору();
	ДобавитьОписаниеВременнойТаблицы("&" + ИмяПараметра, Псевдоним);
	
	Если ТипИсточника = Тип("ТаблицаЗначений") Тогда
		Для Каждого Колонка Из Таблица.Колонки Цикл
			ДоступноеПоле(Колонка.Имя, Колонка.ТипЗначения.Типы()[0]);
		КонецЦикла;
		Параметр(ИмяПараметра, Таблица);
	ИначеЕсли ТипИсточника = Тип("ДанныеФормыКоллекция") Тогда
		Результат = Таблица.Выгрузить();
		Для Каждого Колонка Из Результат.Колонки Цикл
			Если Колонка.Имя = "ИсходныйНомерСтроки" Тогда
				Продолжить;
			КонецЕсли;
			ДоступноеПоле(Колонка.Имя, Колонка.ТипЗначения.Типы()[0]);
		КонецЦикла;
		Параметр(ИмяПараметра, Результат);
	ИначеЕсли СтрНайти(Таблица, "ТабличнаяЧасть.") > 0 Тогда
		Результат = Таблица.Выгрузить();
		Для Каждого Колонка Из Результат.Колонки Цикл
			ДоступноеПоле(Колонка.Имя, Колонка.ТипЗначения.Типы()[0]);
		КонецЦикла;
		Параметр(ИмяПараметра, Результат);
	ИначеЕсли ТипИсточника = Тип("Структура") Тогда
		ТаблицаИзJSON = РаботаСКоллекцией.СтруктураВТаблицуЗначений(Таблица);
		Для Каждого Колонка Из ТаблицаИзJSON.Колонки Цикл
			ДоступноеПоле(Колонка.Имя, Колонка.ТипЗначения.Типы()[0]);
		КонецЦикла;
		Параметр(ИмяПараметра, ТаблицаИзJSON);
	ИначеЕсли ТипИсточника = Тип("ТабличныйДокумент") Тогда
		ОбластьЯчеек = Таблица.Область(1, 1, Таблица.ВысотаТаблицы, Таблица.ШиринаТаблицы);
		Построитель = Новый ПостроительЗапроса;
		Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);
		Построитель.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;
		Построитель.ЗаполнитьНастройки();
		Построитель.Выполнить();
		Результат = Построитель.Результат.Выгрузить();
		Для Каждого Колонка Из Результат.Колонки Цикл
			ДоступноеПоле(Колонка.Имя, Колонка.ТипЗначения.Типы()[0]);
		КонецЦикла;
		Параметр(ИмяПараметра, Результат);
	Иначе
		ВызватьИсключение СтрШаблон("Неизвестный тип источника %1", ТипИсточника);
	КонецЕсли;
	
	Возврат ЭтотОбъект;
КонецФункции

Функция ВременнаяТаблица(Таблица, Знач Псевдоним = "", ЗначениеПараметра = Неопределено) Экспорт
	
	Если ОператорВыбрать = Неопределено Тогда
		Выбрать();
	КонецЕсли;

	ТипИсточника = ТипЗнч(Таблица);
	
	Если ТипИсточника = Тип("Строка") Тогда

		Если СтрНачинаетсяС(Таблица, "{") Тогда
			//  Это таблица JSON
			ТаблицаИзJSON = РаботаСКоллекцией.СтруктураВТаблицуЗначений(Таблица);
			Источник(ТаблицаИзJSON, Псевдоним);
			Возврат ЭтотОбъект;
			
		КонецЕсли;
		
		Если СтрНачинаетсяС(Таблица, "&") Тогда
			//  Это параметр
			ДобавитьОписаниеВременнойТаблицы(Таблица, Псевдоним);
			
			Если ЗначениеПараметра <> Неопределено Тогда
				ИмяПараметра = Прав(Таблица, СтрДлина(Таблица) - 1);
				Параметр(ИмяПараметра, ЗначениеПараметра);
			КонецЕсли;
			
			Возврат ЭтотОбъект;
			
		КонецЕсли;

		ДобавитьОписаниеВременнойТаблицы(Таблица, Псевдоним);
		ВременнаяТаблица = ?(МенеджерВременныхТаблиц <> Неопределено, МенеджерВременныхТаблиц.Таблицы.Найти(Таблица), Неопределено);
		
		Если ВременнаяТаблица <> Неопределено Тогда
			//  Это имя временной таблицы из менеджера временных таблиц
			Для Каждого Колонка Из ВременнаяТаблица.Колонки Цикл
				// при добавлении доступного поля нужен Тип, хотя в описании будет хранится ТипЗначения
				// ограничения: использование полей через точку только для 1-го типа, нельзя использовать оператор ССЫЛКА
				// 1-ой - использовать явные соединения с таблицами, 2-ое - использовать функцию ТипЗначения()
				ДоступноеПоле(Колонка.Имя, Колонка.ТипЗначения.Типы()[0]);
			КонецЦикла;
			
			Возврат ЭтотОбъект;
			
		КонецЕсли;
		
		Возврат ЭтотОбъект;
		
	КонецЕсли;
	
	//  Это Таблица значений, ТабличнаяЧасть, ДанныеФормыКоллекцияЗначений
	ИмяПараметра = ОбщийКлиентСервер.ИмяПоУникальномуИдентификатору();
	ДобавитьОписаниеВременнойТаблицы("&" + ИмяПараметра, Псевдоним);
	
	Если ТипИсточника = Тип("ТаблицаЗначений") Тогда
		Для Каждого Колонка Из Таблица.Колонки Цикл
			ДоступноеПоле(Колонка.Имя, Колонка.ТипЗначения.Типы()[0]);
		КонецЦикла;
		Параметр(ИмяПараметра, Таблица);
	ИначеЕсли ТипИсточника = Тип("ДанныеФормыКоллекция") Тогда
		Результат = Таблица.Выгрузить();
		Для Каждого Колонка Из Результат.Колонки Цикл
			Если Колонка.Имя = "ИсходныйНомерСтроки" Тогда
				Продолжить;
			КонецЕсли;
			ДоступноеПоле(Колонка.Имя, Колонка.ТипЗначения.Типы()[0]);
		КонецЦикла;
		Параметр(ИмяПараметра, Результат);
	ИначеЕсли СтрНайти(Таблица, "ТабличнаяЧасть.") > 0 Тогда
		Результат = Таблица.Выгрузить();
		Для Каждого Колонка Из Результат.Колонки Цикл
			ДоступноеПоле(Колонка.Имя, Колонка.ТипЗначения.Типы()[0]);
		КонецЦикла;
		Параметр(ИмяПараметра, Результат);
	ИначеЕсли ТипИсточника = Тип("Структура") Тогда
		ТаблицаИзJSON = РаботаСКоллекцией.СтруктураВТаблицуЗначений(Таблица);
		Для Каждого Колонка Из ТаблицаИзJSON.Колонки Цикл
			ДоступноеПоле(Колонка.Имя, Колонка.ТипЗначения.Типы()[0]);
		КонецЦикла;
		Параметр(ИмяПараметра, ТаблицаИзJSON);
	ИначеЕсли ТипИсточника = Тип("ТабличныйДокумент") Тогда
		ОбластьЯчеек = Таблица.Область(1, 1, Таблица.ВысотаТаблицы, Таблица.ШиринаТаблицы);
		Построитель = Новый ПостроительЗапроса;
		Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);
		Построитель.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;
		Построитель.ЗаполнитьНастройки();
		Построитель.Выполнить();
		Результат = Построитель.Результат.Выгрузить();
		Для Каждого Колонка Из Результат.Колонки Цикл
			ДоступноеПоле(Колонка.Имя, Колонка.ТипЗначения.Типы()[0]);
		КонецЦикла;
		Параметр(ИмяПараметра, Результат);
	Иначе
		ВызватьИсключение СтрШаблон("Неизвестный тип источника %1", ТипИсточника);
	КонецЕсли;
	
	Возврат ЭтотОбъект;
КонецФункции

Функция ЛевоеСоединение(ПсевдонимСлева, ПсевдонимСправа, Условие = Неопределено) Экспорт
	Соединение(ПсевдонимСлева, ПсевдонимСправа, Условие, ТипСоединенияСхемыЗапроса.ЛевоеВнешнее);
	Возврат ЭтотОбъект;
КонецФункции

Функция ПравоеСоединение(ПсевдонимСлева, ПсевдонимСправа, Условие = Неопределено) Экспорт
	Соединение(ПсевдонимСлева, ПсевдонимСправа, Условие, ТипСоединенияСхемыЗапроса.ПравоеВнешнее);
	Возврат ЭтотОбъект;
КонецФункции

Функция ПолноеСоединение(ПсевдонимСлева, ПсевдонимСправа, Условие = Неопределено) Экспорт
	Соединение(ПсевдонимСлева, ПсевдонимСправа, Условие, ТипСоединенияСхемыЗапроса.ПолноеВнешнее);
	Возврат ЭтотОбъект;
КонецФункции

Функция ВнутреннееСоединение(ПсевдонимСлева, ПсевдонимСправа, Условие = Неопределено) Экспорт
	Соединение(ПсевдонимСлева, ПсевдонимСправа, Условие, ТипСоединенияСхемыЗапроса.Внутреннее);
	Возврат ЭтотОбъект;
КонецФункции

// Добавить условие соединения
// 
// Параметры:
//  СоответствиеПолей - Строка - условие соединения описывается через перечисление соответствия полей: ПолеСлева = ПолеСправа[,..]
//                               Допускается указать справа параметр: ПолеСлева = &Параметр. Если поля имеют одинаковое имя слева и справа, то
//                               достаточно указать просто имя поля: Поле, ПолеСлева = ПолеСправа[,..]
// 
Функция Связь(СоответствиеПолей, Действует = Истина) Экспорт
	Перем ДоступныеПоля;
	
	Если СоответствиеПолей = "*" Тогда
		ОбщиеПоля = Новый Массив;
		ДоступныеПоля = ИсточникСправа.Источник.ДоступныеПоля;
		Для Каждого ПолеСлева Из ИсточникСлева.Источник.ДоступныеПоля Цикл
			Если ДоступныеПоля.Найти(ПолеСлева.Имя) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ОбщиеПоля.Добавить(ПолеСлева.Имя);
		КонецЦикла;
		Выражение = УсловиеСоединения(ОбщиеПоля);
	Иначе
		Выражение = УсловиеСоединения(СоответствиеПолей);
	КонецЕсли;
	
	УсловиеСвязи(Выражение, Действует);
	
	Возврат ЭтотОбъект;
КонецФункции

// Добавить условие соединения
// 
// Параметры:
//  Выражение - Строка - Выражение условия соединения
Функция УсловиеСвязи(Знач Выражение, Действует = Истина) Экспорт

	Если НЕ Действует Тогда
		Возврат ЭтотОбъект;
	КонецЕсли;
	
	ПсевдонимСлева = ИсточникСлева.Источник.Псевдоним;
	ПсевдонимСправа = ИсточникСправа.Источник.Псевдоним;
	Выражение = СтрЗаменить(Выражение, "%1", ПсевдонимСлева); 
	Выражение = СтрЗаменить(Выражение, "%2", ПсевдонимСправа);

	Если Соединение = Неопределено Тогда
		
		ИсточникСлева.Соединения.Добавить(ПсевдонимСправа, Выражение);
		Соединение = ИсточникСлева.Соединения[ИсточникСлева.Соединения.Количество()-1];
		Соединение.ТипСоединения = ТипСоединения;
		Возврат ЭтотОбъект; 

	КонецЕсли;
	
	ДобавитьУсловиеСоединения(Соединение, Выражение);		

	Возврат ЭтотОбъект;
КонецФункции

Функция ИсточникНачать(Псевдоним) Экспорт
	ДобавитьВложенныйЗапрос(Псевдоним);
	ВложенныйЗапрос = Источник.Источник.Запрос;
	СохранитьСостояние();
	ЗапросПакета = ВложенныйЗапрос;
	Колонки = ЗапросПакета.Колонки;
	Возврат ЭтотОбъект;
КонецФункции

Функция ИсточникЗавершить() Экспорт
	ВосстановитьСостояние();
	Возврат ЭтотОбъект;
КонецФункции

Функция ДоступноеПоле(Имя, Тип = Неопределено) Экспорт
	// Поскольку тип Строка нельзя ограничить (нет квалификатора строки как у типа значения),
	// то используется тип Неопределено.
	// Это нужно для того, чтобы не возникало фантомной ошибки
	// в условиях отбора и соединения: нельзя использовать поля неограниченной длины
	ДоступныеПоля.Добавить(Имя, ?(Тип = Тип("Строка"), Неопределено, Тип));
	Возврат ЭтотОбъект;
КонецФункции

// Добавить условие отбора в оператор выбора
// 
// Параметры:
//  Выражение - Строка, ВыраженияСхемыЗапроса - выражение отбора, соответствует выражению ГДЕ
// 
// Возвращаемое значение:
//  ОбработкаОбъект.МодельЗапроса
Функция Отбор(Выражение, Действует = Истина) Экспорт
	Если НЕ Действует Тогда
		Возврат ЭтотОбъект;
	КонецЕсли;
	ОператорВыбрать.Отбор.Добавить(Выражение);
	Возврат ЭтотОбъект;
КонецФункции

// Добавить условие отбора в оператор выбора
// 
// Параметры:
//  Выражение - Строка, ВыраженияСхемыЗапроса - выражение отбора, соответствует выражению ГДЕ
// 
// Возвращаемое значение:
//  ОбработкаОбъект.МодельЗапроса
Функция УсловныйОтбор(ЭтоИстина, ВыражениеИстина = Неопределено, ВыражениеЛожь = Неопределено) Экспорт
	Если ЭтоИстина Тогда
		Если НЕ ЗначениеЗаполнено(ВыражениеИстина) Тогда
			Возврат ЭтотОбъект;
		КонецЕсли;
		Отбор(ВыражениеИстина);
		Возврат ЭтотОбъект;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ВыражениеЛожь) Тогда
		Возврат ЭтотОбъект;
	КонецЕсли;
	Отбор(ВыражениеЛожь);
	Возврат ЭтотОбъект;
КонецФункции

// Применяется к условию отбора. См. УсловиеВхождения
// 
Функция ОтборВхождения(ИмяТаблицы, Поля = "*", Действует = Истина) Экспорт
	Если НЕ Действует Тогда
		Возврат ЭтотОбъект;
	КонецЕсли;
	ОператорВыбрать.Отбор.Добавить(ВыражениеВхождения(ИмяТаблицы, Поля));
	Возврат ЭтотОбъект;
КонецФункции

#КонецОбласти

#Область АгрегатныеФункции

Функция Сумма(Выражение, Псевдоним = "", ВыражениеЕстьNull = "") Экспорт
	Возврат Поле(СтрШаблон("СУММА(%1)", Выражение), Псевдоним(Выражение, Псевдоним), ВыражениеЕстьNull);
КонецФункции

Функция Среднее(Выражение, Псевдоним = "") Экспорт
	Возврат Поле(СтрШаблон("СРЕДНЕЕ(%1)", Выражение), Псевдоним(Выражение, Псевдоним));
КонецФункции

Функция Количество(Выражение, Псевдоним = "") Экспорт
	Возврат Поле(СтрШаблон("КОЛИЧЕСТВО(%1)", Выражение), Псевдоним(Выражение, Псевдоним));
КонецФункции

Функция КоличествоРазличных(Выражение, Псевдоним = "") Экспорт
	Возврат Поле(СтрШаблон("КОЛИЧЕСТВО(РАЗЛИЧНЫЕ %1)", Выражение), Псевдоним(Выражение, Псевдоним));
КонецФункции

Функция Максимум(Выражение, Псевдоним = "") Экспорт
	Возврат Поле(СтрШаблон("МАКСИМУМ(%1)", Выражение), Псевдоним(Выражение, Псевдоним));
КонецФункции

Функция Минимум(Выражение, Псевдоним = "") Экспорт
	Возврат Поле(СтрШаблон("МИНИМУМ(%1)", Выражение), Псевдоним(Выражение, Псевдоним));
КонецФункции

// ГруппировкаПо - добавляет группировку по выражениям полей запроса.
// ГруппировкаПо используется неявно, если в выборке присутствуют агрегатные функции. В этом случае
// группировка неявно определяется по всем полям, которые не участвуют в агрегатных функциях.
// В случае необходимости определить группировку явно, следует использовать ГруппировкаПо.
// Многократное использование оператора ГруппировкаПо приводит к добавлению группировок в наборы группировок.
// 
// Параметры:
//  ПоляГруппировки - Строка - Поля группировки или выражения. Псевдонимы полей допускаются к использованию
//                             с ограничением - если исходное поле источника определяется однозначно
// 
// Возвращаемое значение:
//  ОбработкаОбъект.МодельЗапроса - Группировка по
Функция ГруппировкаПо(ПоляГруппировки) Экспорт
	Если ЗначениеЗаполнено(ОператорВыбрать.Группировки[0]) Тогда
		ОператорВыбрать.Группировки.Добавить();
		Выражения = ОператорВыбрать.Группировки[ОператорВыбрать.Группировки.Количество() - 1];
		Для Каждого Выражение Из РаботаСМассивом.Массив(ПоляГруппировки) Цикл
			Выражения.Добавить(Новый ВыражениеСхемыЗапроса(Выражение));
		КонецЦикла;
		Возврат ЭтотОбъект;
	КонецЕсли;
	Выражения = ОператорВыбрать.Группировка;
	Выражения.Очистить();
	Для Каждого Выражение Из РаботаСМассивом.Массив(ПоляГруппировки) Цикл
		Выражения.Добавить(Новый ВыражениеСхемыЗапроса(Выражение));
	КонецЦикла;
	Возврат ЭтотОбъект;
КонецФункции

#КонецОбласти

#Область Итоги

Функция Итог(Выражение, Псевдоним) Экспорт
	ЗапросПакета.ВыраженияИтогов.Добавить(Выражение, Псевдоним);
	Возврат ЭтотОбъект;
КонецФункции

Функция ИтогСумма(Выражение, Псевдоним = "") Экспорт
	Возврат Итог(СтрШаблон("СУММА(%1)", Выражение), ?(ПустаяСтрока(Псевдоним), Выражение, Псевдоним));
КонецФункции

Функция ИтогСреднее(Выражение, Псевдоним = "") Экспорт
	Возврат Итог(СтрШаблон("СРЕДНЕЕ(%1)", Выражение), ?(ПустаяСтрока(Псевдоним), Выражение, Псевдоним));
КонецФункции

Функция ИтогКоличество(Выражение, Псевдоним = "") Экспорт
	Возврат Итог(СтрШаблон("КОЛИЧЕСТВО(%1)", Выражение), ?(ПустаяСтрока(Псевдоним), Выражение, Псевдоним));
КонецФункции

Функция ИтогКоличествоРазличных(Выражение, Псевдоним = "") Экспорт
	Возврат Итог(СтрШаблон("КОЛИЧЕСТВО(РАЗЛИЧНЫЕ %1)", Выражение), ?(ПустаяСтрока(Псевдоним), Выражение, Псевдоним));
КонецФункции

Функция ИтогМаксимум(Выражение, Псевдоним = "") Экспорт
	Возврат Итог(СтрШаблон("МАКСИМУМ(%1)", Выражение), ?(ПустаяСтрока(Псевдоним), Выражение, Псевдоним));
КонецФункции

Функция ИтогМинимум(Выражение, Псевдоним = "") Экспорт
	Возврат Итог(СтрШаблон("МИНИМИУМ(%1)", Выражение), ?(ПустаяСтрока(Псевдоним), Выражение, Псевдоним));
КонецФункции

// Группировка для итогов
// 
// Параметры:
//  Выражение - Строка - Выражение
//  ИмяКолонки - Строка - Имя колонки
//  ТипКонтрольнойТочки - ТипКонтрольнойТочкиСхемыЗапроса, Неопределено - Тип контрольной точки
//                        Иерархия, ТолькоИерархия, Элементы
// Возвращаемое значение:
//  ОбработкаОбъект.МодельЗапроса
Функция Группировка(Выражение, ИмяКолонки = "", ТипКонтрольнойТочки = Неопределено, ТипДополненияПериодами = Неопределено, НачалоПериода = "", КонецПериода = "") Экспорт
	КонтрольнаяТочка = ЗапросПакета.КонтрольныеТочкиИтогов.Добавить(Выражение);
	КонтрольнаяТочка.ИмяКолонки					= ИмяКолонки;
	КонтрольнаяТочка.ТипКонтрольнойТочки 		= ?(ТипКонтрольнойТочки 	= Неопределено, ТипКонтрольнойТочкиСхемыЗапроса.Элементы, ТипКонтрольнойТочки);
	КонтрольнаяТочка.ТипДополненияПериодами 	= ?(ТипДополненияПериодами 	= Неопределено, ТипДополненияПериодамиСхемыЗапроса.БезДополнения, ТипДополненияПериодами);
	КонтрольнаяТочка.НачалоПериодаДополнения 	= ?(ТипЗнч(НачалоПериода) 	= Тип("Строка"), НачалоПериода, ФорматДатаВремя(НачалоПериода));
	КонтрольнаяТочка.КонецПериодаДополнения 	= ?(ТипЗнч(КонецПериода) 	= Тип("Строка"), КонецПериода, ФорматДатаВремя(КонецПериода));
	Возврат ЭтотОбъект;
КонецФункции

// Группировки для итогов
// 
// Параметры:
//  Выражения - Массив из Строка - Выражения группировок итогов в формате "Выражение КАК Псевдоним", "Выражение"
// 
// Возвращаемое значение:
//  ОбработкаОбъект.МодельЗапроса
Функция Группировки(Выражения) Экспорт
	МассивВыражений = ?(ТипЗнч(Выражения) = Тип("Массив"), Выражения, СтрРазделить(Выражения, ","));
	Для Каждого ВыражениеПоля Из МассивВыражений Цикл
		ПозицияТокена = СтрНайти(ВРег(ВыражениеПоля), " КАК ");
		Если ПозицияТокена = 0 Тогда
			Псевдоним = "";
			Выражение = ВыражениеПоля;
		Иначе
			Выражение = Лев(ВыражениеПоля, ПозицияТокена - 1);
			Псевдоним = Прав(ВыражениеПоля, СтрДлина(ВыражениеПоля) - ПозицияТокена - 4);
		КонецЕсли;			
		Группировка(Выражение, Псевдоним);
	КонецЦикла;
	Возврат ЭтотОбъект;
КонецФункции

Функция Итоги(Выражения) Экспорт
	МассивВыражений = ?(ТипЗнч(Выражения) = Тип("Массив"), Выражения, СтрРазделить(Выражения, ","));
	Для Каждого ВыражениеПоля Из МассивВыражений Цикл
		ПозицияТокена = СтрНайти(ВРег(ВыражениеПоля), " КАК ");
		Если ПозицияТокена = 0 Тогда
			Псевдоним = "";
			Выражение = ВыражениеПоля;
		Иначе
			Выражение = Лев(ВыражениеПоля, ПозицияТокена - 1);
			Псевдоним = Прав(ВыражениеПоля, СтрДлина(ВыражениеПоля) - ПозицияТокена - 4);
		КонецЕсли;			
		Итог(Выражение, Псевдоним);
	КонецЦикла;
	Возврат ЭтотОбъект;
КонецФункции

// Дополнение результата запроса датами в установленном периоде
// https://its.1c.ru/db/metod8dev/content/2660/hdoc
Функция ПоПериодам(ТипДополненияПериодами, НачалоПериода = "", КонецПериода = "") Экспорт
	КонтрольнаяТочка.ТипДополненияПериодами = ?(ТипДополненияПериодами = Неопределено, ТипДополненияПериодамиСхемыЗапроса.БезДополнения, ТипДополненияПериодами);
	КонтрольнаяТочка.НачалоПериодаДополнения = ?(ТипЗнч(НачалоПериода) = Тип("Строка"), НачалоПериода, ФорматДатаВремя(НачалоПериода));
	КонтрольнаяТочка.КонецПериодаДополнения = ?(ТипЗнч(КонецПериода) = Тип("Строка"), КонецПериода, ФорматДатаВремя(КонецПериода));
	Возврат ЭтотОбъект;
КонецФункции

Функция ОбщиеИтоги() Экспорт
	ЗапросПакета.ОбщиеИтоги = Истина;
	Возврат ЭтотОбъект;
КонецФункции


#КонецОбласти

#Область Оператор

Функция Первые(КоличествоПолучаемыхЗаписей = 1) Экспорт
	ОператорВыбрать.КоличествоПолучаемыхЗаписей = КоличествоПолучаемыхЗаписей;
	Возврат ЭтотОбъект;
КонецФункции

// Оператор
// 
// Пример:
//	Оператор(Новый Структура("ТипОбъединения, КоличествоПолучаемыхЗаписей", ТипОбъединенияСхемыЗапроса.Объединить, 50));
//
// Параметры:
//   - см. НовыйМодельЗапроса
//  Параметры - Структура - Параметры:
//   * ВыбиратьРазличные - Булево
//	 * ТипОбъединения - ТипОбъединенияСхемыЗапроса - по умолчанию - ОбъединитьВсе
//	 * КоличествоПолучаемыхЗаписей - Число - по умолчанию - неограничено
Функция Выбрать(Количество = Неопределено, Различные = Неопределено, ТипОбъединения = Неопределено, ИндексКопии = Неопределено) Экспорт
	
	Если ИндексКопии <> Неопределено Тогда
		Если ТипЗнч(ИндексКопии) = Тип("Число") Тогда
			Если ИндексКопии < 0 Тогда
				ОператорИсточник = ЗапросПакета.Операторы[ЗапросПакета.Операторы.Количество() + ИндексКопии];
			Иначе
				ОператорИсточник = ЗапросПакета.Операторы[ИндексКопии];
			КонецЕсли;
		ИначеЕсли ТипЗнч(ИндексКопии) = Тип("ОператорВыбратьСхемыЗапроса") Тогда
			ОператорИсточник = ИндексКопии;
		Иначе
			ВызватьИсключение "Неизвестный тип оператора-источника: " + ТипЗнч(ИндексКопии);
		КонецЕсли;
		ОператорВыбрать = ЗапросПакета.Операторы.Добавить(ОператорИсточник);
	Иначе
		Если ЗапросПакета.Операторы.Количество() = 1 Тогда
			ОператорВыбрать = ЗапросПакета.Операторы[0];
			Если НЕ ОператорВыбрать.Источники.Количество() = 0 ИЛИ НЕ ОператорВыбрать.ВыбираемыеПоля.Количество() = 0 Тогда
				ОператорВыбрать = ЗапросПакета.Операторы.Добавить();
			КонецЕсли;
		Иначе
			ОператорВыбрать = ЗапросПакета.Операторы.Добавить();
		КонецЕсли; 
	КонецЕсли;
	
	Если Количество <> Неопределено Тогда
		ОператорВыбрать.КоличествоПолучаемыхЗаписей = Количество;
	КонецЕсли;
	
	Если Различные <> Неопределено Тогда
		ОператорВыбрать.ВыбиратьРазличные = Различные;
	КонецЕсли;
	
	ОператорВыбрать.ТипОбъединения = ?(ТипОбъединения = Неопределено, ТипОбъединенияСхемыЗапроса.ОбъединитьВсе, ТипОбъединения);
	ИндексОператора = ЗапросПакета.Операторы.Индекс(ОператорВыбрать);
	ВыбираемыеПоля	= ОператорВыбрать.ВыбираемыеПоля;
	
	Возврат ЭтотОбъект;
КонецФункции

Функция ВыбратьРазличные() Экспорт
	Выбрать(, Истина);
	Возврат ЭтотОбъект;
КонецФункции

Функция ВыбратьПервые(Количество = 1) Экспорт
	Выбрать(Количество);
	Возврат ЭтотОбъект;
КонецФункции

// Создание оператора выборки. См. Выбрать
// 
Функция Объединить(Количество = Неопределено, Различные = Неопределено, ТипОбъединения = Неопределено, ИндексКопии = Неопределено) Экспорт
	Если ТипОбъединения = Неопределено Тогда
		Выбрать(Количество, Различные, ТипОбъединенияСхемыЗапроса.Объединить, ИндексКопии);
		Возврат ЭтотОбъект;
	КонецЕсли;
	Выбрать(Количество, Различные, ТипОбъединения, ИндексКопии);
	Возврат ЭтотОбъект;
КонецФункции

// Создание оператора выборки. См. Выбрать
// 
Функция ОбъединитьВсе(Количество = Неопределено, Различные = Неопределено, ИндексКопии = Неопределено) Экспорт
	Выбрать(Количество, Различные, ТипОбъединенияСхемыЗапроса.ОбъединитьВсе, ИндексКопии);
	Возврат ЭтотОбъект;
КонецФункции

// Добавить поле в операторе выбора
// 
// Параметры:
//  Выражение - Строка - Выражение
//  Псевдоним - Строка - Псевдоним
//  ВыражениеЕстьNull - Строка - Выражение есть null
Функция Поле(Выражение, Псевдоним = "", ВыражениеЕстьNull = "") Экспорт
	Перем Поле;
	
	Если ТипЗнч(Выражение) <> Тип("Строка") Тогда
		Если ТипЗнч(Выражение) = Тип("Массив") Тогда
			Для каждого Элемент Из Выражение Цикл
				Поле(Элемент);
			КонецЦикла;
			Возврат ЭтотОбъект;
		КонецЕсли;
		ИмяПараметра = ОбщийКлиентСервер.ИмяПоУникальномуИдентификатору();
		Параметр(ИмяПараметра, Выражение);
		Поле("&" + ИмяПараметра, Псевдоним, ВыражениеЕстьNull);
		Возврат ЭтотОбъект;
	КонецЕсли;
	
	Если СтрЗаканчиваетсяНа(Выражение, "*") Тогда
		ПозицияТочки = СтрНайти(Выражение, ".");
		Если ПозицияТочки = 0 Тогда // поля по всем источникам, доступным из оператора
			Для каждого Источник Из ОператорВыбрать.Источники Цикл
				ПсевдонимИсточника = Источник.Источник.Псевдоним;
				Для каждого ДоступноеПоле Из Источник.Источник.ДоступныеПоля Цикл
					мПутьКПолю = ПсевдонимИсточника + "." + ДоступноеПоле.Имя;
					Колонка = Колонки.Найти(ДоступноеПоле.Имя);
					Если ВыбираемыеПоля.Найти(мПутьКПолю) <> Неопределено ИЛИ Колонка <> Неопределено И Колонка.Поля[ИндексОператора] <> Неопределено Тогда
						Продолжить;
					КонецЕсли;
					Если ТипЗнч(ДоступноеПоле) = Тип("ДоступноеПолеСхемыЗапроса") Тогда
						Если Колонка <> Неопределено Тогда
							Поле = ВыбираемыеПоля.Добавить(мПутьКПолю, Колонки.Индекс(Колонка));
						Иначе
							Поле = ВыбираемыеПоля.Добавить(мПутьКПолю);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		Иначе// поля из указанного до точки источником
			ПсевдонимИсточника = Лев(Выражение, ПозицияТочки-1);
			Для каждого ДоступноеПоле Из ОператорВыбрать.Источники.НайтиПоПсевдониму(ПсевдонимИсточника).Источник.ДоступныеПоля Цикл
				мПутьКПолю = ПсевдонимИсточника + "." + ДоступноеПоле.Имя;
				Колонка = Колонки.Найти(ДоступноеПоле.Имя);
				Если ВыбираемыеПоля.Найти(мПутьКПолю) <> Неопределено ИЛИ Колонка <> Неопределено И Колонка.Поля[ИндексОператора] <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				Если ТипЗнч(ДоступноеПоле) = Тип("ДоступноеПолеСхемыЗапроса") Тогда
					Если Колонка <> Неопределено Тогда
						Поле = ВыбираемыеПоля.Добавить(мПутьКПолю, Колонки.Индекс(Колонка));
					Иначе
						Поле = ВыбираемыеПоля.Добавить(мПутьКПолю);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(ВыражениеЕстьNull) Тогда
			// Замена дефолтного псевдонима
			Если НЕ ЗначениеЗаполнено(Псевдоним) Тогда
				Псевдоним = Псевдоним(Выражение, Псевдоним);
			КонецЕсли;
			Выражение = СтрШаблон("ЕСТЬNULL(%1, %2)", Выражение, ВыражениеЕстьNull);
		КонецЕсли;
		ИндексКолонки = Неопределено;
		Если НЕ ПустаяСтрока(Псевдоним) Тогда // найти индекс колонки по псевдониму
			Колонка = Колонки.Найти(Псевдоним);
			Если Колонка <> Неопределено Тогда
				ИндексКолонки = Колонки.Индекс(Колонка);
			КонецЕсли;
		КонецЕсли;
		Если ИндексКолонки = Неопределено Тогда
			Если ИндексОператора > 0 И НЕ ПустаяСтрока(Псевдоним) Тогда
				//  Добавление колонки Null, чтобы добавить поле в существующий индекс добавленной колонки
				ЗапросПакета.Операторы[0].ВыбираемыеПоля.Добавить("Null");
				ИндексКолонки = Колонки.Количество() - 1;
				Колонки[ИндексКолонки].Псевдоним = Псевдоним;
				Поле = ВыбираемыеПоля.Добавить(Выражение, ИндексКолонки);
			Иначе
				Поле = ВыбираемыеПоля.Добавить(Выражение);
				Если НЕ ПустаяСтрока(Псевдоним) Тогда
					ИндексКолонки = Колонки.Количество() - 1;
					Колонки[ИндексКолонки].Псевдоним = Псевдоним;
				КонецЕсли; 
			КонецЕсли;
		Иначе
			Поле = ВыбираемыеПоля.Добавить(Выражение, ИндексКолонки);
			Если НЕ ПустаяСтрока(Псевдоним) Тогда
				Колонки[ИндексКолонки].Псевдоним = Псевдоним;// восстановление псевдонима, который сбрасывается при добавлении поля по дефолту
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
	
	Возврат ЭтотОбъект;
КонецФункции

Функция УсловноеПоле(ЭтоИстина, ВыражениеИстина = Неопределено, ВыражениеЛожь = Неопределено, Псевдоним = "", ВыражениеЕстьNull = "") Экспорт
	Если ЭтоИстина Тогда
		Если НЕ ЗначениеЗаполнено(ВыражениеИстина) Тогда
			Возврат ЭтотОбъект;
		КонецЕсли;
		Поле(ВыражениеИстина, Псевдоним, ВыражениеЕстьNull);
		Возврат ЭтотОбъект;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ВыражениеЛожь) Тогда
		Возврат ЭтотОбъект;
	КонецЕсли;
	Поле(ВыражениеЛожь, Псевдоним, ВыражениеЕстьNull);
	Возврат ЭтотОбъект;
КонецФункции

Функция Автопорядок(Значение = Истина) Экспорт
	ЗапросПакета.Автопорядок = Значение;
	Возврат ЭтотОбъект;
КонецФункции

Функция Порядок(Выражение, Знач Направление = Неопределено) Экспорт
	
	Если ТипЗнч(Направление) = Тип("Строка") Тогда
		Если Направление = "-" Тогда
			Направление = НаправлениеПорядкаСхемыЗапроса.ПоУбыванию;
		ИначеЕсли Направление = "+" Тогда
			Направление = НаправлениеПорядкаСхемыЗапроса.ПоВозрастанию;
		Иначе
			ВызватьИсключение СтрШаблон("Некорректное значение параметра Направление: %1", Направление);
		КонецЕсли;
	КонецЕсли;
					
	ВыражениеПорядка = ЗапросПакета.Порядок.Добавить(Выражение);
	ВыражениеПорядка.Направление = ?(Направление = Неопределено, НаправлениеПорядкаСхемыЗапроса.ПоВозрастанию, Направление);
	
	Возврат ЭтотОбъект;
КонецФункции

#КонецОбласти

#Область Поле

Функция ЕстьNull(Выражение, Псевдоним) Экспорт
	ПриведенноеВыражение = "";
	Для Каждого ВыражениеПоля Из ОбщийКлиентСервер.Массив(СтрЗаменить(Выражение, "*", Псевдоним)) Цикл
		Если ПриведенноеВыражение = "" Тогда
			ПриведенноеВыражение = ВыражениеПоля;
			Продолжить;
		КонецЕсли;
		ПриведенноеВыражение = СтрШаблон("ЕстьNULL(%1, %2)", ПриведенноеВыражение, ВыражениеПоля);
	КонецЦикла;
	Поле(ПриведенноеВыражение, Псевдоним);
	Возврат ЭтотОбъект;
КонецФункции

функция Автономер(Псевдоним) Экспорт
	Возврат Поле("АВТОНОМЕРЗАПИСИ()", Псевдоним);
КонецФункции

Функция Представление(Выражение, Псевдоним = "", ЭтоСсылка = Ложь) Экспорт
	Если ПустаяСтрока(Псевдоним) Тогда
		Состав = СтрРазделить(Выражение, ". ", Ложь);
		Если Состав.ВГраница() > 0 Тогда
			Если ОператорВыбрать.Источники.НайтиПоПсевдониму(Состав[0]) <> Неопределено Тогда
				Состав.Удалить(0);
			КонецЕсли;
		КонецЕсли;
		Состав.Добавить("Представление");
		ПсевдонимПредставления = СтрСоединить(Состав, "");
	Иначе
		ПсевдонимПредставления = Псевдоним;
	КонецЕсли;
	Возврат Поле(СтрШаблон("ПРЕДСТАВЛЕНИЕ%1(%2)", ?(ЭтоСсылка, "ССЫЛКИ", ""), Выражение), ПсевдонимПредставления);
КонецФункции

Функция ПредставлениеСсылки(Выражение, Псевдоним = "") Экспорт
	Возврат Представление(Выражение, Псевдоним, Истина);
КонецФункции

Функция УИД(Выражение, Псевдоним = "") Экспорт
	Если ПустаяСтрока(Псевдоним) Тогда
		Состав = СтрРазделить(Выражение, ". ", Ложь);
		Если Состав.ВГраница() > 0 Тогда
			Если ОператорВыбрать.Источники.НайтиПоПсевдониму(Состав[0]) <> Неопределено Тогда
				Состав.Удалить(0);
			КонецЕсли;
			ПсевдонимПредставления = СтрСоединить(Состав, "");
		Иначе
			ПсевдонимПредставления = Состав[0];
		КонецЕсли;
	Иначе
		ПсевдонимПредставления = Псевдоним;
	КонецЕсли;
	Возврат Поле(СтрШаблон("УНИКАЛЬНЫЙИДЕНТИФИКАТОР(%1)", Выражение), ПсевдонимПредставления);
КонецФункции

Функция Подстрока(Выражение, НачальнаяПозиция, Длина, Псевдоним = "") Экспорт
	Если ПустаяСтрока(Псевдоним) Тогда
		Состав = СтрРазделить(Выражение, ". ", Ложь);
		Если Состав.ВГраница() = 0 Тогда
			ПсевдонимПредставления = Выражение;
		Иначе
			Если ОператорВыбрать.Источники.НайтиПоПсевдониму(Состав[0]) <> Неопределено Тогда
				Состав.Удалить(0);
			КонецЕсли;
			ПсевдонимПредставления = СтрСоединить(Состав, "");
		КонецЕсли;
	Иначе
		ПсевдонимПредставления = Псевдоним;
	КонецЕсли;
	Возврат Поле(СтрШаблон("ПОДСТРОКА(%1, %2, %3)", Выражение, Формат(НачальнаяПозиция, "ЧН=0; ЧГ="), Формат(Длина, "ЧГ=")), ПсевдонимПредставления);
КонецФункции

Функция ДобавитьКДате(Выражение, Периодичность = "ДЕНЬ", Значение, Знач Псевдоним = "") Экспорт
	Если ПустаяСтрока(Псевдоним) Тогда
		Псевдоним = Псевдоним(Выражение)
	КонецЕсли;
	Возврат Поле(СтрШаблон("ДОБАВИТЬКДАТЕ(%1, %2, %3)", ФорматДатаВремя(Выражение), Периодичность, XMLСтрока(Значение)), Псевдоним);
КонецФункции

#КонецОбласти

#Область ВиртуальнаяТаблица

Функция ПараметрыВиртуальнойТаблицы(ИмяТаблицы, Параметры = Неопределено) Экспорт
	МассивСлов						= СтрРазделить(ИмяТаблицы, ".");
	ОбобщенноеИмяВиртуальнойТаблицы	= ВРег(МассивСлов[0]+"."+МассивСлов[МассивСлов.ВГраница()]);
	Если 		ОбобщенноеИмяВиртуальнойТаблицы = "РЕГИСТРНАКОПЛЕНИЯ.ОБОРОТЫ" Тогда
		ОписаниеПараметров = "НачалоПериода,КонецПериода,Периодичность,Условие";
	ИначеЕсли 	ОбобщенноеИмяВиртуальнойТаблицы = "РЕГИСТРСВЕДЕНИЙ.СРЕЗПЕРВЫХ"
		ИЛИ 	ОбобщенноеИмяВиртуальнойТаблицы = "РЕГИСТРСВЕДЕНИЙ.СРЕЗПОСЛЕДНИХ" 
		ИЛИ 	ОбобщенноеИмяВиртуальнойТаблицы = "РЕГИСТРНАКОПЛЕНИЯ.ОСТАТКИ" Тогда
		ОписаниеПараметров = "Период,Условие";
	ИначеЕсли 	ОбобщенноеИмяВиртуальнойТаблицы = "РЕГИСТРНАКОПЛЕНИЯ.ОСТАТКИИОБОРОТЫ" Тогда
		ОписаниеПараметров = "НачалоПериода,КонецПериода,Периодичность,МетодДополненияПериодов,Условие";
	ИначеЕсли 	ОбобщенноеИмяВиртуальнойТаблицы = "РЕГИСТРБУХГАЛТЕРИИ.ОСТАТКИ" Тогда
		ОписаниеПараметров = "Период,УсловиеСчета,Субконто,Условие";
	ИначеЕсли 	ОбобщенноеИмяВиртуальнойТаблицы = "РЕГИСТРБУХГАЛТЕРИИ.ДВИЖЕНИЯССУБКОНТО" Тогда
		ОписаниеПараметров = "НачалоПериода,КонецПериода,Условие,Порядок,Первые";
	ИначеЕсли 	ОбобщенноеИмяВиртуальнойТаблицы = "РЕГИСТРБУХГАЛТЕРИИ.ОБОРОТЫ" Тогда
		ОписаниеПараметров = "НачалоПериода,КонецПериода,Периодичность,УсловиеСчета,Субконто,Условие,УсловиеКорСчета,КорСубконто";
	ИначеЕсли 	ОбобщенноеИмяВиртуальнойТаблицы = "РЕГИСТРБУХГАЛТЕРИИ.ОБОРОТЫДТКТ" Тогда
		ОписаниеПараметров = "НачалоПериода,КонецПериода,Периодичность,УсловиеСчетаДт,СубконтоДт,УсловиеСчетаКт,СубконтоКт,Условие";
	ИначеЕсли 	ОбобщенноеИмяВиртуальнойТаблицы = "РЕГИСТРБУХГАЛТЕРИИ.ОСТАТКИИОБОРОТЫ" Тогда
		ОписаниеПараметров = "НачалоПериода,КонецПериода,Периодичность,МетодДополненияПериодов,УсловиеСчета,Субконто,Условие";
	ИначеЕсли 	ОбобщенноеИмяВиртуальнойТаблицы = "РЕГИСТРРАСЧЕТА.ФАКТИЧЕСКИЙПЕРИОДДЕЙСТВИЯ"
		Или 	ОбобщенноеИмяВиртуальнойТаблицы = "РЕГИСТРРАСЧЕТА.ДАННЫЕГРАФИКА"	Тогда
		ОписаниеПараметров = "Условие";
	ИначеЕсли 	СтрНачинаетсяС(ОбобщенноеИмяВиртуальнойТаблицы, "РЕГИСТРРАСЧЕТА.БАЗА") Тогда
		ОписаниеПараметров = "ИзмеренияОсновногоРегистра,ИзмеренияБазовогоРегистра,Разрезы,Условие";
	ИначеЕсли 	ОбобщенноеИмяВиртуальнойТаблицы = "ЗАДАЧА.ЗАДАЧИПОИСПОЛНИТЕЛЮ" Тогда
		ОписаниеПараметров = "Условие,Исполнитель";
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	МассивПараметров	= СтрРазделить(ОписаниеПараметров, ",");
	СтруктураПараметров	= Новый Структура;
	Если Параметры = Неопределено Тогда
		Для Индекс = 0 По МассивПараметров.ВГраница() Цикл
			СтруктураПараметров.Вставить(МассивПараметров[Индекс], Индекс);
		КонецЦикла;
	Иначе
		Для Индекс = 0 По МассивПараметров.ВГраница() Цикл
			Выражение = Строка(Параметры[Индекс].Выражение);
			Если ПустаяСтрока(Выражение) Тогда
				Продолжить;
			КонецЕсли;
			СтруктураПараметров.Вставить(МассивПараметров[Индекс], ОбщийКлиентСервер.ЭкранироватьТекст(Выражение));
		КонецЦикла;
	КонецЕсли;
	Возврат ?(СтруктураПараметров.Количество() = 0, Неопределено, СтруктураПараметров);
КонецФункции

// Применяется к параметрам виртуальной таблицы. Условие вхождения вида: (Организация, Контрагент) В
//				(ВЫБРАТЬ
//					ВТ_ИЗМЕРЕНИЯ.Организация,
//					ВТ_ИЗМЕРЕНИЯ.Контрагент
//				ИЗ
//					ВТ_ИЗМЕРЕНИЯ КАК ВТ_ИЗМЕРЕНИЯ)
// 
// Параметры:
//  ИмяТаблицы - Строка - Имя временной таблицы
//  Поля - Строка - Поля вхождения через запятую. Если поля слева отличны от полей справа, то нужно указать соответствие
//  "ПолеСлева = ПолеСправа". Можно указывать параметр: "ПолеСлева = &Параметр"
// 
// Возвращаемое значение:
//  ОбработкаОбъект.МодельЗапроса
Функция УсловиеВхождения(ИмяТаблицы, Поля = "*", Действует = Истина) Экспорт
	Если НЕ Действует Тогда
		Возврат ЭтотОбъект;
	КонецЕсли;
	Условие(ВыражениеВхождения(ИмяТаблицы, Поля, Источник.Источник.ДоступныеПоля));
	Возврат ЭтотОбъект;
КонецФункции

// Добавить условие в параметрах виртуальной таблицы
// 
// Параметры:
//  Выражение - Строка - Выражение условия виртуальной таблицы
// 
// Возвращаемое значение:
//  ОбработкаОбъект.МодельЗапроса
Функция Условие(Выражение, Действует = Истина) Экспорт
	Если НЕ Действует Тогда
		Возврат ЭтотОбъект;
	КонецЕсли;
	ДополнитьВыражениеПараметра(Источник, "Условие", Выражение);
	Возврат ЭтотОбъект;
КонецФункции

Функция УсловиеСчета(Выражение, Действует = Истина) Экспорт
	Если НЕ Действует Тогда
		Возврат ЭтотОбъект;
	КонецЕсли;
	ДополнитьВыражениеПараметра(Источник, "УсловиеСчета", Выражение);
	Возврат ЭтотОбъект;
КонецФункции

Функция УсловиеКорСчета(Выражение, Действует = Истина) Экспорт
	Если НЕ Действует Тогда
		Возврат ЭтотОбъект;
	КонецЕсли;
	ДополнитьВыражениеПараметра(Источник, "УсловиеКорСчета", Выражение);
	Возврат ЭтотОбъект;
КонецФункции

Функция УсловиеСчетаДт(Выражение, Действует = Истина) Экспорт
	Если НЕ Действует Тогда
		Возврат ЭтотОбъект;
	КонецЕсли;
	ДополнитьВыражениеПараметра(Источник, "УсловиеСчетаДт", Выражение);
	Возврат ЭтотОбъект;
КонецФункции

Функция УсловиеСчетаКт(Выражение, Действует = Истина) Экспорт
	Если НЕ Действует Тогда
		Возврат ЭтотОбъект;
	КонецЕсли;
	ДополнитьВыражениеПараметра(Источник, "УсловиеСчетаКт", Выражение);
	Возврат ЭтотОбъект;
КонецФункции

Функция Субконто(Значение) Экспорт
	ДополнитьСубконто(Источник, Параметры, "Субконто", Значение);
	Возврат ЭтотОбъект;
КонецФункции

Функция КорСубконто(Значение) Экспорт
	ДополнитьСубконто(Источник, Параметры, "КорСубконто", Значение);
	Возврат ЭтотОбъект;
КонецФункции

Функция СубконтоДт(Значение) Экспорт
	ДополнитьСубконто(Источник, Параметры, "СубконтоДт", Значение);
	Возврат ЭтотОбъект;
КонецФункции

Функция СубконтоКт(Значение) Экспорт
	ДополнитьСубконто(Источник, Параметры, "СубконтоКт", Значение);
	Возврат ЭтотОбъект;
КонецФункции

Функция Движения() Экспорт
	ПараметрТаблицы("МетодДополненияПериодов", "Движения");
	Возврат ЭтотОбъект;
КонецФункции

Функция ДвиженияИГраницыПериода() Экспорт
	ПараметрТаблицы("МетодДополненияПериодов", "ДвиженияИГраницыПериода");
	Возврат ЭтотОбъект;
КонецФункции

Функция ПараметрТаблицы(ИмяПараметра, Значение) Экспорт
	УстановитьПараметрыВиртуальнойТаблицы(Источник, Новый Структура(ИмяПараметра, Значение));
	Возврат ЭтотОбъект;
Возврат ЭтотОбъект;КонецФункции

// Добавить параметр виртуальной таблицы Начало периода.
// 
// Параметры:
//  Значение - Строка - Значение даты, для параметра использовать &
// 
// Возвращаемое значение:
//  ОбработкаОбъект.
Функция НачалоПериода(Значение) Экспорт
	ПараметрТаблицы("НачалоПериода", ФорматДатаВремя(Значение));
	Возврат ЭтотОбъект;КонецФункции

// Добавить параметр виртуальной таблицы Конец периода.
Функция КонецПериода(Значение) Экспорт
	ПараметрТаблицы("КонецПериода", ФорматДатаВремя(Значение));
	Возврат ЭтотОбъект;
КонецФункции

// Добавить параметр виртуальной таблицы.
Функция Период(Значение) Экспорт
	ПараметрТаблицы("Период", ФорматДатаВремя(Значение));
	Возврат ЭтотОбъект;
КонецФункции

// Добавить параметр виртуальной таблицы.
Функция Периодичность(Значение) Экспорт
	ПараметрТаблицы("Периодичность", Значение);
Возврат ЭтотОбъект;КонецФункции

// Добавить параметр виртуальной таблицы.
Функция ПериодичностьЗапись() Экспорт
	Периодичность("Запись");
	Возврат ЭтотОбъект;
КонецФункции

// Добавить параметр виртуальной таблицы.
Функция ПериодичностьРегистратор() Экспорт
	Периодичность("Регистратор");
	Возврат ЭтотОбъект;
КонецФункции

// Добавить параметр виртуальной таблицы.
Функция ПериодичностьПериод() Экспорт
	Периодичность("Период");
Возврат ЭтотОбъект;КонецФункции

// Добавить параметр виртуальной таблицы.
Функция ПериодичностьСекунда() Экспорт
	Периодичность("Секунда");
	Возврат ЭтотОбъект;
КонецФункции

// Добавить параметр виртуальной таблицы.
Функция ПериодичностьМинута() Экспорт
	Периодичность("Минута");
	Возврат ЭтотОбъект;
КонецФункции

// Добавить параметр виртуальной таблицы.
Функция ПериодичностьЧас() Экспорт
	Периодичность("Час");
Возврат ЭтотОбъект;КонецФункции

// Добавить параметр виртуальной таблицы.
Функция ПериодичностьДень() Экспорт
	Периодичность("День");
	Возврат ЭтотОбъект;
КонецФункции

// Добавить параметр виртуальной таблицы.
Функция ПериодичностьНеделя() Экспорт
	Периодичность("Неделя");
	Возврат ЭтотОбъект;
КонецФункции

// Добавить параметр виртуальной таблицы.
Функция ПериодичностьДекада() Экспорт
	Периодичность("Декада");
Возврат ЭтотОбъект;КонецФункции

// Добавить параметр виртуальной таблицы.
Функция ПериодичностьМесяц() Экспорт
	Периодичность("Месяц");
	Возврат ЭтотОбъект;
КонецФункции

// Добавить параметр виртуальной таблицы.
Функция ПериодичностьКвартал() Экспорт
	Периодичность("Квартал");
Возврат ЭтотОбъект;КонецФункции

// Добавить параметр виртуальной таблицы.
Функция ПериодичностьПолугодие() Экспорт
	Периодичность("Полугодие");
Возврат ЭтотОбъект;КонецФункции

Функция ПериодичностьГод() Экспорт
	Периодичность("Год");
	Возврат ЭтотОбъект;
КонецФункции

// Добавить параметр виртуальной таблицы.
Функция ПериодичностьАвто() Экспорт
	Периодичность("Авто");
	Возврат ЭтотОбъект;
КонецФункции

#КонецОбласти

#Область Результат

Функция Результат(Индекс = Неопределено) Экспорт
	Если Индекс = Неопределено Тогда
		Возврат Результат[Результат.ВГраница()];
	КонецЕсли;
	Если ТипЗнч(Индекс) = Тип("Число") Тогда
		Возврат Результат[Индекс];
	КонецЕсли;
	Возврат Результат[ИндексРезультата[Индекс]];
КонецФункции

Функция ВыбратьРезультат(Индекс = Неопределено, ТипОбхода = Неопределено, Группировки = Неопределено, ГруппировкиДляЗначенийГруппировок = Неопределено) Экспорт
	Результат = Результат(Индекс);
	Если ТипОбхода = Неопределено Тогда
		Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой, Группировки, ГруппировкиДляЗначенийГруппировок);
	Иначе
		Выборка = Результат.Выбрать(ТипОбхода, Группировки, ГруппировкиДляЗначенийГруппировок);
	КонецЕсли;
	Возврат Выборка;
КонецФункции

Функция ВыгрузитьРезультат(Индекс = Неопределено) Экспорт
	Возврат Результат(Индекс).Выгрузить();
КонецФункции

Функция ВыбратьПервый(Индекс = Неопределено, ТипОбхода = Неопределено, Группировки = Неопределено, ГруппировкиДляЗначенийГруппировок = Неопределено) Экспорт
	Выборка = ВыбратьРезультат(Индекс, ТипОбхода, Группировки, ГруппировкиДляЗначенийГруппировок);
	Выбран = Выборка.Следующий();
	Возврат Выборка;
КонецФункции

Функция Выбран() Экспорт
	Возврат Выбран;
КонецФункции

Функция ТекстЗапроса(ИмяЗапроса = Неопределено) Экспорт
	Перем Индекс;
	
	СхемаЗапроса = СхемаЗапроса;
	
	Если НЕ ЗначениеЗаполнено(ИмяЗапроса) Тогда
		Возврат СхемаЗапроса.ПолучитьТекстЗапроса();
	КонецЕсли;
	
	ИндексЗапроса.Свойство(ИмяЗапроса, Индекс);
	
	Если Индекс = Неопределено Тогда
		ВызватьИсключение "Не найден текст запроса по имени " + ИмяЗапроса;
	КонецЕсли;
	
	Возврат СхемаЗапроса.ПакетЗапросов[Индекс].ПолучитьТекстЗапроса();
	
КонецФункции

Функция Запрос() Экспорт
	
	МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Если МенеджерВременныхТаблиц = Неопределено Тогда
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
		МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Для Каждого ЭлементПараметра Из Параметры Цикл
		Запрос.Параметры.Вставить(ЭлементПараметра.Ключ, ЭлементПараметра.Значение);
	КонецЦикла;

	Возврат Запрос;
	
КонецФункции

Функция ВыполнитьЗапрос() Экспорт

	Запрос = Запрос();	
	Результат = Запрос.ВыполнитьПакет();
	ИндексРезультата = ИндексЗапроса;
	Очистить();
	Возврат ЭтотОбъект;

КонецФункции

Функция Параметр(Имя, Значение) Экспорт
	Параметры.Вставить(Имя, Значение);
	Возврат ЭтотОбъект;
КонецФункции

#КонецОбласти

#Область Представления

// Пример получения диапазона дат взят из [Инструменты разработчика](https://github.com/tormozit/RDT1C)
Функция ПредставлениеСрезДат(ДатаНачала, ДатаОкончания) Экспорт
	
	Если ОператорВыбрать = Неопределено Тогда
		Выбрать();
	КонецЕсли;
	
	ЭтотОбъект
		.ИсточникНачать("aa")
			.Выбрать()
				.Поле("0", "a")
			.ОбъединитьВсе()
				.Поле("1", "a")
			.ОбъединитьВсе()
				.Поле("2", "a")
			.ОбъединитьВсе()
				.Поле("3", "a")
			.ОбъединитьВсе()
				.Поле("4", "a")
			.ОбъединитьВсе()
				.Поле("5", "a")
			.ОбъединитьВсе()
				.Поле("6", "a")
			.ОбъединитьВсе()
				.Поле("7", "a")
			.ОбъединитьВсе()
				.Поле("8", "a")
			.ОбъединитьВсе()
				.Поле("9", "a")
		.ИсточникЗавершить()
		.ИсточникНачать("bb")
			.Выбрать()
				.Поле("0", "a")
			.ОбъединитьВсе()
				.Поле("1", "a")
			.ОбъединитьВсе()
				.Поле("2", "a")
			.ОбъединитьВсе()
				.Поле("3", "a")
			.ОбъединитьВсе()
				.Поле("4", "a")
			.ОбъединитьВсе()
				.Поле("5", "a")
			.ОбъединитьВсе()
				.Поле("6", "a")
			.ОбъединитьВсе()
				.Поле("7", "a")
			.ОбъединитьВсе()
				.Поле("8", "a")
			.ОбъединитьВсе()
				.Поле("9", "a")
		.ИсточникЗавершить()
		.ИсточникНачать("cc")
			.Выбрать()
				.Поле("0", "a")
			.ОбъединитьВсе()
				.Поле("1", "a")
			.ОбъединитьВсе()
				.Поле("2", "a")
			.ОбъединитьВсе()
				.Поле("3", "a")
			.ОбъединитьВсе()
				.Поле("4", "a")
			.ОбъединитьВсе()
				.Поле("5", "a")
			.ОбъединитьВсе()
				.Поле("6", "a")
			.ОбъединитьВсе()
				.Поле("7", "a")
			.ОбъединитьВсе()
				.Поле("8", "a")
			.ОбъединитьВсе()
				.Поле("9", "a")
		.ИсточникЗавершить()
		.ИсточникНачать("dd")
			.Выбрать()
				.Поле("0", "a")
			.ОбъединитьВсе()
				.Поле("1", "a")
			.ОбъединитьВсе()
				.Поле("2", "a")
			.ОбъединитьВсе()
				.Поле("3", "a")
			.ОбъединитьВсе()
				.Поле("4", "a")
			.ОбъединитьВсе()
				.Поле("5", "a")
			.ОбъединитьВсе()
				.Поле("6", "a")
			.ОбъединитьВсе()
				.Поле("7", "a")
			.ОбъединитьВсе()
				.Поле("8", "a")
			.ОбъединитьВсе()
				.Поле("9", "a")
		.ИсточникЗавершить()
		.Отбор(СтрШаблон("aa.a * 1000 + bb.a * 100 + cc.a * 10 + dd.a <= РАЗНОСТЬДАТ(%1, %2, ДЕНЬ)", ФорматДатаВремя(ДатаНачала), ФорматДатаВремя(ДатаОкончания)))
		.ДобавитьКДате(ДатаНачала, "ДЕНЬ", "aa.a * 1000 + bb.a * 100 + cc.a * 10 + dd.a", "Дата")
	;
	Возврат ЭтотОбъект;
	
КонецФункции

//  ЗАПРОС ПАКЕТА. ВТ_КЛЮЧЕВАЯ_СТАВКА
//	.ПредставлениеСрезПоследнихПоДатам( 
//		"ВТ_ДАТЫ", 
//		"РегистрСведений.СтавкиЭскроуИзВнешнихИсточников", 
//		"Ставка = ЗНАЧЕНИЕ(Справочник.ТипыСтавокДоговоров.КС)", 
//		"ВТ_КЛЮЧЕВАЯ_СТАВКА"
//	)
Функция ПредставлениеСрезПоследнихПоДатам(Источник, ДатаНачала, ДатаОкончания, Условие = "", Знач ИсточникДаты = "", Знач Псевдоним = "") Экспорт
	
	Если ОператорВыбрать = Неопределено Тогда
		Выбрать();
	КонецЕсли;

	Если ПустаяСтрока(Псевдоним) Тогда
		Псевдоним = Псевдоним(Источник);
	КонецЕсли;
		
	ИндексЗапросаПакета = СхемаЗапроса.ПакетЗапросов.Индекс(ЗапросПакета);
	ЭлементИндекса = РаботаСМассивом.НайтиЭлемент(ИндексЗапроса, "Элемент.Значение = " + XMLСтрока(ИндексЗапросаПакета));
	
	Если ЭлементИндекса <> Неопределено Тогда
		ИмяЗапросаПакета = ЭлементИндекса.Ключ;
	Иначе
		ИмяЗапросаПакета = Неопределено;
	КонецЕсли;
	
	ТекущееСостояние = НовыйСостояние(ЭтотОбъект);

	Если ПустаяСтрока(ИсточникДаты) Тогда
		ИсточникДаты = ОбщийКлиентСервер.ИмяПоУникальномуИдентификатору();
		ЭтотОбъект.ЗапросПакета(, ИндексЗапросаПакета).Поместить(ИсточникДаты)
			.ПредставлениеСрезДат(ДатаНачала, ДатаОкончания)
		;
		ИндексЗапросаПакета = ИндексЗапросаПакета + 1;
	КонецЕсли;
	
	ВТ_ПЕРИОДЫ = Псевдоним + "_ПЕРИОДЫ";
	;//  ЗАПРОС ПАКЕТА. ВТ_ПЕРИОДЫ
	ЭтотОбъект.ЗапросПакета(, ИндексЗапросаПакета).Поместить(ВТ_ПЕРИОДЫ)
		.Источник(ИсточникДаты)
		.Источник(Источник, Псевдоним)
		.ВнутреннееСоединение(ИсточникДаты, Псевдоним)
			.УсловиеСвязи("%1.Дата >= %2.Период")
		.Отбор(СтрШаблон("Дата МЕЖДУ %1 И %2", ФорматДатаВремя(ДатаНачала), ФорматДатаВремя(ДатаОкончания)))
		.Отбор(Условие, ЗначениеЗаполнено(Условие))
		//  Дата->Период
		.Поле(ИсточникДаты + ".Дата")
		.Максимум(Псевдоним + ".Период")
	;//  ЗАПРОС ПАКЕТА.
	ИндексЗапросаПакета = ИндексЗапросаПакета + 1;
	// Сдвинуть индекс запроса
	Если ИмяЗапросаПакета <> Неопределено Тогда
		ИндексЗапроса.Вставить(ИмяЗапросаПакета, ИндексЗапросаПакета);
	КонецЕсли;
	// Восстановить текущее состояние
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ТекущееСостояние);
	// Добавить источник
	ЭтотОбъект
		.Источник(ВТ_ПЕРИОДЫ)
		.Источник(Источник, Псевдоним)
		.ВнутреннееСоединение(ВТ_ПЕРИОДЫ, Псевдоним)
			.Связь("Период")
		.Отбор(Условие, ЗначениеЗаполнено(Условие))
		//  Дата->Период
		.Поле(ВТ_ПЕРИОДЫ + ".Дата")
		.Поле(Псевдоним + ".Период")
		//  Ресурсы
		.Поле(Псевдоним + ".*")
	;
	Возврат ЭтотОбъект;
	
КонецФункции

//  ЗАПРОС ПАКЕТА. ВТ_ДЕНЕЖНЫЕ_СРЕДСТВА_ЭСКРОУ
//	.ПредставлениеОборотыИОстаткиПоДатам( 
//		"ВТ_ДАТЫ", 
//		"РегистрНакопления.ДенежныеСредстваЭскроу.ОстаткиИОбороты", 
//		,
//		"Сумма", 
//		"Организация = &Организация И Банк = &Банк", 
//		"&ДатаНачала", 
//		"&ДатаОкончания", 
//		"ВТ_ДЕНЕЖНЫЕ_СРЕДСТВА_ЭСКРОУ"
//	)
Функция ПредставлениеОборотыИОстаткиПоДатам(Источник, ДатаНачала = "&ДатаНачала", ДатаОкончания = "&ДатаОкончания", Измерения = "", Ресурс = "Сумма", Условие = "", ИсточникДаты = "", Псевдоним = "") Экспорт
	
	Если ОператорВыбрать = Неопределено Тогда
		Выбрать();
	КонецЕсли;

	Если ПустаяСтрока(Псевдоним) Тогда
		Псевдоним = Псевдоним(Источник);
	КонецЕсли;
		
	ИндексЗапросаПакета = СхемаЗапроса.ПакетЗапросов.Индекс(ЗапросПакета);
	ЭлементИндекса = РаботаСМассивом.НайтиЭлемент(ИндексЗапроса, "Элемент.Значение = " + XMLСтрока(ИндексЗапросаПакета));
	
	Если ЭлементИндекса <> Неопределено Тогда
		ИмяЗапросаПакета = ЭлементИндекса.Ключ;
	Иначе
		ИмяЗапросаПакета = Неопределено;
	КонецЕсли;
	
	ТекущееСостояние = НовыйСостояние(ЭтотОбъект);

	Если ПустаяСтрока(ИсточникДаты) Тогда
		ИсточникДаты = ОбщийКлиентСервер.ИмяПоУникальномуИдентификатору();
		ЭтотОбъект.ЗапросПакета(, ИндексЗапросаПакета).Поместить(ИсточникДаты)
			.ПредставлениеСрезДат(ДатаНачала, ДатаОкончания)
		;
		ИндексЗапросаПакета = ИндексЗапросаПакета + 1;
	КонецЕсли;
	
	МодельЗапроса = ЭтотОбъект;
	ВТ_ОСТАТКИ_И_ОБОРОТЫ = Псевдоним + "_ОСТАТКИ_И_ОБОРОТЫ";
	ВТ_ПЕРИОДЫ = Псевдоним + "_ПЕРИОДЫ";
	;//  ЗАПРОС ПАКЕТА. ВТ_ОСТАТКИ_И_ОБОРОТЫ
	МодельЗапроса.ЗапросПакета(, ИндексЗапросаПакета).Поместить(ВТ_ОСТАТКИ_И_ОБОРОТЫ)
		.Источник(Источник)
			.ДвиженияИГраницыПериода()
			.НачалоПериода(ДатаНачала)
			.КонецПериода(ДатаОкончания)
			.ПериодичностьДень()
			.Условие(Условие, ЗначениеЗаполнено(Условие))
		//  Период
		.Поле("Период")
		;//  Измерения
		Если ЗначениеЗаполнено(Измерения) Тогда
			Для Каждого Измерение Из ОбщийКлиентСервер.Массив(Измерения) Цикл
				МодельЗапроса.Поле(Измерение);
			КонецЦикла;
		КонецЕсли;
		МодельЗапроса
		//  Ресурсы
		.Поле(Ресурс + "НачальныйОстаток")
		.Поле(Ресурс + "Приход")
		.Поле(Ресурс + "Расход")
		.Поле(Ресурс + "КонечныйОстаток")
	;//  ЗАПРОС ПАКЕТА. ВТ_ПЕРИОДЫ
	ИндексЗапросаПакета = ИндексЗапросаПакета + 1;
	МодельЗапроса.ЗапросПакета(, ИндексЗапросаПакета).Поместить(ВТ_ПЕРИОДЫ)
		.Источник(ИсточникДаты)
		.Источник(ВТ_ОСТАТКИ_И_ОБОРОТЫ)
		.ВнутреннееСоединение(ИсточникДаты, ВТ_ОСТАТКИ_И_ОБОРОТЫ)
			.УсловиеСвязи("%1.Дата >= %2.Период")
		//  Дата->Период
		.Поле(ИсточникДаты + ".Дата")
		;//  Измерения
		Если ЗначениеЗаполнено(Измерения) Тогда
			Для Каждого Измерение Из ОбщийКлиентСервер.Массив(Измерения) Цикл
				МодельЗапроса.Поле(Измерение);
			КонецЦикла;
		КонецЕсли;
		МодельЗапроса
			.Максимум(ВТ_ОСТАТКИ_И_ОБОРОТЫ + ".Период")
	;//  ЗАПРОС ПАКЕТА.
	ИндексЗапросаПакета = ИндексЗапросаПакета + 1;
	// Сдвинуть индекс запроса
	Если ИмяЗапросаПакета <> Неопределено Тогда
		ИндексЗапроса.Вставить(ИмяЗапросаПакета, ИндексЗапросаПакета);
	КонецЕсли;
	// Восстановить текущее состояние
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ТекущееСостояние);
	// Добавить источник
	МодельЗапроса
		.Источник(ВТ_ПЕРИОДЫ)
		.Источник(ВТ_ОСТАТКИ_И_ОБОРОТЫ)
		.ВнутреннееСоединение(ВТ_ПЕРИОДЫ, ВТ_ОСТАТКИ_И_ОБОРОТЫ)
			.Связь("Период")
		;
		Если ЗначениеЗаполнено(Измерения) Тогда
			МодельЗапроса.Связь(Измерения);
		КонецЕсли;
		МодельЗапроса
			//  Дата->Период
			.Поле(ВТ_ПЕРИОДЫ + ".Дата")
			.Поле(ВТ_ОСТАТКИ_И_ОБОРОТЫ + ".Период")
			;//  Измерения
			Если ЗначениеЗаполнено(Измерения) Тогда
				МодельЗапроса.Поле(РаботаСМассивом.Отобразить(ОбщийКлиентСервер.Массив(Измерения), СтрШаблон("'%1.' + Элемент", ВТ_ОСТАТКИ_И_ОБОРОТЫ)));
			КонецЕсли;
			МодельЗапроса
			//  Ресурсы
			.Поле(СтрШаблон("ВЫБОР
				|	КОГДА %1.Дата = %2.Период
				|		ТОГДА %2.%3НачальныйОстаток
				|	ИНАЧЕ %2.%3КонечныйОстаток
				|КОНЕЦ", ВТ_ПЕРИОДЫ, ВТ_ОСТАТКИ_И_ОБОРОТЫ, Ресурс), Ресурс + "НачальныйОстаток")
			.Поле(СтрШаблон("ВЫБОР
				|	КОГДА %1.Дата = %2.Период
				|		ТОГДА %2.%3Приход
				|	ИНАЧЕ 0
				|КОНЕЦ", ВТ_ПЕРИОДЫ, ВТ_ОСТАТКИ_И_ОБОРОТЫ, Ресурс), Ресурс + "Приход")
			.Поле(СтрШаблон("ВЫБОР
				|	КОГДА %1.Дата = %2.Период
				|		ТОГДА %2.%3Расход
				|	ИНАЧЕ 0
				|КОНЕЦ", ВТ_ПЕРИОДЫ, ВТ_ОСТАТКИ_И_ОБОРОТЫ, Ресурс), Ресурс + "Расход")
			.Поле(СтрШаблон("%1.%2КонечныйОстаток", ВТ_ОСТАТКИ_И_ОБОРОТЫ, Ресурс))
	;
	Возврат ЭтотОбъект;
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//  Возвращаемое значение: КолонкиВременнойТаблицыЗапроса(Имя, ТипЗначения) | ДоступноеПолеСхемыЗапроса(Имя, ТипЗначения)
Функция ДоступныеПоля(ИмяТаблицы)
	ВременныеТаблицы = ЗапросПакета.ДоступныеТаблицы.Найти("Временные таблицы");
	Если ВременныеТаблицы <> Неопределено Тогда
		ИсточникТаблицы = ВременныеТаблицы.Состав.Найти(ИмяТаблицы);
		Если ИсточникТаблицы <> Неопределено Тогда
			Возврат ИсточникТаблицы.Поля;
		КонецЕсли;
	КонецЕсли;
	ИсточникТаблицы = МенеджерВременныхТаблиц.Таблицы.Найти(ИмяТаблицы);
	Если ИсточникТаблицы <> Неопределено Тогда
		Возврат ИсточникТаблицы.Колонки;
	КонецЕсли;
	Возврат Новый Массив;
КонецФункции

Функция ПоляТаблицы(ИмяТаблицы, ПоляИсточника = Неопределено)
	Поля = Новый Массив;
	Если ПоляИсточника = Неопределено Тогда
		Для Каждого ДоступноеПоле Из ДоступныеПоля(ИмяТаблицы) Цикл
			Поля.Добавить(ДоступноеПоле.Имя);
		КонецЦикла;
		Возврат Поля;
	КонецЕсли;
	Для Каждого ДоступноеПоле Из ДоступныеПоля(ИмяТаблицы) Цикл
		Если ПоляИсточника.Найти(ДоступноеПоле.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Поля.Добавить(ДоступноеПоле.Имя);
	КонецЦикла;
	Возврат Поля;
КонецФункции

// Формирует текст выражения вхождения по шаблону:
// (<Поля слева>) В (ВЫБРАТЬ <Поля справа> ИЗ <Имя таблицы> КАК <Имя таблицы>)
// 
// Параметры:
//  ИмяТаблицы - Строка - Имя таблицы
//  Поля - Строка - Поля или соответствия полей слева и справа
//                 <Поле слева> = <Поле справа>|<Поле>|<Поле слева> = &<Параметр справа>[, ...]
//  ПоляИсточника - Строка, Неопределено - Поля источника
// 
// Возвращаемое значение:
//  Строка - Выражение вхождения
Функция ВыражениеВхождения(ИмяТаблицы, Поля = "*", ПоляИсточника = Неопределено)
	Если Поля = "*" Тогда
		Поля = ПоляТаблицы(ИмяТаблицы, ПоляИсточника);
		ПоляСлева = Поля; 
		ПоляСправа = Поля;
		Возврат СтрШаблон("(%1) В (ВЫБРАТЬ РАЗЛИЧНЫЕ %2 ИЗ %3 КАК %3)", СтрСоединить(Поля, ", "), ИмяТаблицы + "." + СтрСоединить(Поля, ", " + ИмяТаблицы + "."), ИмяТаблицы);
	КонецЕсли;
	ПоляСлева = Новый Массив;
	ПоляСправа = Новый Массив;
	Для Каждого Связь Из ОбщийКлиентСервер.Массив(Поля) Цикл
		Состав = СтрРазделить(Связь, "=", Ложь);
		Если Состав.Количество() = 1 Тогда
			ПоляСлева.Добавить(Связь);
			ПоляСправа.Добавить(ИмяТаблицы + "." +Связь);
			Продолжить;
		КонецЕсли;
		ПоляСлева.Добавить(Состав[0]);
		ПолеСправа = Состав[1];
		Если СтрНачинаетсяС(ПолеСправа, "&") Тогда
			ПоляСправа.Добавить(Состав[1]);
			Продолжить;
		КонецЕсли;
		ПоляСправа.Добавить(ИмяТаблицы + "." + ПолеСправа);
	КонецЦикла;
	Возврат СтрШаблон("(%1) В (ВЫБРАТЬ РАЗЛИЧНЫЕ %2 ИЗ %3 КАК %3)", СтрСоединить(ПоляСлева, ", "), СтрСоединить(ПоляСправа, ", "), ИмяТаблицы);
КонецФункции

Функция Псевдоним(Выражение, Псевдоним = "")
	Если НЕ ПустаяСтрока(Псевдоним) Тогда
		Возврат Псевдоним;
	КонецЕсли;
	Если Лев(Выражение, 1) = "&" Тогда
		Возврат Прав(Выражение, СтрДлина(Выражение) - 1);
	КонецЕсли;
	Позиция = СтрНайти(Выражение, ".", НаправлениеПоиска.СНачала);
	Если Позиция > 0 Тогда
		ПсевдонимПоля = Прав(Выражение, СтрДлина(Выражение) - Позиция);
	Иначе
		ПсевдонимПоля = Выражение;
	КонецЕсли;
	Возврат СтрЗаменить(ПсевдонимПоля, ".", "");
КонецФункции

// Добавляет выбранное поле компоновки данных
//
// Параметры:
//	Куда		(КомпоновщикНастроекКомпоновкиДанных, НастройкиКомпоновкиДанных, ВыбранныеПоляКомпоновкиДанных)
//	ИмяИлиПолеКД(Строка, ПолеКомпоновкиДанных)
//	Заголовок	(Строка) Необязательный
//
// Возвращаемое значение:
//	ВыбранноеПолеКД (ВыбранноеПолеКомпоновкиДанных)
//
Функция ДобавитьВыбранноеПолеСКД(Куда, ИмяИлиПолеКД, Заголовок = "")
	
	Если ТипЗнч(Куда) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		ВыбранныеПоляКД = Куда.Настройки.Выбор;
	ИначеЕсли ТипЗнч(Куда) = Тип("НастройкиКомпоновкиДанных") Тогда
		ВыбранныеПоляКД = Куда.Выбор;
	Иначе
		ВыбранныеПоляКД = Куда;
	КонецЕсли;
	
	Если ТипЗнч(ИмяИлиПолеКД) = Тип("Строка") Тогда
		ПолеКД = Новый ПолеКомпоновкиДанных(ИмяИлиПолеКД);
	Иначе
		ПолеКД = ИмяИлиПолеКД;
	КонецЕсли;
	
	ВыбранноеПолеКД = ВыбранныеПоляКД.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКД.Поле = ПолеКД;
	Если Заголовок <> "" Тогда
		ВыбранноеПолеКД.Заголовок = Заголовок;
	КонецЕсли;
	
	Возврат ВыбранноеПолеКД;
	
КонецФункции

// Добавляет отбор в коллекцию отборов компоновщика или группы отборов
//
// Параметры:
//	ЭлементСтруктуры- элемент структуры КД
//	Поле			- имя поля, по которому добавляется отбор
//	Значение		- значение отбора КД
//	ВидСравнения	- вид сравнений КД (по умолчанию: неопределено)
//	Использование	- признак использования отбора (по умолчанию: истина)
//	ВПользовательскиеНастройки - признак добавления в пользовательсие настройки КД (по умолчанию: ложь)
//
// Возвращаемое значение:
//	ЭлементОтбора (ЭлементОтбораКомпоновкиДанных)
//
Функция ДобавитьОтборСКД(ЭлементСтруктуры, Знач Поле, Значение, ВидСравнения = Неопределено, Использование = Истина, ВПользовательскиеНастройки = Ложь)
	
	Если ТипЗнч(Поле) = Тип("Строка") Тогда
		Поле = Новый ПолеКомпоновкиДанных(Поле);
	КонецЕсли;
	
	Если ТипЗнч(ЭлементСтруктуры) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		Отбор = ЭлементСтруктуры.Настройки.Отбор;
		
		Если ВПользовательскиеНастройки Тогда
			Для Каждого ЭлементНастройки Из ЭлементСтруктуры.ПользовательскиеНастройки.Элементы Цикл
				Если ЭлементНастройки.ИдентификаторПользовательскойНастройки = ЭлементСтруктуры.Настройки.Отбор.ИдентификаторПользовательскойНастройки Тогда
					Отбор = ЭлементНастройки;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("НастройкиКомпоновкиДанных") Тогда
		Отбор = ЭлементСтруктуры.Отбор;
	Иначе
		Отбор = ЭлементСтруктуры;
	КонецЕсли;
	
	Если ВидСравнения = Неопределено Тогда
		ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
	ЭлементОтбора = Неопределено;
	Для каждого Элемент Из Отбор.Элементы Цикл
		
		Если ТипЗнч(Элемент) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		Если Элемент.ЛевоеЗначение = Поле Тогда
			ЭлементОтбора = Элемент;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	КонецЕсли;
	
	ЭлементОтбора.Использование		= Использование;
	ЭлементОтбора.ЛевоеЗначение		= Поле;
	ЭлементОтбора.ВидСравнения		= ВидСравнения;
	ЭлементОтбора.ПравоеЗначение	= Значение;
	
	Возврат ЭлементОтбора;
	
КонецФункции

Функция ПолучитьИсточник(ИндексИлиПсевдоним = Неопределено)
	Перем Источник;
	Если ТипЗнч(ИндексИлиПсевдоним) = Тип("Строка") Тогда
		Источник = ОператорВыбрать.Источники.НайтиПоПсевдониму(ИндексИлиПсевдоним);
		Если Источник = Неопределено Тогда
			Источник = ОператорВыбрать.Источники.НайтиПоИмени(ИндексИлиПсевдоним);
		КонецЕсли;
		Возврат Источник;
	КонецЕсли;
	Если ИндексИлиПсевдоним = Неопределено Тогда
		ВыбранныйИндекс = ОператорВыбрать.Источники.Количество() - 1;
	Иначе
		ВыбранныйИндекс = ИндексИлиПсевдоним;
	КонецЕсли;
	Если ВыбранныйИндекс = -1 Тогда
		Источник = Неопределено;
		Возврат Источник;
	КонецЕсли;
	Источник = ОператорВыбрать.Источники[ВыбранныйИндекс];
	Возврат Источник;
КонецФункции

Процедура ДополнитьВыражениеПараметра(Источник, ИмяПараметра, Выражение)
	Перем ТекущееВыражение;
	ПараметрыТаблицы = ПараметрыВиртуальнойТаблицы(Источник.Источник.ИмяТаблицы, Источник.Источник.Параметры);
	Если ПараметрыТаблицы <> Неопределено И ПараметрыТаблицы.Свойство(ИмяПараметра, ТекущееВыражение) Тогда
		УстановитьПараметрыВиртуальнойТаблицы(Источник, Новый Структура(ИмяПараметра, СтрШаблон("(%1) И (%2)", ТекущееВыражение, Выражение)));
	Иначе
		УстановитьПараметрыВиртуальнойТаблицы(Источник, Новый Структура(ИмяПараметра, Выражение));
	КонецЕсли;
КонецПроцедуры

Функция ВыражениеВВидСубконто(Выражение)
	Если ТипЗнч(Выражение) <> Тип("Строка") Тогда
		Возврат Выражение;
	КонецЕсли;
	Состав = СтрРазделить(СтрЗаменить(Выражение, ")", ""), ".");
	Состав[0] = "ПланыВидовХарактеристик";
	Состав[2] = СтрЗаменить(Состав[2], ")", "");
	//@skip-check server-execution-safe-mode
	ЗначениеВыражения = Вычислить(СтрСоединить(Состав, "."));
	Возврат ЗначениеВыражения;
КонецФункции

Функция ВидСубконтоВВыражение(Выражение)
	Если ТипЗнч(Выражение) = Тип("Строка") Тогда
		Возврат Выражение;
	КонецЕсли;
	ЗначениеВыражения = СтрШаблон("ЗНАЧЕНИЕ(ПланВидовХарактеристик.%1.%2)", Выражение.Метаданные().Имя, Выражение.ИмяПредопределенныхДанных);
	Возврат ЗначениеВыражения;
КонецФункции

Процедура ДополнитьСубконто(Источник, Параметры, ПараметрТаблицы, Значение)
	Перем Выражение;
	ПараметрыТаблицы = ПараметрыВиртуальнойТаблицы(Источник.Источник.ИмяТаблицы, Источник.Источник.Параметры);
	Если ПараметрыТаблицы <> Неопределено И ПараметрыТаблицы.Свойство(ПараметрТаблицы, Выражение) И ЗначениеЗаполнено(Выражение) Тогда
		Если СтрНачинаетсяС(Выражение, "&") Тогда
			ИмяПараметра = Прав(Выражение, СтрДлина(Выражение) - 1);
			ЗначениеПараметра = Параметры[ИмяПараметра];
			Если ТипЗнч(ЗначениеПараметра) = Тип("Массив") Тогда
				ВидыСубконто = ЗначениеПараметра;
			Иначе
				ВидыСубконто = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЗначениеПараметра);
			КонецЕсли;
			Если ТипЗнч(Значение) = Тип("Массив") Тогда
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВидыСубконто, Значение);
			Иначе
				ВидыСубконто.Добавить(Значение);
			КонецЕсли;
			Параметры[ИмяПараметра] = ВидыСубконто;
			Возврат;
		КонецЕсли;
		ВидыСубконто = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыражениеВВидСубконто(Выражение));
		ВидыСубконто.Добавить(ВыражениеВВидСубконто(Значение));
		ИмяПараметра = ОбщийКлиентСервер.ИмяПоУникальномуИдентификатору();
		УстановитьПараметрыВиртуальнойТаблицы(Источник, Новый Структура(ПараметрТаблицы, "&" + ИмяПараметра));
		Параметры.Вставить(ИмяПараметра, ВидыСубконто);
	Иначе
		УстановитьПараметрыВиртуальнойТаблицы(Источник, Новый Структура(ПараметрТаблицы, ВидСубконтоВВыражение(Значение)));
	КонецЕсли;
КонецПроцедуры

Процедура ОчиститьСоединенияИсточника(Источник)
	
	Псевдоним = Источник.Источник.Псевдоним;
	Источник.Соединения.Очистить();
	
	Для Каждого ИсточникСоединения Из ОператорВыбрать.Источники Цикл
		Соединения = ИсточникСоединения.Соединения;
		СоединениеСИсточником = Соединения.НайтиПоПсевдониму(Псевдоним);
		Пока СоединениеСИсточником <> Неопределено Цикл
			Соединения.Удалить(Соединения.Индекс(СоединениеСИсточником));
			СоединениеСИсточником = Соединения.НайтиПоПсевдониму(Псевдоним);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьИсточник(Таблица, Псевдоним = "")

	Попытка
		ОператорВыбрать.Источники.Добавить(Таблица, Псевдоним);
	Исключение
		// возможно это временная таблица
		ДобавитьОписаниеВременнойТаблицы(Таблица, Псевдоним);
		Возврат;
	КонецПопытки;
	
	Источник = ОператорВыбрать.Источники[ОператорВыбрать.Источники.Количество()-1];
	ИсточникСлева = Источник;
	ДоступныеПоля = Источник.Источник.ДоступныеПоля;
	ОчиститьСоединенияИсточника(Источник);

КонецПроцедуры

Процедура ДобавитьВложенныйЗапрос(Псевдоним = "ВложенныйЗапрос")

	ОператорВыбрать.Источники.Добавить(Тип("ВложенныйЗапросСхемыЗапроса"), Псевдоним);
	Источник = ОператорВыбрать.Источники[ОператорВыбрать.Источники.Количество()-1];
	ИсточникСлева = Источник;
	ДоступныеПоля = Источник.Источник.ДоступныеПоля;
	ОчиститьСоединенияИсточника(Источник);

КонецПроцедуры

Процедура ДобавитьОписаниеВременнойТаблицы(Таблица, Псевдоним = "")

	ОператорВыбрать.Источники.Добавить(Тип("ОписаниеВременнойТаблицыСхемыЗапроса"), Таблица, Псевдоним);
	Источник = ОператорВыбрать.Источники[ОператорВыбрать.Источники.Количество()-1];
	ИсточникСлева = Источник;
	ДоступныеПоля = Источник.Источник.ДоступныеПоля;
	ОчиститьСоединенияИсточника(Источник);

КонецПроцедуры


Функция НовыйСостояние(МодельЗапроса = Неопределено)
	
	Состояние = Новый Структура;
	Состояние.Вставить("ЗапросПакета");
	Состояние.Вставить("ОператорВыбрать");
	Состояние.Вставить("Источник");
	Состояние.Вставить("ИсточникСлева");
	Состояние.Вставить("ИсточникСправа");
	Состояние.Вставить("Поле");
	Состояние.Вставить("Соединение");
	Состояние.Вставить("ТипСоединения");
	Состояние.Вставить("КонтрольнаяТочка");
	
	Состояние.Вставить("ИндексОператора");
	Состояние.Вставить("ВыбираемыеПоля");
	Состояние.Вставить("Колонки");
	
	Если МодельЗапроса = Неопределено Тогда
		Возврат Состояние;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Состояние, МодельЗапроса);
	Возврат Состояние;
	
КонецФункции

Процедура СохранитьСостояние()
	Стек.Добавить(НовыйСостояние(ЭтотОбъект));
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НовыйСостояние());	
КонецПроцедуры

Процедура ВосстановитьСостояние()
	Стек = Стек;
	Состояние = Стек[Стек.ВГраница()];
	Стек.Удалить(Стек.ВГраница());
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Состояние);
КонецПроцедуры

// Установить параметры виртуальной таблицы.
// 
// Параметры:
//  Источник - ИсточникСхемыЗапроса - Источник
//	ПараметрыВиртуальнойТаблицы - Массив из Строка - параметры определяются индексом элемента массива. В качестве значения параметров выступает текстовое описание (см. встроенная справка - работа с запросом - таблицы - параметры).
//								- Структура - ключи структуры соответствуют названиям параметров виртуальной таблицы из справки в конфигураторе без пробелов. 
Процедура УстановитьПараметрыВиртуальнойТаблицы(Источник, ПараметрыВиртуальнойТаблицы)
	ПараметрыИсточника	= Источник.Источник.Параметры;
	ТипЗначения = ТипЗнч(ПараметрыВиртуальнойТаблицы);
	Если ТипЗначения = Тип("Структура") Тогда 
		СтруктураПараметров = ПараметрыВиртуальнойТаблицы(ИмяВиртуальнойТаблицы(Источник.Источник.ИмяТаблицы));
		Для каждого ЭлементПараметров Из ПараметрыВиртуальнойТаблицы Цикл
			Если ЭлементПараметров.Значение = "*" Тогда
				ПараметрыИсточника[СтруктураПараметров[ЭлементПараметров.Ключ]].Выражение = Новый ВыражениеСхемыЗапроса("&"+ЭлементПараметров.Ключ);
			Иначе
				ПараметрыИсточника[СтруктураПараметров[ЭлементПараметров.Ключ]].Выражение = Новый ВыражениеСхемыЗапроса(ЭлементПараметров.Значение);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗначения = Тип("ПараметрыТаблицыСхемыЗапроса") Тогда
		Индекс = -1;
		Для каждого Параметр Из ПараметрыВиртуальнойТаблицы Цикл
			Индекс = Индекс + 1;
			ПараметрыИсточника[Индекс].Выражение = Параметр.Выражение;
		КонецЦикла;
	Иначе //  массив
		Для Индекс = 0 По ПараметрыВиртуальнойТаблицы.ВГраница() Цикл
			ПараметрыИсточника[Индекс].Выражение = Новый ВыражениеСхемыЗапроса(ПараметрыВиртуальнойТаблицы[Индекс]);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция ИмяВиртуальнойТаблицы(ИмяТаблицы)
	МассивСлов = СтрРазделить(ИмяТаблицы, ".");
	Возврат МассивСлов[0]+"."+МассивСлов[2];
КонецФункции

Функция ИсточникПоПсевдониму(ОператорВыбрать, Псевдоним)
	
	Источник = ОператорВыбрать.Источники.НайтиПоПсевдониму(Псевдоним);
	
	Если Источник = Неопределено Тогда
		Источник = ОператорВыбрать.Источники.НайтиПоИмени(Псевдоним);
	КонецЕсли;
	
	Если Источник = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Не удалось определить источник по псевдониму ""%1""", Псевдоним);
	КонецЕсли;
	
	Возврат Источник;
	
КонецФункции

Процедура Соединение(ПсевдонимСлева, ПсевдонимСправа, Условие = Неопределено, Тип = Неопределено)

	ТипСоединения = ?(Тип = Неопределено, ТипСоединенияСхемыЗапроса.ЛевоеВнешнее, Тип);
	ИсточникСлева = ИсточникПоПсевдониму(ОператорВыбрать, ПсевдонимСлева);
	ИсточникСправа = ИсточникПоПсевдониму(ОператорВыбрать, ПсевдонимСправа);
	Соединение = Неопределено;// само соединение будет добавлено в момент появления условия связи
	
	Если ЗначениеЗаполнено(Условие) Тогда
		УсловиеСвязи(Условие);
	КонецЕсли;
	
КонецПроцедуры

// Добавляет условие к существующим условиям соединения источников.
//
// Параметры:
//  Соединение - СоединениеИсточникаЗапросаСхемыЗапроса
//  Условие - Строка - псевдоним источника
Процедура ДобавитьУсловиеСоединения(Соединение, Условие)
	
	ТекущееУсловие = Строка(Соединение.Условие);
	
	Если ПустаяСтрока(ТекущееУсловие) Тогда
		Соединение.Условие = Новый ВыражениеСхемыЗапроса(Условие);
		Возврат;
	КонецЕсли;
	
	Соединение.Условие = Новый ВыражениеСхемыЗапроса(СтрШаблон("(%1) И (%2)", ТекущееУсловие, Условие));
	
КонецПроцедуры

Функция УсловиеСоединения(Поля)
	МассивУсловий = Новый Массив;
	Если ТипЗнч(Поля) = Тип("Строка") ИЛИ ТипЗнч(Поля) = Тип("Массив") Тогда
		Для каждого Поле Из ОбщийКлиентСервер.Массив(Поля) Цикл
			СоставПолей = СтрРазделить(Поле, "= ", Ложь);
			Если СоставПолей.ВГраница() = 0 Тогда
				ПолеСлева = СоставПолей[0];
				ПолеСправа = СоставПолей[0];
			Иначе
				ПолеСлева = СоставПолей[0];
				ПолеСправа = СоставПолей[1];
			КонецЕсли;
			МассивУсловий.Добавить(СтрШаблон("%%1.%1 = %%2.%2", ПолеСлева, ПолеСправа));
		КонецЦикла; 
	Иначе
		Для каждого Поле Из Поля Цикл
			МассивУсловий.Добавить(СтрШаблон("%%1.%1 = %%2.%1", Поле.Имя));
		КонецЦикла; 
	КонецЕсли; 
	Возврат СтрСоединить(МассивУсловий, " И ");	
КонецФункции

Функция ФорматДатаВремя(Значение)
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		Возврат Значение;
	КонецЕсли;
	Возврат СтрШаблон("ДАТАВРЕМЯ(%1)", Формат(Значение, "ДФ='yyyy, M, d, H, m, s';"));
КонецФункции

#КонецОбласти

#Область Инициализация

СхемаЗапроса = Новый СхемаЗапроса;
ИндексЗапроса = Новый Структура;
Стек = Новый Массив;
Параметры = Новый Структура;

#КонецОбласти