#Область ОписаниеПеременных

Перем Метки;
Перем МодельТекста;
Перем ТекстМодуля;

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция НовыйПараметры() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("ДобавитьОтступы", Ложь);
//	Результат.Вставить("ДобавитьОписанияВременныхТаблиц", Ложь);
	Возврат Результат;
КонецФункции

// Сформировать
// 
// Параметры:
// ТекстЗапроса - Строка - Текст запроса
// 
// Возвращаемое значение:
// Строка - Сформировать
Функция Сформировать(ТекстЗапроса, Знач Параметры = Неопределено) Экспорт
	
	Метки = Новый Массив;
	МодельТекста = Общий.МодельТекста().Отступы(Параметры.ДобавитьОтступы)
		.Добавить("//@Компайлер ТекстЗапросаВРаботуСоСхемойЗапроса")
		.Добавить("//Перем СхемаЗапроса, ОператорВыбрать;")
	;
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	ТекстМодуля = Новый ТекстовыйДокумент;
	Сч = 0;
	
	Для Каждого ЗапросПакета Из СхемаЗапроса.ПакетЗапросов Цикл
		ТекстМодуля.ДобавитьСтроку("////////////////////////////////////////////////////////////////////////////////");
		ТекстМодуля.ДобавитьСтроку("//  ЗАПРОС ПАКЕТА "+Строка(Сч));
		ДобавитьТекстМодуляЗапросаПакета(ТекстМодуля, ЗапросПакета);
		Сч = Сч + 1;
	КонецЦикла;
	
	МодельТекста.Добавить(ТекстМодуля.ПолучитьТекст());
	Возврат МодельТекста.ПолучитьТекст();
	
КонецФункции

Функция ТекстЗапроса(Код1С) Экспорт
	Перем ТекстЗапроса;
	
	МодельТекста = Общий.МодельТекста();
	МодельТекста
		.Добавить("СхемаЗапроса = Неопределено;")
		.Добавить("ОператорВыбрать = Неопределено;")
		.Добавить(СтрЗаменить(Код1С, "%", "%%"))
		.Добавить("ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();")
	;
	УстановитьБезопасныйРежим(Истина);
	Выполнить(МодельТекста.Текст());
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

//  Шаблон в формате: 
Функция ДобавитьСтрокуМодуля(ТекстМодуля = Неопределено, ТекстШаблона, СоответствиеПараметров = Неопределено, Приставка = "")
	Перем ЗначениеПараметра;
	
	Если СтрНачинаетсяС(ТекстШаблона, "//") Тогда
		Возврат "";
	КонецЕсли;
	
	RegExp				= Новый COMОбъект("VBScript.RegExp");
	RegExp.Multiline	= Истина;
	RegExp.Global		= Истина;
	RegExp.IgnoreCase	= Истина;
	RegExp.Pattern		= "\[([^\[\]]+)\]";// найти слова в квадратных скобках
	
	ТекстВыражения		= "";
	ИндексПозиции		= 1;
	Matches				= RegExp.Execute(ТекстШаблона);
	Для каждого Match Из Matches Цикл
		ДельтаПозиции	= Match.FirstIndex - ИндексПозиции + 1;
		ДельтаТекста	= Сред(ТекстШаблона, ИндексПозиции, ДельтаПозиции);
		ИндексПозиции	= ИндексПозиции + ДельтаПозиции + Match.Length;
		
		КлючПараметра	= Лев(Прав(Match.Value, Match.Length-1), Match.Length-2);
		Если СоответствиеПараметров = Неопределено ИЛИ Не СоответствиеПараметров.Свойство(КлючПараметра, ЗначениеПараметра) Тогда
			ЗначениеПараметра = ?(КлючПараметра = Приставка, "", Приставка) + КлючПараметра;
		КонецЕсли;
		
		ТекстВыражения	= ТекстВыражения + ДельтаТекста + ЗначениеПараметра;
	КонецЦикла;
	ДельтаТекста	= Сред(ТекстШаблона, ИндексПозиции, СтрДлина(ТекстШаблона)-ИндексПозиции+1);
	ТекстВыражения	= ТекстВыражения + ДельтаТекста;
	Если ТекстМодуля <> Неопределено Тогда
		ТекстМодуля.ДобавитьСтроку(ТекстВыражения);
	КонецЕсли;
	Возврат ТекстВыражения;
	
КонецФункции

Функция Псевдоним(ПутьКДанным) 
	Возврат СтрЗаменить(ОбщийКлиентСервер.НачалоСтрокиПослеРазделителя(ПутьКДанным, "."), ".", "");
КонецФункции

Процедура ДобавитьТекстМодуляЗапросаПакета(ТекстМодуля, ЗапросПакета, Приставка = "", ЭтоВложенныйЗапрос = Ложь)
	Если ЭтоВложенныйЗапрос Тогда
		//ДобавитьСтрокуМодуля(ТекстМодуля, "//{	Вложенный запрос "+Приставка);
		ТекстМодуля.ДобавитьСтроку("//{	Вложенный запрос "+Приставка);
	КонецЕсли;
	Если ТипЗнч(ЗапросПакета) = Тип("ЗапросУничтоженияТаблицыСхемыЗапроса") Тогда	
		ДобавитьСтрокуМодуля(ТекстМодуля, "//  Запрос на уничтожение временной таблицы "+ЗапросПакета.ИмяТаблицы);
		ДобавитьСтрокуМодуля(ТекстМодуля, "РаботаСоСхемойЗапроса.ЗапросПакета(СхемаЗапроса, ""[ИмяТаблицы]"", Истина);", Новый Структура("ИмяТаблицы", ЗапросПакета.ИмяТаблицы), Приставка);
		Возврат;
	Иначе
		Если ЗначениеЗаполнено(ЗапросПакета.ТаблицаДляПомещения) Тогда
			ДобавитьСтрокуМодуля(ТекстМодуля, "//  Запрос на создание временной таблицы "+ЗапросПакета.ТаблицаДляПомещения);
			ДобавитьСтрокуМодуля(ТекстМодуля, "[ЗапросПакета] 	= РаботаСоСхемойЗапроса.ЗапросПакета(СхемаЗапроса, ""[ТаблицаДляПомещения]"",, ОператорВыбрать);", Новый Структура("ТаблицаДляПомещения", ЗапросПакета.ТаблицаДляПомещения), Приставка);
		Иначе
			Если Не ЭтоВложенныйЗапрос Тогда
				ДобавитьСтрокуМодуля(ТекстМодуля, "//  Запрос на выборку данных");
				ДобавитьСтрокуМодуля(ТекстМодуля, "[ЗапросПакета] 	= РаботаСоСхемойЗапроса.ЗапросПакета(СхемаЗапроса,,"+?(ЗапросПакета.ВыбиратьРазрешенные, " Истина", "")+", ОператорВыбрать);",, Приставка);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ДобавитьСтрокуМодуля(ТекстМодуля, "//  Операторы Выбрать");
	ЭтоПервыйОператор = Истина;
	Для Каждого ОператорВыбрать Из ЗапросПакета.Операторы Цикл
		ПараметрыОператора	= СтрРазделить("ВыбиратьРазличные,КоличествоПолучаемыхЗаписей,ТипОбъединения", ",");
		ЗначенияПараметровОператора = Новый Структура;
		ОписаниеКлючейПараметров	= "";
		ОписаниеЗначенийПараметров	= "";
		Для Индекс = 0 По ПараметрыОператора.ВГраница() Цикл
			Ключ		= ПараметрыОператора[Индекс];
			Значение	= ОператорВыбрать[Ключ];
			Если ЗначениеЗаполнено(Значение) И НЕ (Значение = Ложь ИЛИ Значение = ТипОбъединенияСхемыЗапроса.ОбъединитьВсе) Тогда
				ТипЗначения = ТипЗнч(Значение);
				Если ТипЗначения = Тип("Булево") Тогда
					ПредставлениеЗначения = ?(Значение, "Истина", "Ложь");
				ИначеЕсли ТипЗначения = Тип("Число") Тогда
					ПредставлениеЗначения = Строка(Значение);
				Иначе
					ПредставлениеЗначения = Строка(ТипЗначения)+"."+СтрЗаменить(Значение, " ", "");
				КонецЕсли;
				ОписаниеКлючейПараметров	= ОписаниеКлючейПараметров   + ?(ОписаниеКлючейПараметров = "", "", ", ") + Ключ;
				ОписаниеЗначенийПараметров	= ОписаниеЗначенийПараметров + ?(ОписаниеЗначенийПараметров = "", "", ", ") + ПредставлениеЗначения;
				ЗначенияПараметровОператора.Вставить(Ключ, ПредставлениеЗначения);
			КонецЕсли;
		КонецЦикла;
		Если Не ПустаяСтрока(ОписаниеКлючейПараметров) Тогда
			ОписаниеПараметров = "Новый Структура(""" + ОписаниеКлючейПараметров + """, " + ОписаниеЗначенийПараметров + ")";
			Если ЭтоПервыйОператор И НЕ ЭтоВложенныйЗапрос Тогда
				Если ЗначенияПараметровОператора.Количество()=1 Тогда
					Для каждого ЭлементЗначения Из ЗначенияПараметровОператора Цикл
						ДобавитьСтрокуМодуля(ТекстМодуля, "[ОператорВыбрать].[Параметр] = [Значение];", Новый Структура("Параметр,Значение", ЭлементЗначения.Ключ, ЭлементЗначения.Значение), Приставка);
					КонецЦикла;
				Иначе
					ДобавитьСтрокуМодуля(ТекстМодуля, "ЗаполнитьЗначенияСвойств([ОператорВыбрать], [ОписаниеПараметров]);", Новый Структура("ОписаниеПараметров", ОписаниеПараметров), Приставка);
				КонецЕсли; 
			Иначе
				Если НЕ ЭтоПервыйОператор Тогда
					Если ЗначенияПараметровОператора.Свойство("ТипОбъединения") И ЗначенияПараметровОператора.ТипОбъединения = "ТипОбъединенияСхемыЗапроса.Объединить" Тогда
						ТекстМодуля.ДобавитьСтроку("//  ОБЪЕДИНИТЬ");
					Иначе 
						ТекстМодуля.ДобавитьСтроку("//  ОБЪЕДИНИТЬ ВСЕ");
					КонецЕсли; 
				КонецЕсли; 
				ДобавитьСтрокуМодуля(ТекстМодуля, "[ОператорВыбрать] = РаботаСоСхемойЗапроса.Оператор([ЗапросПакета], [ОписаниеПараметров]);", Новый Структура("ОписаниеПараметров", ОписаниеПараметров), Приставка);
			КонецЕсли;
		ИначеЕсли НЕ ЭтоПервыйОператор ИЛИ ЭтоВложенныйЗапрос Тогда
			ТекстМодуля.ДобавитьСтроку("//  ОБЪЕДИНИТЬ ВСЕ");
			ДобавитьСтрокуМодуля(ТекстМодуля, "[ОператорВыбрать] = РаботаСоСхемойЗапроса.Оператор([ЗапросПакета]);", , Приставка);
		КонецЕсли;
		Если ЭтоПервыйОператор Тогда
			ЭтоПервыйОператор = Ложь;
		КонецЕсли;
		ДобавитьСтрокуМодуля(ТекстМодуля, "//  Источники");
		Для Каждого Источник Из ОператорВыбрать.Источники Цикл
			Псевдоним		= Источник.Источник.Псевдоним;
			ТипИсточника	= ТипЗнч(Источник.Источник);
			Если ТипИсточника = Тип("ВложенныйЗапросСхемыЗапроса") Тогда
				_Приставка = Приставка + ?(Псевдоним = "ВложенныйЗапрос", "", "ВложенныйЗапрос")+ Псевдоним;
				ДобавитьСтрокуМодуля(ТекстМодуля, "[ЗапросПакета] = РаботаСоСхемойЗапроса.Источник([ОператорВыбрать], РаботаСоСхемойЗапроса.ОписаниеВложенногоЗапроса(), ""[Псевдоним]"").Источник.Запрос;", Новый Структура("ОператорВыбрать, Псевдоним", Приставка+"ОператорВыбрать", Псевдоним), _Приставка);
				ДобавитьТекстМодуляЗапросаПакета(ТекстМодуля, Источник.Источник.Запрос, _Приставка, Истина);
			Иначе
				ИмяТаблицы	= Источник.Источник.ИмяТаблицы;
				Если ТипИсточника = Тип("ОписаниеВременнойТаблицыСхемыЗапроса") Тогда
					ДобавитьСтрокуМодуля(ТекстМодуля, "РаботаСоСхемойЗапроса.Источник([ОператорВыбрать], РаботаСоСхемойЗапроса.ПолучитьОписаниеВременнойТаблицы(""[ИмяТаблицы]""), ""[Псевдоним]"");", Новый Структура("ИмяТаблицы, Псевдоним", ИмяТаблицы, Псевдоним), Приставка);
				Иначе
					СтруктураПараметров = РаботаСоСхемойЗапроса.ПараметрыВиртуальнойТаблицы(ИмяТаблицы, Источник.Источник.Параметры);
					Если СтруктураПараметров = Неопределено Тогда
						Если Псевдоним = ОбщийКлиентСервер.ОкончаниеСтрокиПослеРазделителя(ИмяТаблицы) Тогда
							ДобавитьСтрокуМодуля(ТекстМодуля, "РаботаСоСхемойЗапроса.Источник([ОператорВыбрать], ""[ИмяТаблицы]"");", Новый Структура("ИмяТаблицы, Псевдоним", ИмяТаблицы), Приставка);
						Иначе
							ДобавитьСтрокуМодуля(ТекстМодуля, "РаботаСоСхемойЗапроса.Источник([ОператорВыбрать], ""[ИмяТаблицы]"", ""[Псевдоним]"");", Новый Структура("ИмяТаблицы, Псевдоним", ИмяТаблицы, Псевдоним), Приставка);
						КонецЕсли;
					Иначе
						ОписаниеКлючейПараметров = "";
						Для Каждого ЭлементПараметра Из СтруктураПараметров Цикл
							ОписаниеКлючейПараметров = ОписаниеКлючейПараметров + ?(ОписаниеКлючейПараметров = "", "", ", ") + ЭлементПараметра.Ключ;
						КонецЦикла;
						ОписаниеЗначенийПараметров = "";
						Для Каждого ЭлементПараметра Из СтруктураПараметров Цикл
							ОписаниеЗначенийПараметров = ОписаниеЗначенийПараметров + ?(ОписаниеЗначенийПараметров = "", "", ", ") + """" + ЭлементПараметра.Значение + """";
						КонецЦикла;
						ОписаниеПараметров = "Новый Структура(""" + ОписаниеКлючейПараметров + """, " + ОписаниеЗначенийПараметров + ")";
						ДобавитьСтрокуМодуля(ТекстМодуля, "РаботаСоСхемойЗапроса.Источник([ОператорВыбрать], ""[ИмяТаблицы]"", ""[Псевдоним]"", [ОписаниеПараметров]);", Новый Структура("ИмяТаблицы, Псевдоним, ОписаниеПараметров", ИмяТаблицы, Псевдоним, ОписаниеПараметров), Приставка);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ДобавитьСтрокуМодуля(ТекстМодуля, "//  Соединения");
		Для Каждого Источник Из ОператорВыбрать.Источники Цикл
			Для Каждого Соединение Из Источник.Соединения Цикл
				ТипСоединения = Соединение.ТипСоединения;
				СоответствиеПараметров = Новый Структура;
				СоответствиеПараметров.Вставить("ИсточникСлева"	, Источник.Источник.Псевдоним);
				СоответствиеПараметров.Вставить("ИсточникСправа", Соединение.Источник.Источник.Псевдоним);
				СоответствиеПараметров.Вставить("Условие"		, ОбщийКлиентСервер.ЭкранироватьТекст(Соединение.Условие));
				СоответствиеПараметров.Вставить("ТипСоединения"	, СтрЗаменить(ТипСоединения, " ", ""));
				Если ТипСоединения = ТипСоединенияСхемыЗапроса.ЛевоеВнешнее Тогда
					ДобавитьСтрокуМодуля(ТекстМодуля, "РаботаСоСхемойЗапроса.Соединение([ОператорВыбрать], ""[ИсточникСлева]"", ""[ИсточникСправа]"", ""[Условие]"");", СоответствиеПараметров, Приставка);
				Иначе
					ДобавитьСтрокуМодуля(ТекстМодуля, "РаботаСоСхемойЗапроса.Соединение([ОператорВыбрать], ""[ИсточникСлева]"", ""[ИсточникСправа]"", ""[Условие]"", ТипСоединенияСхемыЗапроса.[ТипСоединения]);", СоответствиеПараметров, Приставка);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		Если ОператорВыбрать.Отбор.Количество() > 0 Тогда
			ДобавитьСтрокуМодуля(ТекстМодуля, "//  Условия отборов");
			Для Каждого УсловиеОтбора Из ОператорВыбрать.Отбор Цикл
				ДобавитьСтрокуМодуля(ТекстМодуля, "[ОператорВыбрать].Отбор.Добавить(""[Условие]"");", Новый Структура("Условие", ОбщийКлиентСервер.ЭкранироватьТекст(УсловиеОтбора)), Приставка);
			КонецЦикла;
		КонецЕсли;
		ДобавитьСтрокуМодуля(ТекстМодуля, "//  Поля");
		Для Каждого Поле Из ОператорВыбрать.ВыбираемыеПоля Цикл
			Колонка 		= ЗапросПакета.Колонки.Найти(Поле);
			Псевдоним		= Псевдоним(Строка(Поле));
			Если Колонка.Поля.Количество()=1 И Псевдоним = Колонка.Псевдоним Тогда
				ДобавитьСтрокуМодуля(ТекстМодуля, "РаботаСоСхемойЗапроса.Поле([ЗапросПакета], [ОператорВыбрать],, ""[Поле]"");", Новый Структура("Поле", ОбщийКлиентСервер.ЭкранироватьТекст(Поле)), Приставка);
			Иначе
				ДобавитьСтрокуМодуля(ТекстМодуля, "РаботаСоСхемойЗапроса.Поле([ЗапросПакета], [ОператорВыбрать],, ""[Поле]"", ""[Псевдоним]"");", Новый Структура("Поле, Псевдоним", ОбщийКлиентСервер.ЭкранироватьТекст(Поле), Колонка.Псевдоним), Приставка);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Если ЗапросПакета.Порядок.Количество() > 0 Тогда
		ДобавитьСтрокуМодуля(ТекстМодуля, "//  Упорядочивание");
		Для Каждого ВыражениеПорядка Из ЗапросПакета.Порядок Цикл
			Элемент = ВыражениеПорядка.Элемент;
			Если ТипЗнч(Элемент) = Тип("ВыражениеСхемыЗапроса") Тогда
				Псевдоним = Строка(Элемент);
			Иначе
				Псевдоним = ВыражениеПорядка.Элемент.Псевдоним;//Тип("КолонкаСхемыЗапроса")
			КонецЕсли;
			Если ВыражениеПорядка.Направление = НаправлениеПорядкаСхемыЗапроса.ПоВозрастанию Тогда
				ДобавитьСтрокуМодуля(ТекстМодуля, "РаботаСоСхемойЗапроса.Порядок([ЗапросПакета], ""[Псевдоним]"");", Новый Структура("Псевдоним", Псевдоним), Приставка);
			Иначе
				ДобавитьСтрокуМодуля(ТекстМодуля, "РаботаСоСхемойЗапроса.Порядок([ЗапросПакета], ""[Псевдоним]"", [Направление]);", Новый Структура("Псевдоним, Направление", Псевдоним, "НаправлениеПорядкаСхемыЗапроса."+СтрЗаменить(ВыражениеПорядка.Направление, " ", "")), Приставка);
			КонецЕсли;
		КонецЦикла;
		Если ЗапросПакета.Автопорядок Тогда
			ДобавитьСтрокуМодуля(ТекстМодуля, "[ЗапросПакета].Автопорядок = Истина;",, Приставка);
		КонецЕсли;
	КонецЕсли;
	Если ЗапросПакета.КонтрольныеТочкиИтогов.Количество() > 0 Тогда
		ДобавитьСтрокуМодуля(ТекстМодуля, "//  Итоги");
		Для Каждого КонтрольнаяТочкаИтогов Из ЗапросПакета.КонтрольныеТочкиИтогов Цикл
			ПараметрыОператора = Новый Массив;
			ПараметрыОператора.Добавить("""[Выражение]""");
			
			Если КонтрольнаяТочкаИтогов.Выражение <> КонтрольнаяТочкаИтогов.ИмяКолонки Тогда
				ПараметрыОператора.Добавить("""[ИмяКолонки]""");
			Иначе
				ПараметрыОператора.Добавить("");
			КонецЕсли;
			
			Если КонтрольнаяТочкаИтогов.ТипКонтрольнойТочки <> ТипКонтрольнойТочкиСхемыЗапроса.Элементы Тогда
				ПараметрыОператора.Добавить("[ТипКонтрольнойТочки]");
			Иначе
				ПараметрыОператора.Добавить("");
			КонецЕсли;
			
			Если КонтрольнаяТочкаИтогов.ТипДополненияПериодами <> ТипДополненияПериодамиСхемыЗапроса.БезДополнения Тогда
				ПараметрыОператора.Добавить("[ТипДополненияПериодами]");
				ПараметрыОператора.Добавить("""[НачалоПериодаДополнения]""");
				ПараметрыОператора.Добавить("""[КонецПериодаДополнения]""");
			КонецЕсли;
			
			ПараметрыВызова = Новый Структура;
			Если ТипЗнч(КонтрольнаяТочкаИтогов.Выражение) = Тип("ВыражениеСхемыЗапроса") Тогда
				ПараметрыВызова.Вставить("Выражение", ОбщийКлиентСервер.ЭкранироватьТекст(КонтрольнаяТочкаИтогов.Выражение));
			Иначе // КолонкаСхемыЗапроса
				ПараметрыВызова.Вставить("Выражение", ОбщийКлиентСервер.ЭкранироватьТекст(КонтрольнаяТочкаИтогов.Выражение.Псевдоним));
			КонецЕсли;
			ПараметрыВызова.Вставить("ИмяКолонки", ОбщийКлиентСервер.ЭкранироватьТекст(КонтрольнаяТочкаИтогов.ИмяКолонки));
			ПараметрыВызова.Вставить("ТипКонтрольнойТочки", "ТипКонтрольнойТочкиСхемыЗапроса."+СтрЗаменить(КонтрольнаяТочкаИтогов.ТипКонтрольнойТочки, " ", ""));
			ПараметрыВызова.Вставить("ТипДополненияПериодами", "ТипДополненияПериодамиСхемыЗапроса."+СтрЗаменить(КонтрольнаяТочкаИтогов.ТипДополненияПериодами, " ", ""));
			ПараметрыВызова.Вставить("НачалоПериодаДополнения", КонтрольнаяТочкаИтогов.НачалоПериодаДополнения);
			ПараметрыВызова.Вставить("КонецПериодаДополнения", КонтрольнаяТочкаИтогов.КонецПериодаДополнения);
			
			ДобавитьСтрокуМодуля(ТекстМодуля, "РаботаСоСхемойЗапроса.Итог([ЗапросПакета], "+СтрСоединить(ПараметрыОператора, ", ")+");", ПараметрыВызова, Приставка);
		КонецЦикла;
	КонецЕсли;
	Если ЗапросПакета.ВыраженияИтогов.Количество() > 0 Тогда
		ДобавитьСтрокуМодуля(ТекстМодуля, "//  Выражения итогов");
		Для Каждого ВыражениеИтогов Из ЗапросПакета.ВыраженияИтогов Цикл
			ДобавитьСтрокуМодуля(ТекстМодуля, "ЗапросПакета.ВыраженияИтогов.Добавить(""[Выражение]"", ""[Поле]"");", Новый Структура("Выражение, Поле", ОбщийКлиентСервер.ЭкранироватьТекст(ВыражениеИтогов.Выражение), ОбщийКлиентСервер.ЭкранироватьТекст(ВыражениеИтогов.Поле.Псевдоним)), Приставка);
		КонецЦикла;
	КонецЕсли;
	Если ЗапросПакета.ОбщиеИтоги Тогда
		ДобавитьСтрокуМодуля(ТекстМодуля, "[ЗапросПакета].ОбщиеИтоги = Истина;",, Приставка);
	КонецЕсли;
	Если ЗапросПакета.Индекс.Количество() > 0 Тогда
		ДобавитьСтрокуМодуля(ТекстМодуля, "//  Индексы");
		Для Каждого Индекс Из ЗапросПакета.Индекс Цикл
			ДобавитьСтрокуМодуля(ТекстМодуля, "ЗапросПакета.Индекс.Добавить(""[Выражение]"");", Новый Структура("Выражение", ОбщийКлиентСервер.ЭкранироватьТекст(Индекс.Выражение.Псевдоним)), Приставка);
		КонецЦикла;
	КонецЕсли;
	Если ЭтоВложенныйЗапрос Тогда
		//ДобавитьСтрокуМодуля(ТекстМодуля, "//}	Вложенный запрос "+Приставка);
		ТекстМодуля.ДобавитьСтроку("//}	Вложенный запрос "+Приставка);
	КонецЕсли;
КонецПроцедуры
