//МодельЗапроса = Общий.МодельЗапроса(ТекстЗапроса);
//МодельЗапроса = Общий.МодельЗапроса(Схема, Настройки, Истина);
//МодельЗапроса = Общий.МодельЗапроса(Список, Истина);
Функция МодельЗапроса(ТекстЗапроса = "", Настройки = "") Экспорт
	МодельЗапроса = Обработки.МодельЗапроса.Создать();
	ТипЗначенияТекстаЗапроса = ТипЗнч(ТекстЗапроса);
	
	Если ТипЗначенияТекстаЗапроса = Тип("СхемаКомпоновкиДанных") Тогда
		Возврат МодельЗапросаСхемыКомпоновкиДанных(ТекстЗапроса, Настройки);
	КонецЕсли;

	Если ТипЗначенияТекстаЗапроса = Тип("ТаблицаФормы") Тогда
		Возврат МодельЗапросаДинамическогоСписка(ТекстЗапроса);
	КонецЕсли;
	
	Если ПустаяСтрока(ТекстЗапроса) Тогда
		Возврат МодельЗапроса;
	КонецЕсли;
	
	МодельЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	Возврат МодельЗапроса;
КонецФункции

Функция МодельЗапросаСхемыКомпоновкиДанных(Схема, Настройки) Экспорт
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(Схема, Настройки);
	ТекстЗапроса = МакетКомпоновкиДанных.НаборыДанных[0].Запрос;
	//ТекстЗапроса = Схема.НаборыДанных[0].Запрос;
	МодельЗапроса = Общий.МодельЗапроса(ТекстЗапроса);//:МодельЗапроса = Обработки.МодельЗапроса.Создать();
	Для Каждого ЗначениеПараметра Из МакетКомпоновкиДанных.ЗначенияПараметров Цикл
		МодельЗапроса.Параметр(ЗначениеПараметра.Имя, ЗначениеПараметра.Значение);
	КонецЦикла;
	Возврат МодельЗапроса;
КонецФункции

// Список - ТаблицаФормы - таблица, формируемая по динамическому списку
Функция МодельЗапросаДинамическогоСписка(Список) Экспорт
	Схема = Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	ПоляКлюча = Список.ТекущаяСтрока;
	Для Каждого ПолеКлюча Из ПоляКлюча Цикл
		КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Настройки.Отбор, ПолеКлюча.Ключ, ПолеКлюча.Значение, ВидСравненияКомпоновкиДанных.Равно, Истина);
	КонецЦикла;
	Настройки.Структура[0].Выбор.Элементы.Очистить();
	Для Каждого ДоступноеПоле Из Настройки.Структура[0].Выбор.ДоступныеПоляВыбора.Элементы Цикл
		Если ДоступноеПоле.Таблица ИЛИ ДоступноеПоле.Папка Тогда
			Продолжить;
		КонецЕсли;
		КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(Настройки.Структура[0].Выбор, ДоступноеПоле.Поле);
	КонецЦикла;
	МодельЗапроса = МодельЗапросаСхемыКомпоновкиДанных(Схема, Настройки);
	МодельЗапроса.ЗапросПакета.Порядок.Очистить();
	Возврат МодельЗапроса;
КонецФункции
